{"title":"Designer Shares Deep Dive Into History of Classic Apple Watch Faces","link":"https://www.macrumors.com/2021/01/25/apple-watch-face-history-deep-dive/","date":1611610591000,"content":"Designer Arun Venkatesan today <a href=\"https://www.arun.is/blog/apple-watch-faces/\">shared an interesting deep dive</a> into some of the classic watch designs that inspired various watch faces for the Apple Watch, detailing how Apple took design cues from well-known watches from companies like Rolex, Breitling, Heuer, and others.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/01/apple-california-watch-face.jpg\" alt=\"\" width=\"1743\" height=\"960\" class=\"aligncenter size-full wp-image-780186\" />\r\n<br/>\r\nVenkatesan delves into the California watch face, the Chronograph and Chronograph Pro watch faces, the Count Up watch face, and the GMT watch face.\r\n<br/>\r\n\r\n<br/>\r\nThe California watch face, for example, was inspired by a dial design that originated in World War II. The mix of Roman and Arabic numerals was thought to make the watch face more readable in low visibility.<blockquote>Originally called the \"error proof\" or \"high visibility\" dial, it adorned the fronts of \"bubble back\" Rolexes -- so-called because of the bubble-shaped back that gave the watches a thin appearance. Strikingly, the indices are set both in Roman and Arabic numerals where other watches would stick to one or the other. It's thought that mixing numerals aids both the wearer and his brothers-in-arms in reading the watch in low visibility conditions.</blockquote>The GMT watch face, meanwhile, was based on classic watches able to track two time zones at one time, while Count Up is based on classic dive watches.<blockquote>Unlike the previous faces, the name Count Up, refers to a type of bezel, not a dial or complication. Also known as the diving bezel, this rotating bezel, when coupled with the minute hand, helps measure elapsed time in minutes.\r\n<br/>\r\n\r\n<br/>\r\nThe count up bezel can be traced back to a monumental year in the history of the dive watch -- 1953.</blockquote>Apple's Chronograph watch faces are built on a long history of chronograph watches that date back to the early 1800s and have become some of the most popular watch face types. Venkatesan says that his research led him to be impressed with Apple's dedication to design, as it's clear that Apple took the time to study the history of many of the classic watch faces that are available in a digital format on the Apple Watch.<blockquote>As I researched and wrote this essay, my respect only increased. With the watch faces, Apple could have taken the easy way out by merely mimicking existing watch archetypes at a surface level. Instead, they intensely studied each one's history. When designing each face, they took into account that history and the constraints and opportunities afforded by modern technology.</blockquote>For those interested in the history of the Apple Watch and those who want to know more about the classic watches that have inspired Apple's designers, Venkatesan's article <a href=\"https://www.arun.is/blog/apple-watch-faces/\">is well worth reading through</a>.<br/>This article, &quot;<a href=\"https://www.macrumors.com/2021/01/25/apple-watch-face-history-deep-dive/\">Designer Shares Deep Dive Into History of Classic Apple Watch Faces</a>&quot; first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br/><br/><a href=\"https://forums.macrumors.com/threads/designer-shares-deep-dive-into-history-of-classic-apple-watch-faces.2281855/\">Discuss this article</a> in our forums<br/><br/><div class=\"feedflare\">\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=vufMpPUwRZE:b9U3ObRZNaA:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" border=\"0\"></img></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=vufMpPUwRZE:b9U3ObRZNaA:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" border=\"0\"></img></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/vufMpPUwRZE\" height=\"1\" width=\"1\" alt=\"\"/>","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"09069371ddac608e2401cc7d8f7d58ffa1195915126bb6c8dc3ecdaef4d61139","category":"Apple"}