{"title":"Bill Belichick Declines Presidential Medal of Freedom From Trump","link":"https://www.nytimes.com/2021/01/11/sports/football/trump-belichick-medal-capitol.html","date":1610416283000,"content":"\n<p>New England Patriots head coach Bill Belichick, <a href=\"https://www.washingtonpost.com/news/early-lead/wp/2016/11/09/bill-belichick-says-that-donald-trump-letter-was-about-friendship-not-politics/\">formerly “great friends”</a>, in a statement:</p>\n\n<blockquote>\n  <p>Recently, I was offered the opportunity to receive the\nPresidential Medal of Freedom, which I was flattered by out of\nrespect for what the honor represents and admiration for prior\nrecipients. Subsequently, the tragic events of last week occurred\nand the decision has been made not to move forward with the award.\nAbove all, I am an American citizen with great reverence for our\nnation’s values, freedom and democracy. I know I also represent my\nfamily and the New England Patriots team. One of the most\nrewarding things in my professional career took place in 2020\nwhen, through the great leadership within our team, conversations\nabout social justice, equality and human rights moved to the\nforefront and became actions. Continuing those efforts while\nremaining true to the people, team and country I love outweigh the\nbenefits of any individual award.</p>\n</blockquote>\n\n<p>The passive voice is doing a lot of work in that statement: Belichick was offered the award, a decision was made not to “move forward” with it. I don’t blame Belichick for the PR dance, but here’s what he means: <em>President Trump offered me the Medal of Freedom but because of what he did and the shame and disgrace he brought upon himself and our nation, I will not accept it.</em></p>\n\n<p>Beyond the pure schadenfreude, consider how deep this stain is on Trump’s reputation. The Presidential Medal of Freedom is our nation’s highest honor, and Trump is so disgraced that Bill Belichick declined to accept it <em>from him</em>. There’s a lot of unprecedented stuff going on right now, but declining a Presidential Medal of Freedom? Has anyone ever declined this award previously? A cursory search suggests no.</p>\n\n<p>I’m sure the MyPillow guy will accept his medal though.</p>\n\n<div>\n<a  title=\"Permanent link to ‘Bill Belichick Declines Presidential Medal of Freedom From Trump’\"  href=\"https://daringfireball.net/linked/2021/01/11/belichick-medal-of-freedom\">&nbsp;★&nbsp;</a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"0af3ba6304e349a738bd2d7c22e64b9937c00b8605877b93255ba11853073a90","category":"Tech"}