{"title":"A Guide to the 2021 Women’s WorldTour Teams","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/a-guide-to-the-2021-women-s-worldtour-teams","date":1610724819000,"content":"\n      <p class=\"p1\"><span class=\"s1\">Flashback to 2016, and women’s pro cycling was a one-horse race. Few teams had the budgets, or strength-in-depth, to challenge Boels-Dolmans and its all-star roster. </span></p>\n<div class=\"klaviyo-form-Ymj3Vm\"></div>\n<p class=\"p1\"><span class=\"s1\">The result? An impressive spectacle of strength, but a painfully predictable season of racing.</span></p>\n<p class=\"p1\"><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/six-reasons-to-follow-women-s-cycling-in-2021\"><em><strong><span class=\"s1\">Related – Six Reasons to Follow Women's Cycling in 2021</span></strong></em></a></p>\n<p class=\"p1\"><span class=\"s1\">Whether a cause or effect, the increase in popularity of women’s cycling has generated a very different landscape. In 2021, the nine women’s WorldTeams (up from seven in 2020) enjoy a more even spread of talent across the squads than ever before – creating a dynamic that has us all excited about the season ahead.</span></p>\n<p class=\"p1\"><span class=\"s1\">No single team has a monopoly on the strongest riders as women’s cycling continues to grow, so 2021 looks sure to bring yet another upward trend in the ever-growing depth of the women’s peloton. </span></p>\n<h4 class=\"p1\"><span class=\"s1\">Trek-Segafredo</span></h4>\n<p class=\"p1\"><span class=\"s1\"><b><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Picture_by_Alex_Whitehead_SWpix.com_-_29_08_2020_-_Cycling_-_UCI_Women_s_World_Tour_-_2020_La_Course_By_Le_Tour_with_FDJ_-_Nice_France_-_Lizzie_Deignan_of_Trek_Segafredo_celebrates_he_1024x1024.jpg?v=1610715999\" alt=\"\"></b></span></p>\n<p class=\"p1\"><em><span class=\"s1\">Image Credit: Alex Whitehead/SWpix.com</span></em></p>\n<p class=\"p1\"><span class=\"s1\">Trek-Segafredo dominated the curtailed 2020 season, finishing as the highest-ranked Women’s WorldTeam with 4380.98 points to Boels-Dolmans’ 3177.02. Most impressive is the fact that although benefitting from one of the biggest budgets in the women’s peloton the team fielded more or less the same squad for every race; the killer combo of Lizzie Deignan, Elisa Longo Borghini, and Ellen Van Dijk. </span></p>\n<p class=\"p1\"><span class=\"s1\">For 2021 Trek-Segafredo have retained the majority of their riders – with the triple-threat of Deignan, Longo Borghini and Van Dijk still at the helm – and bolstered their sprinting power by signing Australian Chloe Hosking from Rally as well as former World Champion Amalie Dideriksen. While other teams might pose a greater threat to their dominance this year, toppling Trek-Segafredo will still require a lot of power from the rest of the peloton.</span></p>\n<h4 class=\"p1\"><span class=\"s1\">SD Worx</span></h4>\n<p><span class=\"s1\"><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/SD_Worx_1024x1024.jpg?v=1610722912\" alt=\"\"></span></p>\n<p class=\"p1\"><span class=\"s1\">In their former iteration as Boels Dolmans, SD Worx dominated the women’s cycling scene with displays of impressively cohesive teamwork among some of the biggest names in the sport, and that looks set to remain under the team’s new sponsorship. </span></p>\n<p class=\"p1\"><span class=\"s1\">Aside from the small matter of the five national champions on the team, (Luxembourgish, South African, Canadian, New Zealand and Dutch), SD Worx is also home to the current double world champion, Anna van der Breggen. 2021 will be the Dutch rider’s fifth season with the team and her final year of racing before she transitions into her role as DS for SD Worx from 2022. </span></p>\n<p class=\"p1\"><span class=\"s1\">The World Champion isn’t the only rider the team can pin their hopes on, however, with established riders such as Elena Cecchini and Ashleigh Moolman Pasio joining in 2021 alongside bright young talents such as Niamh Fisher Black and Demi Vollering the team look set to threaten on all terrains.</span></p>\n<h4 class=\"p1\"><span class=\"s1\">Movistar<b> </b></span></h4>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/2021_Almeria_TTT_Training_-_017_1024x1024.jpg?v=1610722411\" alt=\"\"></p>\n<p><em>Image Credit: Photo Gomez Sport/ Movistar Team</em></p>\n<p class=\"p1\"><span class=\"s1\">Last year Movistar looked on paper to have a reasonably strong squad, with the Spanish national champion Lourdes Oyarbide, and former Spanish TT champion and fast-finisher Sheyla Gutiérrez on board, but, the team failed to get a single World Tour podium in 2020. Movistar’s fortunes, however, look set to change exponentially this season.</span></p>\n<p class=\"p1\"><span class=\"s1\">Enter, Annemiek van Vleuten. The former world champion and prolific winner has joined the team from Mitchelton-Scott - where she had spent the previous five seasons - in a move that many found somewhat surprising. The former road and TT World Champion would have had her pick of the WorldTeams to move to after her contract was up at Mitchelton, however she claimed in an interview that she preferred the “challenge” of a team like Movistar and turned down Trek-Segafredo in order to keep women’s cycling “interesting” and spread the talent out. </span></p>\n<p class=\"p2\">The team around van Vleuten has been strengthened by new signings in the form of Leah Thomas, who took third place at Strade Bianche in 2020, and promising young Dane, Emma Cecilie Norsgaard. Watch out for Movistar when it comes to time trialling in particular. <br><span class=\"s1\"></span></p>\n<h4 class=\"p1\"><span class=\"s1\">DSM </span></h4>\n<p><span class=\"s1\"><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/1607014060260_1024x1024.jpg?v=1610723064\" alt=\"\"></span></p>\n<p class=\"p1\"><span class=\"s1\">As Team Sunweb, DSM finished third in the WorldTeam ranking in 2020 with most of their top-tier results coming from a trio of young stars in the form of Liane Lippert, Lorena Wiebes and Floortje Mackaij along with an impressive palmares for experienced Canadian Leah Kirchman. </span></p>\n<p class=\"p2\">Supported by new title sponsorship in 2021 the team looks likely to be targeting Classics and sprints once again and will be hoping that Coryn Rivera can overcome the bad luck she faced in 2020 to join forces with Wiebes in fast finishes. <br><span class=\"s1\"></span></p>\n<p class=\"p1\"><span class=\"s1\">With Alison Jackson moving to Liv Racing and Pernille Mathiesen and Anna Henderson transferring to Jumbo-Visma, DSM have two newcomers for 2021 –one of which is young American, Megan Jastrab. The junior world champion’s reputation precedes her as she enters her first season on a WWT squad at the age of just 18 and without having raced a UCI road race since 2019. There are already high expectations around her potential. </span></p>\n<h4 class=\"p1\"><span class=\"s1\">Team BikeExchange </span></h4>\n<p><span class=\"s1\"><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/MANDATORY_BYLINE_PHOTO_CREDIT_D_Alberto-LaPresse_CorVos_SWpix.com_1024x1024.jpg?v=1610717637\" alt=\"\"></span></p>\n<p><em><span class=\"s1\">Image credit: D`Alberto-LaPresse/CorVos/SWpix.com</span></em></p>\n<p class=\"p1\"><span class=\"s1\">Far from rendered rudderless after the departure of their ‘star’ rider Annemiek van Vleuten, BikeExchange (formerly Mitchelton-Scott) have had an overhaul. The team will ride with a new name, new kit, new bikes and some new riders too. </span></p>\n<p class=\"p1\"><span class=\"s1\">The dynamics of the squad look set to be shaken up as Australian Amanda Spratt steps out from Van Vleuten’s shadow to take up the leadership mantle. Aside from the retired Gracie Elvin the rest of the squad remains the same, but for four new signings who the team will hope can work for Spratt as she worked for van Vleuten. Among the new recruits are experienced Spanish climber Ane Santesteban and promising Trinidadian World Cycling Centre graduate Teniel Campbell both in their first years on a WorldTeam. </span></p>\n<p class=\"p2\">Apart from boasting a strong GC/climbing team around Amanda Spratt, BikeExchange are also set to field a formidable classics squad around Grace Brown who took second in Liège-Bastogne-Liège Femmes and won the 1.1 Brabantse Pijl last season. </p>\n<h4 class=\"p1\"><span class=\"s1\">Canyon-SRAM</span></h4>\n<p><span class=\"s1\"><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW1_4013_1024x1024.jpg?v=1610717933\" alt=\"\"></span></p>\n<p><em><span class=\"s1\">Image Credit: </span>Alex Whitehead/SWpix.com</em></p>\n<p class=\"p1\"><span class=\"s1\">The headline news at Canyon SRAM has been their signing of the controversial yet spectacularly strong American, Chloe Dygert. Dygert’s horror crash at the World Championships turned out to be the least of the team’s worries as her social media activity raised more than a few eyebrows over winter. </span></p>\n<p class=\"p1\"><span class=\"s1\">While she may have proven to be a PR headache, Dygert will surely be an asset to the team on the road once she is fully recovered and back to her incredible best form. Canyon SRAM’s time trial efforts had fallen away somewhat since their domination of the now defunct TTT event at the World Championships and Dygert is the ultimate asset in that field. </span></p>\n<p class=\"p1\"><span class=\"s1\">Elsewhere, the team has seen a lot of movement with six riders moving on and four new members joining for this season. As has been the case since 2016, the winner of the Zwift Academy - this year, Neve Bradbury - has been given a spot. The team has also claimed two riders from the remains of Equipe Paule Ka including Swiss national champion Elise Chabey as well as Giro Rosa youth classification winner Mikayla Harvey who they no doubt hope will continue her upward trajectory as she develops. </span></p>\n<p class=\"p1\"><span class=\"s1\">There's no doubt that Kasia Niewiadoma will continue to be a leading force in the team. Second place in the general classification at the Giro Rosa, and 7th place at the World Championships Road Race, </span>Niewiadoma will be looking for a big win this year. With a strengthened team, she may just get one.</p>\n<h4 class=\"p1\"><span class=\"s1\">Liv Racing </span></h4>\n<p><span class=\"s1\"><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/DSC_6381_1024x1024.jpg?v=1610718314\" alt=\"\"></span></p>\n<p><em><span class=\"s1\">CCC-Liv has become Liv Racing (Image credit:</span> Simon Wilkinson/SWpix.com)</em></p>\n<p class=\"p1\"><span class=\"s1\">Liv Racing comprises the remains of the CCC-Liv team and is the latest iteration of a squad that was originally formed around the inimitable Marianne Vos who has now moved on to the new Jumbo Visma women’s team.</span></p>\n<p class=\"p1\"><span class=\"s1\">In the absence of Vos the team appear to have restructured to focus on sprinting and have signed one of the best breakthrough riders of 2020, Lotte Kopecky. The Belgian multidisciplinary rider claimed both the Belgian road and time trial championship titles topped off by a stage win at the Giro Rosa and three podiums at Gent-Wevelgem, Tour of Flanders and Driedaagse Brugge-De Panne. The 25-year-old has spent her winter racing cyclocross and if her recent World Cup win in Hulst is anything to go by, she remains in top condition. </span></p>\n<p class=\"p1\"><span class=\"s1\">Kopecky will be joined by Canadian TikTok enthusiast Alison Jackson who showed herself to be an invaluable domestique and right-hand woman to Coryn Rivera on her former team of Sunweb whilst achieving some impressive top-10s herself. Liv Racing might also find themselves a few extra watts by having one of the best new kits in the women’s peloton. </span></p>\n<h4>\n<span class=\"s1\">FDJ </span>Nouvelle Aquitaine Futuroscope </h4>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW1_3999_1024x1024.jpg?v=1610723289\" alt=\"\"></p>\n<meta charset=\"utf-8\">\n<p><em>Cecilie Uttrup Ludwig will continue leading FDJ Nouvelle Aquitaine Futuroscope (Image credit: Alex Whitehead/SWpix.com)</em></p>\n<p class=\"p1\"><span class=\"s1\">At first glance not much has changed at FDJ Nouvelle Aquitaine Futuroscope for 2021. The team will continue to be led by 25 year-old Danish star Cecilie Uttrup Ludwig who will be looking to better a string of there-but-not-quite results in 2020. Uttrup Ludwig will still benefit from the support of the likes of former Swedish national champion Emilia Fahlin and powerhouse domestique Brodie Chapman. </span></p>\n<p class=\"p1\"><span class=\"s1\">Waiting in the wings, however is young French talent Évita Muzic who won the final stage of the 2020 Giro Rosa. The French team will continue to nurture home-grown talent in the form of Jade Wiel who looks set to follow Muzic’s development path. With a shot at both elite and U23 successes FDJ are going from strength to strength. </span></p>\n<h4 class=\"p1\"><span class=\"s1\"><b>Alé BTC Ljubljana</b></span></h4>\n<p class=\"p1\"><span class=\"s1\"><b><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/DSC00742_1024x1024.jpg?v=1610716244\" alt=\"\"></b></span></p>\n<p><em><span class=\"s1\">Image Credit: </span>Zac Williams/SWpix.com</em></p>\n<p class=\"p1\"><span class=\"s1\">Perennially underrated and underestimated, Alé BTC Ljubljana have the results and the team to back up their WorldTeam status.</span></p>\n<p class=\"p2\">Perhaps one of the most memorable rides of the foreshortened 2020 season came from the team in the form of Mavi Garcia in a (hopefully) one-off summer edition of Strade Bianche in August. Garcia broke away solo before being caught by a seemingly unstoppable Annemiek van Vleuten and then showed her tenacity and strength by staying on van Vleuten’s wheel to the final climb where she eventually came second.<br><span class=\"s1\"></span></p>\n<p class=\"p2\">The consistent Spanish rider followed this up by becoming both road and TT champion before going on to race 16 out of 17 days between the Tour Cycliste Féminin International de l'Ardèche and the Giro Rosa where she was 2nd and 9th respectively on GC. <br><span class=\"s1\"></span></p>\n<p class=\"p1\"><span class=\"s1\">But Garcia isn’t the team’s only star, former world and European champion Marta Bastianelli also rides for the Italian-registered squad as does the aggressive Slovenian rider Eugenia Bujak who came second from a breakaway on the 170km stage of the Giro Rosa in 2020. With Swiss time trial champion Marlen Reusser and promising young British rider Sophie Wright joining in 2021 the team look set to become even more of a threat. </span> </p>\n<h3 class=\"p1\"><span class=\"s2\">Continental Teams to Watch </span></h3>\n<h4 class=\"p1\"><span class=\"s1\"><b>Team Jumbo-Visma<br></b></span></h4>\n<p><span class=\"s1\"><b><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/OFS_Marianne_Vos_2012_01_1024x1024.jpg?v=1610717536\" alt=\"\"><br></b></span></p>\n<p class=\"p1\"><em><span class=\"s1\">As new signings go, they don't get much bigger than Marianne Vos</span></em></p>\n<p class=\"p1\"><span class=\"s1\">Although fronted by Marianne Vos (who needs no introduction) and boasting the budget and colossal reputation of their men’s counterpart might give the impression that Jumbo-Visma are a WorldTeam, they are in fact a Continental outfit in 2021. As Boels Dolmans before them, however, this status is merely nominal and is the result of a UCI technicality which states that new teams cannot enter at WorldTeam level.</span></p>\n<p class=\"p1\"><span class=\"s1\">Despite being the new kid on the block, Jumbo-Visma will undoubtedly become a regular feature of World Tour podiums with the legendary Vos in their midst. The largely Dutch roster includes a mix of strong proven riders and upcoming young talent including Jip van den Bos, Riejanne Markus and Anouska Koster. Look out, too for 22 year-old British rider Anna Henderson who has been steadily making her presence known at the pointy end of World Tour races for a few seasons now. </span></p>\n<h4 class=\"p1\"><span class=\"s1\">Ceratizit WNT</span></h4>\n<p><span class=\"s1\"><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Tivoli_-_Italy_-_wielrennen_-_cycling_-_radsport_-_cyclisme_-_Banks_Lizzy_Great_Britain_Team_Bigla_-_Katusha_pictured_during_stage_4_of_the_Giro_d_Italia_Internazionale_Femminile_2020_1024x1024.jpg?v=1610717365\" alt=\"\"><br><em>Image credit: Anton Vos/Cor Vos</em></span></p>\n<p class=\"p1\"><span class=\"s1\">Ceratizit WNT is a team that has gone from strength-to-strength since its inception in 2016. For the past few seasons in particular the German-registered team has taken WorldTeams to task, achieving results well above their Continental stature. </span></p>\n<p class=\"p1\"><span class=\"s1\">Ceratizit-WNT have nurtured former world TT champion Lisa Brennauer back to her best and for 2021 have picked up one of the breakthrough riders of 2020 in the form of two-time Giro Rosa stage winner Lizzy Banks. Look out for Ceratizit-WNT kit in the mix in bunch sprints on the back of fast-finishing Finn Lotta Henttala who after something of a fallow year in 2020 has joined the team from Trek-Segafredo.</span></p>\n<p class=\"p1\"><em><span class=\"s1\">Title image: </span>Photo Gomez Sport/ Movistar Team</em></p>\n<div class=\"klaviyo-form-UFKPji\"></div>\n    ","author":"Miles Baker-Clarke","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"11db83839d451237b7cefb136c7a7df40ab1b8db5c9af870a285155aee743a3c","category":"Cycling"}