{"title":"HashiCorp and AWS Launch Quick Start Guides for Vault 1.6 on Amazon EKS and EC2","link":"https://www.hashicorp.com/blog/hashicorp-and-aws-launch-vault-eks-and-amazon-ec2-quick-start-guides","date":1608134400000,"content":"<p>We are pleased to announce an update to the <a href=\"https://aws.amazon.com/quickstart/architecture/vault/\">HashiCorp Vault on Amazon EC2</a> and <a href=\"https://aws.amazon.com/quickstart/architecture/eks-vault/\">HashiCorp Vault on Amazon EKS</a> quick start guides.</p>\n<p>AWS quick start guides are built by AWS solutions architects and partners to help users deploy technologies on AWS, based on AWS best practices for security and high availability. The Vault guide helps users learn and implement an open-source HashiCorp Vault cluster in an AWS environment. This guide has been updated to include the latest version of Vault and incorporates important features that have been added since the previous version of this guide was published.</p>\n<p>In this blog, we’ll explain which features have been added to the guide and the benefits they provide.</p>\n<h2><a class=\"__permalink-h\" href=\"#integrated-storage-with-raft-consensus-algorithm\" aria-label=\"integrated storage with raft consensus algorithm permalink\">»</a><a class=\"__target-h\" id=\"integrated-storage-with-raft-consensus-algorithm\" aria-hidden></a>Integrated Storage with Raft Consensus Algorithm</h2>\n<p><a href=\"https://www.vaultproject.io/docs/concepts/integrated-storage\">Integrated Storage</a> is a storage engine built into Vault, removing the need for configuring and managing additional storage backends or services, and simplifying deployment and operations of production Vault clusters significantly. Vault’s integrated storage that is deployed in this guide provides users with data consistency. Unlike other storage backends, Integrated Storage does not operate from a single source of data. Instead all the nodes in a Vault cluster will have a replicated copy of Vault's data. Data gets replicated across all the nodes via the <a href=\"https://raft.github.io/\">Raft Consensus Algorithm</a>.</p>\n<h2><a class=\"__permalink-h\" href=\"#aws-kms-backend-for-vault-auto-unseal\" aria-label=\"aws kms backend for vault auto unseal permalink\">»</a><a class=\"__target-h\" id=\"aws-kms-backend-for-vault-auto-unseal\" aria-hidden></a>AWS KMS Backend for Vault Auto-Unseal</h2>\n<p>Vault’s auto unseal capabilities were introduced in the <a href=\"https://www.hashicorp.com/blog/vault-1-0\">1.0 release</a>. When a Vault server is started, it starts in a <a href=\"https://www.vaultproject.io/docs/concepts/seal.html\">sealed</a> state and it does not know how to decrypt data. Before any operation can be performed on Vault, it must be unsealed. Vault’s auto-unseal feature delegates the unsealing process to AWS KMS. This guide deploys a Vault cluster with auto-unseal turned on via AWS KMS. This feature enables operators to delegate the unsealing process to AWS KMS to ease operations in the event of partial failure and to aid in the creation of new or ephemeral clusters. For more information about Vault’s auto-unseal with AWS KMS, follow the <a href=\"https://learn.hashicorp.com/tutorials/vault/autounseal-aws-kms?in=vault/auto-unseal\">Learn guide</a>.</p>\n<h2><a class=\"__permalink-h\" href=\"#aws-acm-private-ca-for-load-balancer\" aria-label=\"aws acm private ca for load balancer permalink\">»</a><a class=\"__target-h\" id=\"aws-acm-private-ca-for-load-balancer\" aria-hidden></a>AWS ACM Private CA for Load Balancer</h2>\n<p>Vault’s 1.6 release included support for the <a href=\"https://aws.amazon.com/certificate-manager/private-certificate-authority/\">AWS Certificate Manager (ACM) Private Certificate Authority</a>. Vault users now have the ability to leverage ACM Private CA as its Certificate Authority provider for providing and managing root and intermediate certificates for performing certificate signing operations. In the case of this guide, users will secure incoming traffic to the VPC through an application load balancer, deployed with the guide, with a certificate from ACM Private CA. If users have another trusted Certificate Authority that they are using, there is also an option to provide a different Secure Sockets Layer (SSL). Implementing this trusted connection point is a critical component of enabling AWS’s autoscaling capabilities.</p>\n<h2><a class=\"__permalink-h\" href=\"#helm-chart-support-on-amazon-eks-control-plane-vault-on-amazon-eks\" aria-label=\"helm chart support on amazon eks control plane vault on amazon eks permalink\">»</a><a class=\"__target-h\" id=\"helm-chart-support-on-amazon-eks-control-plane-vault-on-amazon-eks\" aria-hidden></a>Helm Chart Support on Amazon EKS Control Plane (Vault on Amazon EKS)</h2>\n<p><a href=\"https://aws.amazon.com/quickstart/architecture/eks-vault/\">HashiCorp Vault on Amazon EKS</a> quick start guide is designed to deploy a Vault cluster via <a href=\"https://github.com/hashicorp/vault-helm\">Vault helm chart</a>. The deployment wizard supports a number of advanced options to customize the installation such as the number of server pods and clients. This guide deploys Amazon EKS as a base layer, then it deploys Vault via helm chart with industry best practices for deploying Vault on Amazon EKS. For more information visit <a href=\"https://learn.hashicorp.com/tutorials/vault/kubernetes-raft-deployment-guide?in=vault/kubernetes\">Vault on Kubernetes Deployment Guide</a> and <a href=\"https://learn.hashicorp.com/tutorials/vault/kubernetes-reference-architecture?in=vault/kubernetes\">Vault on Kubernetes Reference Architecture</a>.</p>\n<h2><a class=\"__permalink-h\" href=\"#next-steps\" aria-label=\"next steps permalink\">»</a><a class=\"__target-h\" id=\"next-steps\" aria-hidden></a>Next Steps</h2>\n<p>These guides were updated in collaboration with the quick start team at AWS. They make it simple for users to get started using Vault for the first time or for deploying it into their existing environment. The goal for updating these guides is to ensure that users are aware of the latest features that Vault is offering. To get started using this guide, visit the Quick Start pages: <a href=\"https://aws.amazon.com/quickstart/architecture/vault/\">HashiCorp Vault on Amazon EC2</a> and <a href=\"https://aws.amazon.com/quickstart/architecture/eks-vault/\">HashiCorp Vault on Amazon EKS</a>.</p>\n<p>For more information about Vault, please visit our <a href=\"https://www.vaultproject.io/\">product page</a>.</p>","author":"Dan Callao","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"1561b65cf4f7d38b3e3fcbe63297b92ef330852106254699d10836fa96940680","category":"Tech"}