{"title":"What will Mark Cavendish bring to Deceuninck-QuickStep?","link":"https://www.cyclist.co.uk/in-depth/9117/what-will-mark-cavendish-bring-to-deceuninck-quickstep","date":1610623452000,"content":"<span class=\"field field-name-field-author field-type-node-reference field-label-hidden\">\n      <span class=\"field-item even\"><a href=\"/authors/joe-robinson\">Joe Robinson</a></span>\n  </span><div class=\"field field-name-field-published-date field-type-datetime field-label-hidden\">  \n  <div class=\"field-items\">      <div class=\"field-item even\"><span class=\"date-display-single\" property=\"dc:date\" datatype=\"xsd:dateTime\" content=\"2021-01-14T12:20:00+00:00\">14 Jan 2021</span></div>    </div></div><p class=\"short-teaser\">\nAged 35, Mark Cavendish admits he is not the rider he used to be. So why did Deceuninck-QuickStep sign him?</p>\n<div class=\"primary-image\">\n      <img typeof=\"foaf:Image\" src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2021/01/mark-cavendish-deceuninck-quickstep-2021.jpeg?itok=ZC_8-zFy\" />  </div>\n<div class=\"field field-name-body\">\n      <p> <strong>Aged 35, Mark Cavendish admits he is not the rider he used to be. So why did Deceuninck-QuickStep sign him?</strong></p>\n<p><strong>Words</strong>: Joe Robinson <strong>Photography</strong>: Deceuninck-QuickStep</p>\n<p>The <a href=\"/news/3229/professional-cycling-transfers-2020-2021-all-the-moves-and-shakes\">biggest cycling transfer for the 2021 season</a> was that of a 35-year-old rider who has not won a bike race since the 8th February 2018 joining Deceuninck-QuickStep on what would be known in football terms as a free.</p>\n<p>This was not because the transfer market was particularly barren over the winter – Adam Yates joining Ineos Grenadiers and <a href=\"/in-depth/9077/the-10-transfers-that-will-take-a-while-to-get-used-to-in-2021\">Chris Froome signing for Israel Start-Up Nation</a> disprove that. It is just that when a rider like Mark Cavendish joins a new team, it is headline news.</p>\n<p>Even more so when his signature came from seemingly nowhere. After giving that tearful post-race interview at Gent-Wevelgem last season, it looked as if Cavendish’s career was over. His contract with Bahrain-McLaren was up and no alternative had presented itself.</p>\n<p>But as team manager Patrick Lefevere put it at the <a href=\"/tags/deceuninck-quickstep\">Deceuninck-QuickStep</a> presentation on Wednesday, a rider like Cavendish did not deserve to leave the sport in that way. So after a few phone calls, a third-party sponsor and 48 hours of negotiation, a deal was made and Cavendish became a QuickStep rider for the second time in his career.</p>\n<p>‘I feel the same as the Belgian fans: I live and breathe cycling, so I just feel at home at Deceuninck-QuickStep,’ Cavendish said from the team presentation in Spain.</p>\n<p>After the tears in Wevelgem, other teams did express an interest in signing Cavendish but he admits, ‘There was really only one place I wanted to go.</p>\n<p>‘Ultimately, I was at my happiest when I was here and the opportunity to come back and race for Deceuninck-QuickStep is a dream – if I do one month more or 10 years more.’</p>\n<p>What Cavendish gets from this deal is obvious. His career is extended by at least another year, one year further away from retirement and a last chance saloon with the world’s best team in which he considers ‘home’.</p>\n<p>But what does a super-team like Deceuninck-QuickStep get from signing Cavendish? Well, it depends.</p>\n<h3>Ruthless winner to wise old man</h3>\n<p>When Cavendish had his first stint at QuickStep in 2013, it was clear what Lefevere had invested in – a stone-cold winner. He took on a prime Cavendish, a man who would consider anything less than two stage wins at a Grand Tour to be ‘underwhelming’.</p>\n<div id=\"file-42380\" class=\"file file-image file-image-jpeg file-content-original\">\n<div class=\"content\">    <img typeof=\"foaf:Image\" src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/2021/01/ofs_mark_cavendish_2014_08.jpg\" alt=\"\" />  </div>\n</div>\n<p>Things could not be more different with this second spell. Now in his mid-thirties having suffered illness, crises of confidence and the unavoidable march of time, Cavendish is no longer the serial winner he once was. And that’s something he admits himself.</p>\n<p>‘If I thought I wanted to go and race and win six stages of the Tour de France again I’m in fairytale land,’ admitted a humble Cavendish his first press conference back with the Deceuninck-QuickStep team.</p>\n<p>‘It makes it even less likely when you come to the strongest team in the world, the way they dominate. I’m not looking to hang on to something or try to finish my career in any fairytale way.’</p>\n<p>While he knows he cannot compete at the highest level on a regular basis anymore, he is not admitting defeat entirely stating ‘I just know that I’m still good. Even if I’m not winning, I can still add something to this team’.</p>\n<p>At the press conference, Cavendish was sitting next to Irish sprinter and now teammate Sam Bennett, the current <a href=\"/tags/tour-de-france\">Tour de France</a> green jersey holder. One of the most talented sprinters in the world with a frightening ability to dig deeper than those around him, but also a rider who has sometimes allowed self-doubt to creep into his performances, a trait rarely seen in the cut-throat world of sprinting. If anybody has the ability to teach Bennett the art of self-confidence bordering on arrogance, it is Cavendish.</p>\n<p>And next to Bennett was <a href=\"/news/8967/fabio-jakobsen-back-riding-his-bike-after-horror-crash\">Fabio Jakobsen</a>, the young Dutch sprinter who is simply lucky to be alive after his horror crash at last year’s Tour of Poland. It's a sheer miracle that he is even considering racing in 2021, and is there anybody better than Cavendish to guide to a guide a young rider on their journey back to the top having been written off?</p>\n<p>The idea of the 35-year-old Manxman being the 20-race-win-a-season a sprinter he once was is now a pipedream but he is more than equipped to take on the role as an elder statesman. This does not mean Cavendish will be reinventing himself to become a tireless domestique for those around him or barking orders from the front of the peloton as road captain. But Cavendish will present a force for good on and off the bike for QuickStep. And it sure helps that the pressure is off, too.</p>\n<div class=\"field field-name-field-see-related field-type-node-reference field-label-above\">      <div class=\"field-label\">See related&nbsp;</div>\n  \n  <div class=\"field-items\">      <div class=\"field-item even\"><a href=\"/buying-guides/3865/buyers-guide-best-bicycle-mudguards\">Best bicycle mudguards for winter 2021: protect your bike </a></div>      <div class=\"field-item odd\"><a href=\"/buying-guides/2079/best-winter-gloves-for-cycling\">Best cycling gloves for winter 2021</a></div>      <div class=\"field-item even\"><a href=\"/buying-guides/7925/turbo-training-accessories-everything-you-need-for-training-indoors\">Turbo training accessories: Everything you need for training indoors</a></div>    </div></div><p>\nCavendish is in a unique position he has never experienced in his entire career before in that he has joined a team without having the weight of the world thrust upon his shoulders.</p>\n<p>Normally, when Cavendish joins a team, it’s all eyes on him as team leader, marquee rider, the one expected to be the primary race winner. But not here. This is a team that has World Champion Julian Alaphilippe, Sam Bennett, Remco Evenepoel and many more, a team that has finished with more victories than anybody else in every season since 2012. The perfect environment for refinding and reinvention.</p>\n<p>And if there was ever a team that could guide Cavendish to one last hurrah, it’s Lefevere’s QuickStep, right?</p>\n<p>Lefevere has previous in finding a tune from an ageing violin. Not too long ago, in 2017, he took on a 35-year-old Philippe Gilbert who looked to be past his best. A combination of newfound belief, adjusted adjectives and a bonus-based contract resulted in a career renaissance for the previous World Champion.</p>\n<div id=\"file-27982\" class=\"file file-image file-image-jpeg file-content-original\">\n<div class=\"content\">    <img typeof=\"foaf:Image\" src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/2019/04/philippe-gilbert-paris-roubaix-2-_tim-de-waele-getty-images.jpg\" alt=\"\" />  </div>\n</div>\n<p>Gilbert rolled back the clock, winning the Tour of Flanders and Amstel Gold Race in 2017 and <a href=\"/tags/paris-roubaix\">Paris-Roubaix</a> in 2019. Could there be one last big victory left in Cavendish’s legs?</p>\n<h3>More than just a cyclist</h3>\n<p>And if all else does fail, what Cavendish riding in your colours does guarantee is exposure.</p>\n<p>A master of the game, his social media following is vast and he has always been an exemplary figure in regards to promoting the products of his sponsors. Developing a bike with Specialized and sunglasses with Oakley, always in a Monster Energy drink cap and never without his Richard Mille watch, Cavendish knows how to sell. All too valuable in a sport that survives on a fragile sponsorship model in which exposure can be just as valuable as results.</p>\n<p>Even sitting in the recent virtual team presentation from Spain, Cavendish could be seen with a set of Bang &amp; Olufsen headphones draped around his neck and his sleeves suitably rolled up to expose his Richard Mille watch. He really does play the game better than any.</p>\n<p>And you may ask why a team like QuickStep needs any more exposure than it already has. Cycling is a fickle sport in which sponsors have happily left at the drop of the hat from even the most successful of teams. Despite the immense success of QuickStep over the past decade, Lefevere himself has not been shy in sharing the team’s occasional financial woes, and how close the team has come to winding up in recent years. With a rider like Cavendish on your roster, no matter his results, you are guaranteed column inches and TV time.</p>\n<p>So what does a super team like Deceuninck-QuickStep get from signing Cavendish? Well, quite a lot. </p>\n  </div>\n<div class=\"field field-name-field-category-primary field-type-taxonomy-term-reference field-label-hidden\">  \n  <div class=\"field-items\">      <div class=\"field-item even\"><a href=\"/general-news\" typeof=\"skos:Concept\" property=\"rdfs:label skos:prefLabel\" datatype=\"\">General news</a></div>    </div></div>","author":"jrobinson","siteTitle":"Featured Articles","siteHash":"f129cda89106022134374fa071789f236ffc24ddd29b6bf4220b1143ee6f092f","entryHash":"221ba0980081618f1ab14057100ef4902943a9880f640118ef9ec99f54ad981e","category":"Cycling"}