{"title":"Tour de France 2040: On Tour with Bowie","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-2040-modern-love","date":1610114595000,"content":"\n      <p><em>There are 33 David Bowie song titles shoehorned into this feature. Good luck, Bowie-philes...</em></p>\n<p>The year is 2040. The 127th edition of the Tour de France, the biggest bike race on the planet, is about to get underway in Yorkshire for the second time in its long and illustrious history.</p>\n<p>It has been a rocky few years for the race following the scandalous 2027 edition, when sock doping – literally – and helium-filled bikes became the talking points that overshadowed the win by Alexi Smirnoff of Team Timchenko, himself later disqualified. </p>\n<p>But the venerable institution that is Le Tour bounced back, as it invariably does, bolstered by the first victory for a Chinese rider the following year, and an athlete of colour topping the podium for the very first time in 2030. True globalisation has finally arrived.</p>\n<p>And alongside globalisation, modernisation. A race steeped in tradition has evolved into one of the biggest sports events on the world calendar, grossing billions of Euros while others have fallen by the wayside. The worldwide ban of fossil-fuelled motor racing saw Formula 1’s demise in the Twenties, while football’s seemingly never-ending cash pyramid collapsed in the global market crash of 2034.</p>\n<p>Cycling, meanwhile, has never been stronger. Millions of spectators line the roads and pay for the privilege. Fan interaction for the armchair viewer has never been so sophisticated. Team cars are a thing of the past. And women have been brought into the Tour fold at last following a 25-year campaign. Unbelievable, isn’t it?</p>\n<p>The Tour of the future starts here. Take your protein pills and put your helmet on. <br><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Bike_illustration_CMYK_1024x1024.jpg?v=1610113769\" alt=\"Tour de France 2040\"><br><strong>THE PROLOGUE: GOING NOWHERE FAST</strong></p>\n<p>We begin in the English cathedral city of York. It is, predictably, teeming with rain, as it has been all week. The 4.6km prologue circuit features numerous technical twists and turns as it wends its way around the narrow streets of this ancient Roman settlement before finishing beside the medieval Norman remains of the castle. </p>\n<p>ASO are mindful of historic criticism regarding rider safety in days gone by. Who can forget Chris Boardman’s spectacular crash after just four minutes of the 1995 edition in biblical conditions in Saint-Brieuc? Or Wout van Aert’s potentially career-ending barrier clipping incident in 2019? The organisers are running no risks now and the entire prologue takes place on e-racing platform Zwift.</p>\n<p>Feeling a little off the pace? Use that power-up! Disadvantaged due to your team’s technically-lagging equipment supplier? Bag a Tron bike and put the power down! Fancy slipping in behind that virtual press motorbike and gaining a cheeky draft? Hit that button and feel the pull!</p>\n<p>Indeed, the trial run of the concept in 2039 was so successful that all of the Tour’s TTs are now raced virtually on turbo trainers. Fans find the experience far more exciting than watching an actual time-trial on the road, and prefer the chiselled avatars of their handsome heroes to the blemished and sweaty real thing. And who can blame them?</p>\n<p><strong>HOVER HOTEL</strong></p>\n<p>The nightly lottery of sub-standard accommodation as the race enters France is a thing of the past. Campaniles and HotelF1s on nondescript trading estates the length and breadth of the country have been superseded by a luxuriously-equipped 500 room hovering hotel that accompanies the race from town to town. </p>\n<p>The solar-powered designer mega-blimp, named the <strong>TVC15</strong>, makes lugging suitcases, mattress toppers and pillows around for three weeks a redundant concept. Indeed, the other main task of the soigneur – the rider’s evening massage – has also been replaced by vibrating beds that manipulate aching muscles and adjust spine alignment via voice-activated instructions from the athletes. Each rider, breaking with almost 140 years of tradition, now has their own room – loosely modelled on the love hotels of Tokyo, with ‘sensurround’ <strong>sound and vision</strong> making for a complete sensual experience, albeit without the sex bit. </p>\n<p><strong>MEMORY OF A FREE FESTIVAL</strong></p>\n<p>The publicity caravan that first trundled along as an appetite-whetter back in 1930 remains the precursor to the main event that half of the roadside spectators still actually prefer to watching the bike racing. </p>\n<p>There have been changes in recent years, of course, following the plastics ban of 2027 and passing of the Thunberg Statute the following year, which finally put paid to fossil fuel motor vehicles. Bizarre electric floats, designed to resemble anything from French cheese triangles to sausages, pass by with their nubile passengers gyrating mindlessly to dreadful Europop, much as they ever did, but with one telling difference from years gone by – no free gifts are thrown from the passing caravan for the adults to scrimmage over with kids.</p>\n<p>Instead, spectators aim their phone devices at product holograms beamed above the vehicles. One in ten lucky punters will receive an avatar of the ‘freebie’. Amass the full set from all 40 advertisers and your name goes in the virtual hat to win a virtual trip to a virtual time-trial being held virtually on stage 20 in Vittel. Gotta catch ‘em all, though…</p>\n<p><strong><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/TV_Metrics_screen_illustration_CMYK_1024x1024.jpg?v=1610113683\" alt=\"Tour de France 2040\"></strong></p>\n<p><strong>HELLO SPACEBOY AND CHINA GIRL </strong></p>\n<p>The British-registered squad that started life as Team Sky in 2010 before switching to Team Ineos nine years later, maintains its stranglehold over this race, with eight out of the last ten GC winners. Following several changes of increasingly unpopular sponsors, Virgin Galactic is now the name on the jerseys. The company’s space trips for losers with too much money to burn prove – despite the 2040s zeitgeist of planet-saving responsibility – to be strangely popular with a tiny section of the population intent on discovering once and for all whether there is <strong>life on Mars</strong>. Sir Richard Branson is long gone at the company, replaced by Xi Mingze, daughter of former Chinese president Xi Jinping. </p>\n<p>On the flipside, despite a winless streak stretching back to a stage taken by Sylvain Chavanel in 2008, Cofidis still finance the forlorn and aimless outfit despite overwhelming evidence to the contrary. And ASO continue to include Cofidis in their wildcard picks. Because France.</p>\n<p>But they are not the longest-serving top flight team at this Tour. That honour remains with Eusebio Unzué’s Spanish squad launched in 1980 as Reynolds and home to a myriad of champion cyclists ever since. Sadly, their three-pronged leader approach has failed to land a Tour win since their <strong>star man</strong> Enric Mas in 2023, and the 85-year-old boss Unzué remains stubbornly at the helm of his rudderless ship.</p>\n<p><strong>SUFFRAGETTE CITY</strong></p>\n<p>Ever since first introducing La Course back in 2014, ASO has struggled to come to grips with the notion of a fitting equivalent for women of Le Tour. One stage, then two, they even stretched to three in the mid-‘30s, but despite repeated requests from the female peloton, they are not given a sufficiently lengthy race to show their worth. By 2040 ASO has reverted to a single token criterium in Paris.</p>\n<p>But with just <strong>five years</strong> remaining before French women celebrate the centenary of their right to vote, fans and riders alike take matters into their own hands with widespread protests throughout the three weeks all over France, culminating in a sit-down strike replacing the intended race on the Champs-Élysées. Emeline Crepe, double world champion and leader of the <strong>FAME</strong> union (Females After More Exercise) leads the way, strongly backed by the <strong>young Americans</strong>, who burn a stack of Michelins on the Place de la Concorde. The organisation finally relents and the <strong>golden years</strong> of 1980s women’s stage racing will return with a two-week Tour in 2041<strong>. Let’s dance!</strong></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/people-will-say-whens-the-mens-issue-then-orla-chennaoui-on-editing-rouleur-s-women-s-issue\">Orla Chennaoui on the upcoming women's issue of Rouleur</a></p>\n<p><strong>LOVING THE ALIEN</strong></p>\n<p>Iconic team manager Marc Madiot is retired, but not forgotten: the long-running Groupama-FDJ team are spearheaded by a hologram version, who bellows every instruction <strong>under pressure</strong> via their virtual display sunglasses – enough to make their eyes bleed. At random, he will holler catchphrases such as “Allez mon petit”, “Tu vas aller gagner!” or sing La Marseillaise at 100 decibels whilst running <strong>up the hill backwards</strong>. Mon Dieu!</p>\n<p><strong>GENE GENIE</strong></p>\n<p>Cheating was de rigueur from the very start of the Tour de France. In 1904, taking the train from<strong> station to station</strong> was considered preferable to riding the obscenely long stages. Unlikely-sounding ways to dull the considerable pain, including nitroglycerin and strychnine, soon found favour amongst the ‘convicts of the road’. Uppers, downers, red wine – Tour riders ingested anything they could lay their hands on, culminating in testosterone, blood doping and EPO becoming the fashion towards the end of the scandalous 20th century. </p>\n<p>But this was child’s play compared to what followed. Socks laced with performance-enhancing drugs were discovered and banned. Frames, now constructed from hemp following the worldwide carbon shortage, were found to be filled with helium – the ultimate climber’s bike. </p>\n<p>Rumours of gene doping were finally confirmed following the positive test and retroactive striking from the record books of 2027 Tour ‘winner’ Alexi Smirnoff – known as <strong>The Man Who Sold the World</strong>s following allegations of a €500,000 payment to secure victory at the 2026 championships in Switzerland. Despite expressing his <strong>sorrow</strong> for bringing the sport into disrepute, Smirnoff received a lifetime ban from all sport and was sentenced to 12 months hard labour on the airship Sarkozy.</p>\n<p>But arguably the biggest scandal of all involved identical twins the <strong>Bewlay Brothers</strong> in 2034. With only Simon entered for the Tour, it took until stage 20, when both Simon and Adam accidently entered the press conference at the same time via opposing doors, that the penny dropped: they had been taking it in turns to race. Immediately disqualifying the offending Bewlay boy, race director Christian Prudhomme described the miscreants as “a couple of <strong>kooks</strong>” and “<strong>absolute beginners</strong>”. </p>\n<p><strong>MODERN LOVE</strong></p>\n<p>By 2040, the public’s had quite enough of experts, especially commissaires and their arbitrary rulings. Cameras capture every incident, during and after the race. Two riders headbutting at a finish? One star verbally slagging off another in the heat of the moment? The public decides by voting on social media whether they <strong>stay</strong> or go, or what the fine should be. </p>\n<p>Unfortunately, the system is somewhat flawed and nationalistic grudges hold sway over impartial justice. Much like the Eurovision Song Contest, remarkably still in existence despite more than 80 years of dire music, British riders receive regular time penalties while the Scandinavian nations vote en masse to clear any accusations of wrongdoing so that their <strong>boys keep swinging</strong>.  </p>\n<p><strong>I CAN’T GIVE EVERYTHING AWAY</strong></p>\n<p>Compulsory chips in the back of the neck for all EU citizens (including the UK, which was re-admitted to the Union in 2023) allow the Tour to charge all roadside spectators. Anyone detected within half a kilometre of the passing race is deducted €20. </p>\n<p>Despite the protests of bike racing refusenik homeowners whose dwellings lie within the charge zone – and human rights campaigners – this innovation creates a new business model for cycling following decades of financial instability. Even Jonathan Vaughters agrees, a remarkable development. </p>\n<p><strong>WHERE ARE WE NOW?</strong></p>\n<p>The press corps works remotely, drastically reducing the Tour’s carbon footprint. And avoiding any tricky questions at the same time… Friendly ‘journalists’ are invited to pose questions during post-race interviews, while the awkward brigade are quietly ignored. </p>\n<p>Casper Cavendish, curly-headed offspring of legendary sprinter Mark, proves to be a chip off the old block, taking three stages in his debut at the age of 22. He is already being widely tipped to challenge Mathieu van der Poel’s Tour stage win record of 36 victories.</p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/wout-van-aert\">Wout van Aert: Comeback Kid</a></p>\n<p>The Tour theme by Kraftwerk receives a remix and re-release in honour of band co-founder Florian Schneider, who died 20 years ago. The new version, Tour de France (<strong>V-2 Schneider</strong>), is downloaded 14 million times but the writer’s relatives receive no royalties as nobody pays for music anymore.</p>\n<p>The 2040 race is won by Kofi Tadesse from Ethiopia, Virgin Galactic’s record signing, at the tender age of 21. Another <strong>black star</strong> in the making.  </p>\n<p>The Tour de France goes from strength to strength. The public’s <strong>fascination</strong> with this great race continues unabated. Here’s to 2041. </p>\n<p><i>Ian was suffering lockdown fever during the writing of this feature, so crammed 33 David Bowie song titles into the feature. Have you got them all? Originally published in issue 20.4 of </i><a href=\"https://www.rouleur.cc/pages/subscribe\" style=\"font-style: italic;\">Rouleur magazine</a></p>\n<p> </p>\n<p><br><br><br><br><br><br><br><br><br></p>\n<p> </p>\n<p><br><br><br><br><br><br><br><br><br><br><br><br></p>\n<p> </p>\n    ","author":"Miles Baker-Clarke","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"2ba7c3eeb0e34d75984062a680f93d63a9259fd4311e6490c003e1604a629ad4","category":"Cycling"}