{"title":"★ I Suppose a Roman à Clef About a Design-Obsessed California Computer Maker With a Charismatic but Mercurial Founder Whose Youthful Arrogance Leads to His Ignominious Ouster and Exile, Only to Return a Decade Later to Not Only Save the Company From Seemingly Certain Ruin but Lead Them to Theretofore Unimaginable Triumph and Renown, Is Off the Table Too","link":"https://daringfireball.net/2020/12/roman_a_clef_computer_maker","date":1608074088000,"content":"\n<p>Ben Smith has been doing crackerjack work writing the Media Equation column for The New York Times all year long, but his piece this weekend was pure mainline DF catnip. Headline: “<a href=\"https://www.nytimes.com/2020/12/13/business/media/apple-gawker-tim-cook.html\">Apple TV Was Making a Show About Gawker. Then Tim Cook Found Out.</a>”</p>\n\n<blockquote>\n  <p>The show was called “Scraper,” but it was clearly about Gawker\nMedia, the network of aggressive, transgressive blogs that created\nmischief and headaches for America’s powerful until its targets\nsued the company into oblivion in 2016.</p>\n\n<p>Two Gawker veterans sold the idea to Apple TV+, the new streaming\nservice: Cord Jefferson, who left the site for a career writing\nfor TV, and Max Read, Gawker’s former editor in chief. Apple hired\ntwo more former Gawker editors, Emma Carmichael and Leah Beckmann,\nas writers, and they had completed several episodes, people close\nto the production said.</p>\n\n<p>Then, an Apple executive got an email from the company’s chief\nexecutive, Tim Cook.</p>\n\n<p>Mr. Cook, according to two people briefed on the email, was\nsurprised to learn that his company was making a show about\nGawker, which had humiliated the company at various times and\nfamously outed him, back in 2008, as gay. He expressed a\ndistinctly negative view toward Gawker, the people said. Apple\nproceeded to kill the project. And now, the show is back on the\nmarket and the executive who brought it in, Layne Eskridge, has\nleft the company. Gawker, it seems, is making trouble again.</p>\n</blockquote>\n\n<p>The main thrust of the column is that Cook personally put the kibosh on this show, but it never explains the <em>why</em>. It’s hinted at — that Cook harbors a grievance toward Gawker, for their having outed him and/or for <a href=\"https://daringfireball.net/2010/04/gizmodo_prototype_iphone\">the Gizmodo stolen iPhone 4 prototype kerfuffle</a>, and these ill feelings led Cook to (spitefully? unclear…) cancel Apple’s production of the show — but that’s not really an explanation. There’s an implied <em>dot-dot-dot</em> in the middle of this narrative that demands elucidation. There are essential blanks that are not filled in.</p>\n\n<p>First, it is essential to keep in mind that the show wasn’t to be a documentary or true-life story about the actual Gawker. It’s clearly described as a fictional show about a Gawker-esque media company. Like the way <em>The Morning Show</em> is about a <em>Today Show</em>-like show, or <em>Succession</em> is about a Machiavellian media baron and his family <em>like</em> the Murdochs and News Corp. A <a href=\"https://www.merriam-webster.com/dictionary/roman%20a%20clef\"><em>roman à clef</em></a>. So even if we accept it as fact that Tim Cook’s “distinctly negative view toward Gawker” is an understatement, that Cook in fact <em>loathes</em> Gawker, that alone doesn’t explain why he’d nix a show about a Gawker-like media company.</p>\n\n<p>Consider the most famous and renowned <em>roman à clef</em> ever put to film: Orson Welles’s <em>Citizen Kane</em>. Charles Foster Kane was a thinly veiled take on William Randolph Hearst. <em>Citizen Kane</em> wasn’t made by people who liked Hearst, or who were even merely ambivalent toward him. It was a scathing portrait made by men who held Hearst in utter contempt, particularly screenwriter Herman Mankiewicz. By sheer coincidence, Mankiewicz’s writing of the <em>Citizen Kane</em> screenplay is the subject of David Fincher’s beautiful and astonishingly good <em><a href=\"https://www.netflix.com/title/81117189\">Mank</a></em>,<sup id=\"fnr1-2020-12-15\"><a href=\"#fn1-2020-12-15\">1</a></sup> which just debuted on Netflix. <em>Mank</em> is a remarkably timely reminder that a fictional series about a Gawker-like site wouldn’t necessarily imply a favorable take on Gawker-style journal<em>ism</em> or journal<em>ists</em>, and in fact might be just the opposite. <em>Mad Men</em> does not leave you thinking that the 1960s ad industry was a healthy place or a good culture, and <em>The Sopranos</em> is not exactly a ringing endorsement of New Jersey trash disposal companies.</p>\n\n<p>Given that <em>Scraper</em> was created and being written by former Gawker editors and writers, it’s entirely possible that the gist of the show was, well, a largely favorable take, portraying the staff at “Scraper” as, say, righteous journalistic crusaders speaking truth to power, and <em>that’s</em> what Cook objected to. But perhaps the show was unflattering, giving Nick Denton the Kane/Hearst treatment, and Cook nixed it anyway, lest Apple look petty — which, if that’s the case, would be reasonable and not the least bit spiteful. Or maybe Cook just didn’t want Apple involved with former Gawker staffers, at a personal level, regardless of the slant or artistic quality of the show — which would be <em>completely</em> spiteful. My point here isn’t to dispute the basic reporting that Cook nixed the show, but to observe that what Smith reported is really just the setup, not the complete story, and the rest of the story would be interesting to know — both to satisfy our (or at least my) gossipy curiosity, and as insight into Tim Cook’s largely opaque mindset. He’s a hard man to read.</p>\n\n<p>Assuming the show is good, it should land somewhere else for development into an actual series, and we shall see. Although we’ll never know if the <em>Scraper</em> that lands at Hulu or Amazon Prime <s>or Quibi</s> or wherever will represent what the <em>Scraper</em> at Apple TV+ would have been. But the show should land somewhere, unless it’s just a bad show, in which case the whole “Tim Cook nixed it out of spite” angle falls apart. Smith’s “<em>look at how much power Tim Cook has</em>” take would hold a bit more water if he alleged that Cook buried the series — keeping ownership of the rights but refusing to produce it — rather than releasing it for another streaming service to pick up.</p>\n\n<p><a href=\"https://www.cnbc.com/video/2020/12/14/apple-tv-pulls-plug-on-production-about-gawker.html\">As Kara Swisher observed regarding this story during an appearance yesterday on CNBC</a>, are we supposed to be surprised, in the least, that it turns out Tim Cook runs Apple and has the final call over everything the company does?</p>\n\n<hr />\n\n<p>Anyway, Smith’s focus on the Gawker/Scraper story buried the lede on two much more interesting nuggets regarding the rules of Apple TV+ content:</p>\n\n<blockquote>\n  <p>So far, Apple TV+ is the only streaming studio to bluntly explain\nits corporate red lines to creators — though Disney, with its\ngiant theme park business in China, shares Apple’s allergy to\nantagonizing China’s leader, Xi Jinping.</p>\n\n<p>Eddy Cue, Apple’s senior vice president for internet software and\nservices, who has been at the company since 1989, has told\npartners that “the two things we will never do are hard-core\nnudity and China,” one creative figure who has worked with Apple\ntold me. (<a href=\"https://www.buzzfeednews.com/article/alexkantrowitz/apple-china-tv-protesters-hong-kong-tim-cook\">BuzzFeed News first reported last year</a> that Mr.\nCue had instructed creators to “avoid portraying China in a poor\nlight.”)</p>\n</blockquote>\n\n<p>This isn’t gossipy — or the least bit surprising — but unlike the Gawker show getting nixed, this “don’t offend China” rule ought to be genuinely scandalous. Ben Thompson beat me to the punch on <a href=\"https://twitter.com/ditheringfm/status/1338502329297825794\">yesterday’s edition of Dithering</a>, observing that a rule like this about Russia during the Cold War would have blocked the entire James Bond franchise from existing, not to mention just about any lesser spy movies from the era. Or what of Stanley Kubrick’s <em>Dr. Strangelove</em>? Like the Soviet Union in the decades after WWII, China is not some obscure small player on the world stage, and they systematically do things that <em>deserve</em> to be portrayed “in a poor light”. To take China off the table is to take much of what’s going on geopolitically in the world today off the table.</p>\n\n<p>I get it, of course. I don’t agree with it, artistically or ethically, but I get it: money talks, and China is where Apple assembles most of its products and a big market where it sells them, too. But just because it’s so transparently obvious <em>why</em> Apple would forbid any negative portrayals of China doesn’t make it any less outrageous.</p>\n\n<p>Even worse, Apple and Disney aren’t outliers in this complicity. Apple (with its supply chain reliance and desire to sell iPhones to the massive Chinese market) and Disney (with its theme parks) might have particularly unique reasons not to offend Chinese officials with their media productions, but all major Hollywood studios are reliant now on the Chinese box office — more so now than ever, with Chinese theaters open for business and U.S. theaters shuttered for untold months, maybe another year or longer, to come. Apple can refuse to make a show about Gawker and someone else will pick it up. But what major entertainment company <em>is</em> willing to portray China “in a negative light”?<sup id=\"fnr2-2020-12-15\"><a href=\"#fn2-2020-12-15\">2</a></sup> China has effectively foot-stomped and bribed its way into not being shown in movies for what it clearly is: a powerful, cruel, brutal Communist regime led by a thin-skinned dictator who does in fact quite resemble Winnie the Pooh. Which studios or streaming services would bankroll today’s equivalent of <a href=\"https://www.vanityfair.com/hollywood/2019/10/satirzing-hitler-charlie-chaplin-great-dictator\">Charlie Chaplin’s classic <em>The Great Dictator</em></a>, with Xi Jinping in Hitler’s place as the deserving target of satiric mockery? Netflix — <a href=\"https://www.cnbc.com/2019/05/10/netflix-has-a-china-strategy-it-doesnt-involve-launching-there-soon.html\">which doesn’t offer its service in China</a> and has no dependence on theatrical box office revenue — <em>maybe</em>?</p>\n\n<p>And then there’s this, which is neither scandalous nor gossipy, but just plain goofy:</p>\n\n<blockquote>\n  <p>And then, there are the phones: A person involved in another\nrecent Apple show recalled instructions to avoid a scene in which\na phone would be damaged.</p>\n</blockquote>\n\n<p>A “no showing phones getting damaged” rule, if true,<sup id=\"fnr3-2020-12-15\"><a href=\"#fn3-2020-12-15\">3</a></sup> makes Apple look as much in need of a pair of big boy pants as the leaders of China.</p>\n\n<div class=\"footnotes\">\n<hr />\n<ol>\n\n<li id=\"fn1-2020-12-15\">\n<p>And ambitious! I mean, my god, imagine having the stones not just to make a movie about <em>Citizen Kane</em>, but to set out to make a <em>Citizen Kane</em>-like movie about <em>Citizen Kane</em>. That’s bold. And Fincher pulls it off with aplomb.&nbsp;<a href=\"#fnr1-2020-12-15\"  class=\"footnoteBackLink\"  title=\"Jump back to footnote 1 in the text.\">&#x21A9;&#xFE0E;</a></p>\n</li>\n\n<li id=\"fn2-2020-12-15\">\n<p>That goes for any sort of big-ticket entertainment. Consider the <a href=\"https://www.vox.com/2019/10/7/20902700/daryl-morey-tweet-china-nba-hong-kong\">painfully awkward aftermath across the entire NBA</a> last year after then-Houston Rockets GM Daryl Morey tweeted, “Fight for freedom, stand with Hong Kong” — a sentiment that ought not be considered the least bit controversial anywhere but in China. (Morey is no longer with the cowardly Rockets, and is now the president of the soon-to-be-NBA-champion Philadelphia 76ers.)&nbsp;<a href=\"#fnr2-2020-12-15\"  class=\"footnoteBackLink\"  title=\"Jump back to footnote 2 in the text.\">&#x21A9;&#xFE0E;︎</a></p>\n</li>\n\n<li id=\"fn3-2020-12-15\">\n<p>Writer-director (and <a href=\"https://daringfireball.net/thetalkshow/2012/10/26/ep-021\">delightful podcast guest</a>) Rian Johnson told Vanity Fair last year, <a href=\"https://www.vanityfair.com/video/watch/notes-on-a-scene-director-rian-johnson-breaks-down-a-scene-from-knives-out\">while breaking down a scene from his excellent mystery <em>Knives Out</em></a>, that <a href=\"https://arstechnica.com/tech-policy/2020/02/apple-wont-let-filmmakers-put-iphones-in-villains-hands-rian-johnson-says/\">Apple won’t authorize iPhones to be used by the villains</a> in any movie in which they’re providing “promotional consideration”. Which, in addition to being a spoiler clue in any movie with a secret bad guy (or an apparent bad guy who’s secretly a good guy), is just an insanely overprotective-of-brand-image mindset.&nbsp;<a href=\"#fnr3-2020-12-15\"  class=\"footnoteBackLink\"  title=\"Jump back to footnote 3 in the text.\">&#x21A9;&#xFE0E;︎</a></p>\n</li>\n\n</ol>\n</div>\n\n\n\n    ","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"2cb49e511c3bd9162d84e9292f5c3900a0e0032cbb3f22a6ac614e22858fe888","category":"Tech"}