{"title":"Rain","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/rain","date":1610115508000,"content":"\n      <p>A heavy dread. It starts the moment you wake.</p>\n<p>It’s like an unpleasant taste lingering in your mouth, a bad dream, something unresolved that still festers in your mind and it has captured your mood.</p>\n<p>You would think that German must have a useful compound noun to describe the specificity of the emotion. ‘Regenangst’, perhaps: the fear of rain. It looms over you like the dark, low clouds outside. It’s akin to the feeling you have when you wake with the knowledge that you have done something wrong for which you will have to atone.</p>\n<div class=\"klaviyo-form-Ymj3Vm\"></div>\n<p>Even if you didn’t know the forecast, something outside your curtained window tells you. The faint swish of the traffic on the road, the cool humidity and the low light. Or perhaps it’s just something cyclists feel in their bones, or in their water: today, I will get wet. </p>\n<p>It’s the anticipation that’s worst. As you eventually drag yourself out of bed, you force yourself into that counter-dialogue: it’s just rain, you say, it’s only water. Once you’re wet, you’re wet. How terrible can it be? It’s never as bad once you get going. A big part of you just doesn’t want to do it, but, even so, you tell yourself these comforting little lies, because without them you couldn’t do it.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Screen_Shot_2021-01-07_at_12.02.20_1024x1024.png?v=1610020976\" alt=\"Marco Pantani\"></p>\n<p>Mentally, it’s a lot easier not to turn up than it is to pack during the race. “DNS” is a private shame: there could be plenty of perfectly good and honourable reasons for not riding. Only you would know that it was just because you didn’t fancy riding in the rain, and the relief at not doing so goes a long way to compensate for your disappointment with yourself. “DNF” is a more public humiliation: you showed up and started, but you just couldn’t hack it.</p>\n<p>The atmosphere at the race HQ is different when it’s raining. Subdued. Anxious. Resigned. Voices are lower, faces grimmer, and there is little of the banter you’d normally expect. Joshing and laughter have a jarringly false note of bravado, as if framed by the question hanging in the cool, damp air: don’t you realise it’s raining? Mostly, people are preoccupied with preparations: rummaging in kitbags for different socks and overshoes, rolling on arm-warmers and knee-warmers, pulling on full-finger gloves and rain cape, adjusting the strapson their helmet to take a cap underneath. Then rubbing in the embrocation, so that the pungent odour of menthol hangs in the air. The smell of the liniment alone is enough tostart the butterflies in your stomach.</p>\n<p>But why fear the rain? Is it not only water, after all?</p>\n<p>To the racing cyclist, there is plenty to fear. Water turns tarmac into a black mirror. It hides the tricks of its true surface beneath a dark, opaque sheen. The road becomes treacherous in the rain. It’s not only that it becomes slippery, but ruts and potholes can disappear completely beneath standing water. Drain covers and diesel spills become lethaltraps, ready to send half a dozen riders sprawling and spreadeagled across the road in the blink of an eye. Crashes become less an occupational hazard, more a racing certainty.Everyone has less grip; no one’s brakes work as well.</p>\n<p>The normal margins for error are washed away. If someone goes down in front of you, the chances of stopping in time or flicking the bike round the debris are drastically reduced. The trust you place in other riders is suddenly worth nothing: the rain makes a mockery of even the best bike-handling skills. Whether you stay upright or spill is simply a lottery. In the rain, any imperfection in the road surface – bitumen bonding strips, even white lines – might as well be a patch of black ice. This is what you know as you line up at the start, shivering slightly with the chill and the stern anticipation. You hear<span>  </span>short, sharp hisses as riders elect to let some air out of their tyres: maximum pressures are for dry roads; softer tyres give you just a fraction more grip on wet tarmac. That, at any rate, is the hope.</p>\n<p><a href=\"https://www.rouleur.cc/blogs/desire-journal/the-best-winter-cycling-jackets\">The best winter cycling jackets </a></p>\n<p>Even in summer, the temperature drops when it rains. So you wear more clothes – the full wardrobe of gilets and gloves. Still, with their low body fat, cyclists suffer in the rain. Once you are wet through, the breathable, wicking fabrics you wear simply help the windchill suck the living warmth from your body. There are days when you have to attack and get off the front, just because you need to keep your heart rate at a minimum of 90 per cent simply to stay warm. Sitting in the bunch means going slowly hypothermic on your bike.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/OFS_TDF2013-Stage19_43_1024x1024.jpg?v=1610021035\" alt=\"Tour de France 2013\"></p>\n<p>When it really rains, it’s not the water falling from the sky that matters, although you feel it hit your shoulders, spreading the grip of its cold fingers down your flanks as the dampness seeps behind your outstretched arms. But it’s not the rain from above that really makes you wet. Most of the water that slaps your face and front comes off the road.</p>\n<p>Your own rear wheel becomes a fountain, sending a steady stream up in a full arc behind you, creating a sopping stripe up your back, grey with road grime. It hits the seatpost, splashing the backs of your<span>  </span>thighs. Your front wheel, too, spews a jet of water that hits the downtube and shoots sideways, soaking your feet with every turn of the pedals. Overshoes seep cold shocks of fluid and, before long, your toes are in standing water. Your wet feet can even take on a comfortable warmness, like a wetsuit, as the efficient heat-exchanging mechanism of your toes acclimatises to its moist new environment, until cornering through a puddle sends a new icy jet through the mesh of your shoes.</p>\n<p>More water comes not off your own bike, but off the bikes in front. If you are lucky enough to be watching the bunch riding through a rainstorm from the warm, dry cocoon of a following car, you see a dense mist hovering above and enveloping the bunch. That is the spray off wheels, a haze of water flicked up from the road by the scores of tyres.</p>\n<p>In normal circumstances, those wheels are your friend, providing shelter, hiding you from the wind, lending you the help of an invisible hand by the drafting effect. In rain, that is reversed:the wheel you follow is no longer your friend. To sit on the wheel in front is to place yourself directly in line with the cold jet of water being fired, backwards and up, with the force of a power- shower. The only way you could simulate the experience of riding in the bunch in the rain would be by riding a turbo trainer while someone sprayed you with a garden hose.</p>\n<p> <img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/OFS_TDF2014_Stage15_10_1024x1024.jpg?v=1610021110\" alt=\"Jack Bauer\"></p>\n<p>You grimace involuntarily as your eyes fill with grit and your vision becomes blurred. Just to see anything, you have to develop an echelon-style technique of riding where you still take some wind shelter from the wheel in front, but avoid being directly behind it, which always increases the risk of overlapping and a touch of wheels. It’s not so much to keep yourself dry – you’re soon so wet, you forget that. It is just so that you have some vision, rather than blinking and squinting sideways through a hail of water.</p>\n<p>In these circumstances, there is no cycling apparel yet devised that will keep you dry. Even an impermeable rain cape lets in water at the neck, capillary action carries it up from the cuffs, and at race pace your body generates so much condensation underneath that the distinction between the cold clamminess within and without eventually becomes meaningless.</p>\n<p>Wearing glasses is of dubious benefit. It saves your eyes being blasted, like an old building under renovation, with a mix of water and sand, but it is like driving in a car whose windscreen wipers are broken: you peer out through lenses streaked and misted.</p>\n<p>Contact lens wearers have little choice but to stick with some form of eyewear, but of those with a choice most abandon the habit: at best, you end up feeling oddly sealed in behind your limited vision, somehow cut off from what is happening around you; at worst, it makes you a liability. Remember Alex Zülle? A rider obliged to wear glasses, and never the happiest bike-handler, he rarely seemed to spend a whole day upright if it rained.</p>\n<p>Riding in the rain is such purgatory that the only thing to do is attack. Being off the front hurts, but at least the pain is self- inflicted. It’s yours, you own it, and that beats the misery of sitting in the bunch getting progressively wetter and colder. You notice the spray less off the few wheels of an échappée. You stay warmer because you are working. And it’s saferbecause you have <span>a clear sight of the road ahead and fewer riders around you who might make a mistake.</span></p>\n<p>The only cure for rain dread is to finish feeling you have accomplished something epic, not only to win a place but to feel that you have faced a threat to your very survival and overcome it. The conditions were hard, but you were harder. </p>\n<p>In the rain, the group psychology of the peloton is such that breaks are more likely to work and stay away. Along with the pervasive dampness, a sense of defeat creeps ineluctably into the minds of the chasers. The hazardous conditions make it harder to organise behind; people start to look out for themselves only, rather than contribute to a collective effort. Unless it’s a stage race, more riders than usual will abandon. The attrition rate is high, with the lure of a warm, dry changing room almost irresistible for riders who have missed the move and are just getting colder and colder with each passing mile.</p>\n<p> <img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/OFS_TDF2014_Stage5_52_1024x1024.jpg?v=1610021189\" alt=\"Peter Sagan\"></p>\n<p>To sit in the bunch is to feel your muscles slowly harden and grow rigid with cold. Nothing works properly: all the moving parts – thighs, knees, ankles, feet – feel disconnected from one another, only half-functioning and without the usual fluid rhythm and motion. You keep pedalling on brute strength and will alone, but the will is sucked out of you like the heat from your limbs. It is as though you have drunk hemlock and a cold numbness gradually invades from each extremity towards the core, chilling the warm life-blood and killing all vitality. </p>\n<p>Nothing, in these circumstances, is easier to rationalise than packing: the race has gone, and I’m going backwards; it’s dangerous, and I will probably only make myself sick by carrying on. This is a not-so-feeble excuse if you are racing in an agricultural area where the rain may wash farming slurry across the road in a fine film of muck laced with E. coli. Stomach upsets are a lingering hazard, the sting in the tail of a day’s racing in the rain.</p>\n<p><em><strong><a href=\"https://www.rouleur.cc/blogs/desire-journal/castelli\">Related – How the Gabba saved Castelli</a></strong></em></p>\n<p>Even if you dodge that ill luck, what is inescapable is that your bike will be filthy, every surface spattered and streaked, the transmission clogged with lubricant congealed with dirt. So your bike needs cleaning – just when that is the very last thing you feel like doing. I’ve skipped racing the rain, sometimes, at least as much because of the prospect of having to wash my bike as that of riding in the wet. For pros, though, the rainy days must just be accepted as another day at the office. It must always feel like a Monday when it rains. And pity the team mechanic who will have half a dozen or more bikes to wash, wipe, dry and re-lubricate before the next day’s stage. Even tyres have to be checked, and changed if they’ve picked up cuts from the sharps washed across the road by the rain.</p>\n<p>The grit gets everywhere. Under the saddle, between the sprockets, inside the brake hoods. The greasy black run-off from the brake pads coats the forks and seat stays. Road grime stains the rider’s legs grey, and leaves a stripe up the back of his kit. When you shower after racing in the rain, you find sand in your hair, up your nose, in your ears – it is as though you have ridden through a wet sandstorm. After a bad day riding in the wet, you can shake a<span>  </span>fine shower of grit out of the back of your bib-shorts even after they’ve been through a wash cycle. </p>\n<p>Back in the changing room, the sopping lycra peels from goose-pimpled flesh as reluctantly as the skin of unripe fruit. You do not even realise how cold you are, your brain<span> </span>is<span> </span>working so slowly, but you find yourself astonished by how heavy everything is. It feels good to slough off those sodden layers: you feel warmer naked to the air than you did in your<span> </span>wet kit. You throw on all the dry clothing you have, fingers struggling with zips and buttons, and still you shiver. You sit in the car with the heat blasting, but it’s an hour before your body’s thermostat is reset and you begin to feel normal. </p>\n<p>Never again, you say to yourself, as the sensation slowly returns to fingers and toes. But you know this is just another of those comforting little lies. Never again... until the next time you find yourself thinking, it’s only rain. How bad can it be?</p>\n<p><em>Originally published in issue 6 of <a href=\"https://www.rouleur.cc/pages/subscribe\">Rouleur magazine</a> </em></p>\n<div class=\"klaviyo-form-UFKPji\"></div>\n    ","author":"Miles Baker-Clarke","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"35c90cd319fa6dc798d2081974cf5eac2def339c1366ab192bdd928dad65104f","category":"Cycling"}