{"title":"Why Parler Is Likely to Fold","link":"https://twitter.com/davetroy/status/1348219824506368000","date":1610394075000,"content":"\n<p>Good thread on Twitter by Dave Troy, on the troubles facing Parler if they try to rebound after being cut off by AWS. Technical hurdles, for sure — AWS is hard to replace, and most of the top alternatives, the ones that are closest to drop-in replacements, are unlikely to want Parler’s business — but perhaps the bigger problem is financial:</p>\n\n<blockquote>\n  <p>Should Matze/Wernick/Bongino/Peikoff decide to soldier on and go\nfull zombie mode, they can try to do that. They probably can’t do\nso without Mercer support. Or material help from foreign\nnationals. Any US person risks sedition charges. And indeed, so\ndo they.</p>\n\n<p>Given the near zero possibility of survival, I assess that all\ninvolved will likely terminate this kamikaze mission, take the\ndata they harvested, use it for future ops, share it with the\nRussian government in trade for something, and move on to a new\nventure.</p>\n</blockquote>\n\n<p>Sounds like they’ve <a href=\"https://gizmodo.com/every-deleted-parler-post-many-with-users-location-dat-1846032466\">inadvertently shared their entire data store with the world</a>, actually. This trove includes geolocation data for uploaded images and video (Parler apparently didn’t strip EXIF data), private DMs, <em>and</em> “deleted” posts that weren’t actually deleted from the database but just marked as “deleted”.</p>\n\n<p>Always seemed pretty obvious that the minds behind Parler weren’t exactly sharp knives, but it’s looking more and more like they’re on the plastic cutlery end of the spectrum.</p>\n\n<div>\n<a  title=\"Permanent link to ‘Why Parler Is Likely to Fold’\"  href=\"https://daringfireball.net/linked/2021/01/11/parler-dave-troy\">&nbsp;★&nbsp;</a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"3bb486a170869de2b1d33681401402679ba20adc5c09d645292bb0f0675502ae","category":"Tech"}