{"title":"Let’s Talk Security Tech About President Biden’s Peloton Bike","link":"https://www.dcrainmaker.com/2021/01/lets-talk-security-tech-about-president-bidens-peloton-bike.html","date":1611167024000,"content":"<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/01/DSC_2450.jpg\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"DSC_2450\" src=\"https://media.dcrainmaker.com/images/2021/01/DSC_2450_thumb.jpg\" alt=\"DSC_2450\" width=\"720\" height=\"480\" border=\"0\" /></a></p>\n<p>Over the last week there’s been a <a href=\"https://www.nytimes.com/2021/01/19/us/politics/biden-peloton.html\">surprising amount of concerned speculation</a> that President Biden would be unable to take his apparently beloved Peloton Bike to the White House, citing security concerns. The reason is that the Peloton Bikes contain not only a network connection, but also a camera and a microphone. The camera and microphone are intended to be able to do a workout with a friend, akin to Facetime or such, though in reality very few people tend to use them. There’s also Bluetooth and WiFi.</p>\n<p>Still – cameras and microphones, as well as both wired and wireless connections can indeed pose security concerns in any technology device, be it a bike or a phone. It’s why in most high-security environments, such devices are tightly controlled (if allowed at all). However, the amount of speculation that somehow this would stop the Biden’s from bringing their Peloton bike is silly.</p>\n<p>Here, let me explain.</p>\n<p><em>(Preemptive warning: Politically focused comments – on either side of the aisle – will be immediately deleted. There are plenty of other places in the world to drop those, I’m here for the tech – so let’s focus on that.)</em></p>\n<h3><span style=\"font-weight: bold;\">Peloton Bike Tech:</span></h3>\n<p><em><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/01/PelotonBikePlusScreenDisplay.jpg\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"PelotonBikePlusScreenDisplay\" src=\"https://media.dcrainmaker.com/images/2021/01/PelotonBikePlusScreenDisplay_thumb.jpg\" alt=\"PelotonBikePlusScreenDisplay\" width=\"720\" height=\"480\" border=\"0\" /></a></em></p>\n<p>Now the first thing to know about the Peloton Bike is that there are actually two main models of the Peloton Bike: The Bike, and <a href=\"https://www.dcrainmaker.com/2020/09/peloton-bike-plus-details-features.html/\">the newer Bike+</a>. They are similar in many ways, but also quite different. From an underlying bike frame standpoint (the big bulky metal part), they’re actually identical. However, the differences are in the screen, as well as on the Bike+ there is an electronic resistance unit. But that doesn’t matter in this conversation.</p>\n<p>The basic design of both bikes is that the screen up top is the <em>everything</em> from a smarts standpoint. It’s essentially a giant Android phone, using a large touchscreen instead. The unit runs Android (different versions depending on the bike), but the average consumer would never really notice that. However, that Android platform does make it far more appealing (and easy) for attackers <a href=\"https://www.dcrainmaker.com/2020/06/how-to-load-zwift-or-trainerroad-on-a-peloton-bike-a-geeks-guide.html\">(or hobbyists) to tweak with</a>.</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/01/PelotonBikeCamera.jpg\"><img style=\"margin: 0px; border: 0px currentcolor; display: inline; background-image: none;\" title=\"PelotonBikeCamera\" src=\"https://media.dcrainmaker.com/images/2021/01/PelotonBikeCamera_thumb.jpg\" alt=\"PelotonBikeCamera\" width=\"355\" height=\"238\" border=\"0\" /></a> <a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/01/DSC_2450-1.jpg\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"DSC_2450\" src=\"https://media.dcrainmaker.com/images/2021/01/DSC_2450_thumb-1.jpg\" alt=\"DSC_2450\" width=\"355\" height=\"237\" border=\"0\" /></a></p>\n<p>Both bikes have cameras in them at the top of the screen, however, the Peloton Bike+ also has a camera cover. This small piece of plastic allows you to cover the camera.</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/01/PelotonBikePlus-Webcam-PrivacyScreen.jpg\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"PelotonBikePlus-Webcam-PrivacyScreen\" src=\"https://media.dcrainmaker.com/images/2021/01/PelotonBikePlus-Webcam-PrivacyScreen_thumb.jpg\" alt=\"PelotonBikePlus-Webcam-PrivacyScreen\" width=\"714\" height=\"484\" border=\"0\" /></a></p>\n<p>Both bikes have mics in them, also at the top of the screen. In the case of the original Bike it’s actually visible just above the camera on the bezel of the screen. Whereas the Bike+ appears to have it behind the speaker fabric.</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/01/PelotonBikePort.jpg\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"PelotonBikePort\" src=\"https://media.dcrainmaker.com/images/2021/01/PelotonBikePort_thumb.jpg\" alt=\"PelotonBikePort\" width=\"720\" height=\"482\" border=\"0\" /></a></p>\n<p>Both Peloton Bikes have dedicated headphone jacks as well.</p>\n<p>When it comes to connectivity, both bikes have WiFi connectivity, though only the original Bike has wired ethernet built-in. Instead, the Bike+ would require someone purchase a USB-C to Ethernet dongle in order for wired connectivity. There’s also Bluetooth audio devices (and heart rate sensor pairing). If looking at the device holistically from a security standpoint, it’s likely they would aim to physically disable the Bluetooth connectivity as well, as that could be paired to nearby Bluetooth audio devices otherwise.</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/01/vlcsnap-2021-01-20-19h19m13s495.png\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"vlcsnap-2021-01-20-19h19m13s495\" src=\"https://media.dcrainmaker.com/images/2021/01/vlcsnap-2021-01-20-19h19m13s495_thumb.png\" alt=\"vlcsnap-2021-01-20-19h19m13s495\" width=\"720\" height=\"405\" border=\"0\" /></a></p>\n<p>Neither the camera nor microphone are required for day to day usage, however network connectivity is. Without network connectivity you can’t load the classes to take (or take live ones), nor can you see any of your training data over time. You can however use the bike without connectivity in a base mode without classes (basically just as a simple spin bike).</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2020/09/image-24.png\"><img title=\"image\" src=\"https://media.dcrainmaker.com/images/2020/09/image_thumb-24.png\" alt=\"image\" width=\"720\" height=\"224\" border=\"0\" /></a></p>\n<p>Now while all of these things are considered security risks, they’re hardly without precedent in the White House. In fact ultimately, the Peloton bike as noted earlier is just a giant Android phone. But various US government agencies literally have divisions that are focused on taking apart devices and making them more hardened. But one has to first decide what type of ‘space’ they’re going into. For example, while there are many portions of the White House that are considered a sensitive compartmented information facility (SCIF) where classified information can be discussed – there are plenty of portions that are not. It’s in these portions that most day to day work happens, and where staffers carry both government-issued and personal devices (the exact policies on this have varied from administration to administration, and even within an administration).</p>\n<p>Sure, one should always be careful with any device and discussing both official and classified information. But iPhone, Android phones, smart watches and such are the norm these days. And for classified information that’d be discussed in a classified ‘facility’ (the term facility here is more of a construct than a specific building – in some locations the facility can be the entire building, and in others just a single tiny room).</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/01/PelotonBikePlusFrame.jpg\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"PelotonBikePlusFrame\" src=\"https://media.dcrainmaker.com/images/2021/01/PelotonBikePlusFrame_thumb.jpg\" alt=\"PelotonBikePlusFrame\" width=\"720\" height=\"480\" border=\"0\" /></a></p>\n<p>Still, governments around the world have a long history of securing devices, both in unclass (unclassified) and high side (classified) areas. For high-security situations, they’ll dismantle them, understand how they work, remove risky components, and put them back together again. This is hardly news. One only needs to look at the current PDB (Presidential Daily Brief) <a href=\"https://breakingdefense.com/2014/04/inside-the-presidents-daily-briefing-dni-moves-with-care-to-tablets/\">being delivered on an iPad to see that</a>, as a <a href=\"https://breakingdefense.com/2012/07/president-obama-wants-smartphones-tablets-to-improve-intel-moni/\">public example</a>.</p>\n<p>While it&#8217;s rumored that former First Lady Michelle Obama has, or had, a Peloton Bike delivered without a camera/mic, that would do little to assuage security divisions about putting any connected device within the White House residence. If the location of the device warranted, those same divisions would still take apart the device and do their normal security work. The removal of a camera/mic by Peloton would merely save government teams time in making the device work properly after disabling those components (as it would usually fail various internal checks).</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/01/DSC_2454.jpg\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"DSC_2454\" src=\"https://media.dcrainmaker.com/images/2021/01/DSC_2454_thumb.jpg\" alt=\"DSC_2454\" width=\"720\" height=\"480\" border=\"0\" /></a></p>\n<p>No matter which flavor of bike shows up, White House staffers <a href=\"https://en.wikipedia.org/wiki/Executive_Office_of_the_President_of_the_United_States\">within EOP</a> would then work to follow standard security guidelines (so-called STIG’s) <a href=\"https://nvd.nist.gov/ncp/repository\">published by NIST for Android devices</a>, then in conjunction with other intelligence agencies they’d complete a more detailed assessment of the risks of that specific Peloton model to decide where it might be placed, and what hardening steps may or may not be taken. Given how many government officials (such as embassy staff and past executive officials) have Peloton bikes, this has undoubtedly been done many times before and well documented.</p>\n<p>Finally, while my Peloton Bike is currently sitting in our bedroom – a place where, in a White House setting, classified information would undoubtedly be discussed as any president mulls through tough decisions, there’s zero need for the bike to sit there in the White House. After all, the White House is a vast building including a gym, bowling alley, and theater. A Peloton Bike could easily be placed in the White House gym or another secured room that is only used for working out. You can see some images of the long <a href=\"https://www.businessinsider.nl/white-house-facts-rooms-2018-2?international=true&amp;r=US\">lineup of fitness machines in some White House gym photos here</a>.</p>\n<p>Thus ultimately, the task of securing electronic/connected devices to work in the White House is something that is a well-understood path that’s been done countless times before on far more technically challenging devices. And more importantly, it’s something done on a continual basis for far more mundane devices. Sticking a connected bike in a storage room somewhere is pretty low on the complexity factor for those divisions.</p>\n<p>Thus, I’ve got no doubts that both the President and First Lady will continue using their bike, whichever model it is, for some time to come.</p>\n<p>With that – thanks for reading!</p>\n<p><em>(And again – preemptive warning: Politically focused comments – on either side of the aisle – will be immediately deleted. There are plenty of other places in the world to drop those, I’m here for the tech – so let’s focus on that.)</em></p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"3d71257358a07c521486d415e66d4535eb327e6ba3a4dee65320c343b6d61dd6","category":"Cycling"}