{"title":"The history of the connected battlespace, part one: Command, control, and conquer","link":"https://arstechnica.com/?p=1737057","date":1611583235000,"content":"<div id=\"rss-wrap\">\n<figure class=\"intro-image intro-left\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/01/wargames-li-800x433.jpg\" alt='Believe it or not, this fictional version of NORAD shows off the idea of the \"connected battlespace\" even better than the real thing.'><p class=\"caption\" style=\"font-size:0.8em\"><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/01/wargames-li.jpg\" class=\"enlarge-link\" data-height=\"2080\" data-width=\"3840\">Enlarge</a> <span class=\"sep\">/</span> Believe it or not, this fictional version of NORAD shows off the idea of the \"connected battlespace\" even better than the real thing. (credit: MGM/UA)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Since the earliest days of warfare, commanders of forces in the field have sought greater awareness and control of what is now commonly referred to as the \"battlespace\"—a fancy word for all of the elements and conditions that shape and contribute to a conflict with an adversary, and all of the types of military power that can be brought to bear to achieve their objectives.</p>\n<p>The clearer a picture military decision-makers have of the entire battlespace, the more well-informed their tactical and strategic decisions should be. Bringing computers into the mix in the 20th century meant a whole new set of challenges and opportunities, too. The ability of computers to sort through enormous piles of data to identify trends that aren't obvious to people (something often referred to as \"<a href=\"https://arstechnica.com/information-technology/2015/02/the-big-deal-about-big-data-your-guide-to-what-the-heck-it-actually-means/\">big data</a>\") didn't just open up new ways for commanders to get a view of the \"big picture\"—it let commanders see that picture closer and closer to real-time, too.</p>\n<p>And time, as it turns out, is key. The problem that digital battlespace integration is intended to solve is reducing the time it takes commanders to close the \"OODA loop,\" a concept developed by US Air Force strategist Colonel John Boyd. OODA stands for \"observe, orient, decide, act\"—the decision loop made repeatedly in responding to unfolding events in a tactical environment (or just about anywhere else). OODA is largely an Air Force thing, but all the different branches of the military have similar concepts; the Army has long referred to the similar <a href=\"https://defense-and-freedom.blogspot.com/2013/05/lawson-command-control-cycle.html\">Lawson Command and Control Loop</a> in its own literature.</p></div><p><a href=\"https://arstechnica.com/?p=1737057#p3\">Read 33 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1737057&comments=1\">Comments</a></p>","author":"Sean Gallagher","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"41d34e8fa449672b79b50e96d7f8f044e3d56e05aba06eafb7f8455364de783b","category":"Tech"}