{"title":"Spotify Tests Audiobooks Market With Collection of Literary Classics","link":"https://www.macrumors.com/2021/01/26/spotify-tests-audiobooks-market/","date":1611653442000,"content":"Spotify has started releasing audiobook recordings on its streaming platform, indicating the company's intention to further broaden its library of non-music content (via <a href=\"https://www.hollywoodreporter.com/news/spotify-tests-audiobooks-with-frankenstein-jane-eyre-and-other-literary-classics-exclusive\"><em>The Hollywood Reporter</em></a>).\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/01/spotify-audiobooks-collection.jpg\" alt=\"\" width=\"800\" height=\"584\" class=\"aligncenter size-full wp-image-780207\" />\r\n<br/>\r\nThe collection of nine audiobooks are in the public domain, but are original recordings that are exclusive to Spotify. The titles include Mary Shelley's <em>Frankenstein</em>, narrated by David Dobrik, <em>Narrative of the Life of Frederick Douglass, an American Slave</em>, read by Forest Whitaker, and Kate Chopin's <em>The Awakening</em>, read by Hilary Swank, amongst other classics. From the report:\r\n<br/>\r\n<blockquote>The other titles that Spotify is releasing as part of the collection are Jean Toomer's Cane, narrated by Audra McDonald; Charles Dickens' Great Expectations, narrated by James Langton; Charlotte Bronte's Jane Eyre, narrated by Sarah Coombs; Nella Larsen's Passing, narrated by Bahni Turpin; and Stephen Crane's Red Badge of Courage, narrated by Santino Fontana.\r\n<br/>\r\n\r\n<br/>\r\nTo accompany the audiobooks, Spotify has commissioned series Sitting with the Classics on Spotify, in which Harvard professor Glenda Carpio offers a deep-dive on each book, exploring the history and breaking down the narratives and themes for a modern audience.</blockquote>The classic audiobooks will be available for free globally but promoted only to English-speaking markets including the United States, the United Kingdom, Canada, Australia and Germany.\r\n<br/>\r\n\r\n<br/>\r\nSpotify says the collection is a test to see if the audiobooks gain traction on its streaming service, but if it takes off like podcasts have done on the platform, the company's dive into audiobooks could see it take on rivals like Amazon's Audible and Apple Books in a market that was valued at nearly &#36;2.7 billion in 2019, according to a report from Grand View Research.\r\n<br/>\r\n\r\n<br/>\r\nOver the past few years Spotify has spent &#36;800 million buying podcasting companies like <a href=\"https://www.macrumors.com/2019/02/06/spotify-reaches-96m/\">Gimlet Media</a> and The Ringer, as well as <a href=\"https://www.macrumors.com/2020/05/20/spotify-signs-up-the-joe-rogan-experience-podcast/\">acquiring the rights</a> to popular podcasts like <em>The Joe Rogan Experience</em>. According to today's report, Spotify now has 1.9 million podcasts on its platform and says 22 percent of its 320 million monthly active users engaged with that content during the third quarter of 2020.<div class=\"linkback\">Tags: <a href=\"https://www.macrumors.com/guide/spotify/\">Spotify</a>, <a href=\"https://www.macrumors.com/guide/audiobooks/\">Audiobooks</a></div><br/>This article, &quot;<a href=\"https://www.macrumors.com/2021/01/26/spotify-tests-audiobooks-market/\">Spotify Tests Audiobooks Market With Collection of Literary Classics</a>&quot; first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br/><br/><a href=\"https://forums.macrumors.com/threads/spotify-tests-audiobooks-market-with-collection-of-literary-classics.2281889/\">Discuss this article</a> in our forums<br/><br/><div class=\"feedflare\">\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=PYvppAtbico:FiYcBoiEjUw:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" border=\"0\"></img></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=PYvppAtbico:FiYcBoiEjUw:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" border=\"0\"></img></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/PYvppAtbico\" height=\"1\" width=\"1\" alt=\"\"/>","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"4f06c074c4651ffd568387cd0d108a2553b330d0905b4870233c30584063cb27","category":"Apple"}