{"title":"Designing An Attractive And Usable Data Importer For Your App","link":"https://smashingmagazine.com/2020/12/designing-attractive-usable-data-importer-app/","date":1606901400000,"content":"<p>If you’ve ever tried to import data into an app before, you know, as a user, how varied the experience can be. In some cases, the user is overwhelmed with instructions on how to use the importer. In others, there’s no direction at all. And while that might look nicer than an importer overrun with directions and links to documentation on how to use it, a completely useless UI will also cause users frustration once the inevitable errors start getting thrown.</p>\n<p>So, when you’re designing an app or software that needs a data importer, how do you ensure this doesn’t happen to <em>your</em> end users? Do you try to custom build or find a Goldilocks solution that strikes the right balance between minimal and informative? And what should that even look like?</p>\n<p>Today, I want to look at four ways to ensure that the user interface design of your data importer doesn’t get in the way of a positive user experience. </p>\n<p><strong>Quick note before I start:</strong> I’ll be using live data importer examples to demonstrate how to design this on your own. However, if you’d rather just use a ready-made data importer, but don’t have time to review the existing options against these good design practices, <a href=\"https://www.flatfile.io/product/concierge/?utm_source=partner&amp;utm_medium=content&amp;utm_campaign=smashing-magazine-content_q4-2020-second-article-designing-an-importer&amp;utm_content=external-link&amp;utm_term=smashing-magazine-designing-an-importer\">Flatfile Concierge</a> is what you’re looking for. I’ll show some examples of it as we go along and tell you a bit more about it at the end of this post. </p>\n<h3>UI Design Tips For Your Software’s Data Importer</h3>\n<p>There are many <a href=\"https://www.smashingmagazine.com/2020/10/overcome-data-onboarding-challenges-software-products/\">challenges in data onboarding</a> for apps and software. But if you can get the UI right — in other words, provide your end users with an attractive and usable importer — you can effectively minimize those challenges. </p>\n<p>Here’s what your data importer should look like if you want to make that a reality for your users: </p>\n<h4>1. Format The Instructions For Readability</h4>\n<p>It doesn’t matter how straightforward the data import process is. You can never assume that your end users will automatically know how to format their file(s), which file types are allowed and what sort of file size limitations there may be. </p>\n<p>So, the main importer page must have instructions for them. Just be careful about going overboard. </p>\n<p>If you leave them with a wall of text explaining what the importer is for, they’ll get annoyed with the redundant information holding them up from getting started. And if you spell out each possible step in minute detail, their eyes are going to glaze over. Worst-case scenario, they’ll start the experience feeling as though they’re being talked down to. None of these outcomes is ideal.</p>\n<p>To find the sweet spot, aim for the following: </p>\n<p><strong>Simplify the instructions into 100 words or less.</strong> </p>\n<p><a href=\"https://www.paypal.com/\">PayPal</a>’s invoice importer is a good example of this:</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/48ba42c5-cfb2-44c3-abe6-f075917b0c1b/paypal-data-importer-batch-invoices.png\" /></p>\n<p>There’s a single paragraph on this page that tells users that files need to: </p>\n<ul>\n<li>Be in CSV format;</li>\n<li>Include fields for the email address, item name, and invoice amount;</li>\n<li>Include no more than 1000 invoices.</li>\n</ul>\n<p>For anyone that misses the bit about the file format, they’ll get a reminder of it in the upload field. </p>\n<p>The rest of the information (the link to the file template and FAQs on how to batch invoice) is linked out to other pages, which keeps this importer page nice and short.</p>\n<p>When possible, I’d recommend <strong>formatting the instructions using paragraphs, bulletpoints, bolded headers or white space</strong>. This would be similar to how you’d structure text for readability on a web or app page.  </p>\n<p><a href=\"https://quickbooks.intuit.com/self-employed/\">QuickBooks Self-Employed</a> shows us how this might work: </p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/24157329-0504-4c14-ac70-384d18afc71f/quickbooks-data-importer-instructions.png\" /></p>\n<p>There are three steps presented and each is kept short and to the point. By adding extra space between and around them, reading the export/import instructions will seem less daunting. </p>\n<p>One last thing you can do is to <strong>make the “Import” button stand out</strong> so that users that use the importer more than once can quickly skip past the instructions on subsequent uses.</p>\n<p>Here’s how this might look if you use Flatfile as your data importer: </p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/9a175a50-6898-4f64-88dc-d72e5fecbe88/flatfile-data-importer.png\" /></p>\n<p>The button stands out clear as day on this page. And for those who have used this importer before, they won’t need to read through the instructions on the right for a reminder of what kinds of file types are allowed. There’s a note right beneath the button that clarifies this.</p>\n<p>What’s more, the button is in the top-left corner, which is where most users’ eyes initially focus on a new page. So, the strong color of the button coupled with the priority placement will help users quickly get the import process started.</p>\n<h4>2. Show Them All The Import Options That Are Available</h4>\n<p>Consumers often expect companies to provide them with options. This is something we’ve seen a lot lately in e-commerce, with shoppers wanting various purchase options available (e.g. pick up in-store, curbside pickup, two-day delivery, etc.) </p>\n<p>If it makes sense to do so for your app, consider giving your users the same kind of flexibility and control over how they import their data. And when you do, design each option so that it’s clear — just by looking at it — what action comes next. </p>\n<p>For instance, this is the expense and income importer for <a href=\"https://and.co/\">AND.CO</a>: </p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/d3b5aae8-d9ce-46f5-8a0f-cfeee5081594/andco-data-importer-drag-and-drop.png\" /></p>\n<p>The <strong>block with the dashed border</strong> tells users that they have at least one option: Drag-and-drop their CSV file into the widget to upload. While an importer design like this doesn’t always allow for click-to-upload, this one does (per the instructions).</p>\n<p>Flatfile uses a similar design at the top of the import page: </p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/b007618f-8cef-4aad-bf47-aa08731f281c/flatfile-upload-data-from-file-box.png\" /></p>\n<p>The difference between these two examples is that Flatfile includes <strong>an upload button</strong> inside the dashed-border box so that it’s clear that both import options are available. </p>\n<p>There’s also a third option beneath this block: </p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/3493237c-c173-4419-b5a8-340f43474091/flatfile-manual-data-entry.png\" /></p>\n<p>It’s a good idea to include <strong>a manual import option</strong> if your end users will return to the importer to add small handfuls of data and don’t want to prepare a file every time.</p>\n<p>One last way to present import options is through the use of <strong>third-party software logos</strong> as <a href=\"https://asana.com/\">Asana</a> does: </p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/38d99f86-ee7d-45dd-b6b3-54d3bea32078/asana-source-of-import.png\" /></p>\n<p>The standard CSV file import option is available at the top of the page. Beneath that, though, are apps that their users are most likely to have stored their project data in.</p>\n<p>As you can see, the visual presentation of the import options is just as important as the instructions provided. So, rather than try to get creative here, just use a tried-and-true design that your end users will be familiar with and will help them instantly identify the import option they prefer.</p>\n<h4>3. Make Complex Imports Look Easy</h4>\n<p>At this stage of the data import process, things can get a little hairy. Even if you have a flawless import process on the backend, the way it’s presented to your end users can be a problem if the complexities of the process start to show through.</p>\n<p>There are two things you can do with the UI to keep that from happening. This point will cover what you can do if the import process itself is complex. </p>\n<p><a href=\"https://www.hubspot.com/\">HubSpot</a> is a robust marketing and sales software, so it’s no surprise the data import process would take a while. Regardless, it starts simply enough, asking users if they’re going to import their data or pull it in from another platform: </p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/26f1ba83-84ad-47e9-802d-ed534b2dc37a/hubspot-data-importer.png\" /></p>\n<p>Now, this design goes against what I just talked about in the last point about designing the first page. However, there’s a reason why this was a good choice. </p>\n<p>Let’s say this HubSpot user decides to import their data from a CSV file. They’d select “Import” and then go to this page: </p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/f4a52a9c-c14b-4937-9f21-7c019ad96e4e/hubspot-imported-data-type.png\" /></p>\n<p>If HubSpot used the typical import page design, this page would require users to pause and then get acquainted with the new interface before moving on. </p>\n<p><strong>So, this is something to consider if you have a complex data onboarding process that needs to be broken up into multiple steps before the actual import begins.</strong></p>\n<p>Assuming the user just wants to import a CSV, XLS or XLSX, they’ll find themselves here next:</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/c8c2bca2-5be5-4c37-83ba-8e1d6773fdd4/hubspot-number-of-files-for-import.png\" /></p>\n<p>What’s nice about this approach is that it prevents users from having to go through the importer once for every file they have to upload. If there’s related data, they can select ‘Multiple files with associations’ and the importer will help them make those connections:  </p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/0231c83c-53cb-408a-b297-5358bf377338/hubspot-data-objects.png\" /></p>\n<p>This way, it’s not the users’ responsibility to merge the data in their files. Nor do they have to spend hours going through their imported records to merge related records. This importer helps them do it. </p>\n<p>The next screen is similar to the “How many files are you importing?” screen. This one appears, however, when the user selects “One file”:</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/c8ac253f-9e69-4b78-922f-c73735b14a13/hubspot-number-of-objects-to-import.png\" /></p>\n<p>This again is aimed at keeping users from importing data and then spending excessive amounts of time cleaning it up. </p>\n<p>Next, we have the part of the process where the user finally sees the importer. While it’s not exactly like the designs we looked at before, it’s still intuitive enough where users will know how to upload their files into it:</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/eca71f78-a5ac-4679-af30-9107cac832ea/hubspot-file-upload.png\" /></p>\n<p>While I realize this is a lot of steps to get to a page that other software would show first, think about how much quicker these users are able to get inside HubSpot and to start working.</p>\n<p>If you have a complex upload process (i.e. multiple files, object associations, etc.), consider using a similar design with each question on its own page as well as consistently presented options.</p>\n<h4>4. Use Color To Make Data Cleanup Speedy</h4>\n<p>The other way to simplify an otherwise complex import process is applicable to all data importers. In particular, this tip pertains to the final steps in the data onboarding process: </p>\n<ul>\n<li>Data validation</li>\n<li>Data sanitization</li>\n</ul>\n<p>Now, having a data importer that can actually do some of this work is going to be a huge help. However, it’s ultimately up to your end users to review what they’ve imported and to approve it before they allow it inside the software. </p>\n<p>To help them not be so overwhelmed by all the data and everything they need to address, use color to guide them through it. </p>\n<p>For this example, we’re going to look at <a href=\"https://clickup.com/\">ClickUp</a>. And if it looks familiar to you, that’s because it should. It was built using Flatfile’s data importer. </p>\n<p>Let’s start with the first part of the data validation process:</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/cd2866eb-f129-4ae1-9693-24eab92d58cf/clickup-green-yes-button.png\" /></p>\n<p>This page is straightforward enough. It shows the user a snippet from their imported data and asks them if the row pointed to contains column names. </p>\n<p>But look at the <strong>green “Yes” button</strong>. While this is a design tactic we use for web and app interfaces (i.e. make the desired call-to-action a positive and eye-catching color), there’s another reason this is here. </p>\n<p>Assuming the column names are there and ClickUp can easily interpret the data, this is what the user sees next:</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/8eb3d891-72b0-4b62-a0d7-85bebd8ae412/clickup-import-confirm-mapping.png\" /></p>\n<p>This is the data importer’s attempt at making light work of data validation. On the left are all the identified columns from the file. </p>\n<p>On the right is information about how the columns were matched to ClickUp’s fields. There are also three possible data validation options: </p>\n<ol>\n<li><strong>Confirm mapping (in green)</strong>; </li>\n<li>Ignore this column (in a grey ghost button);</li>\n<li>Include as a custom field (in another ghost button).</li>\n</ol>\n<p>The green button here matches what we saw on the last screen. So, users have already been conditioned to view this green button as an affirmative, which will help them quickly go through all the results and confirm the fields that were correctly matched. </p>\n<p>Green and grey aren’t the only colors that should appear in your data importer. </p>\n<p>If errors should arise (which isn’t a bad thing), your users should have a chance to fix them before the data gets uploaded. Depending on where in the app the errors appear, you might want to design them differently. </p>\n<p>For instance, ClickUp uses an <strong>orange warning symbol</strong> to call out issues with values during validation:</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/d3370c09-1ddc-4ae2-82c2-9ae9adcdfeeb/clickup-icons-for-errors.png\" /></p>\n<p>This allows ClickUp to tell users, “Yes, the column names match, but your values don’t line up with what we use.” </p>\n<p>ClickUp then uses a <strong>red highlighter</strong> during data sanitization to point out errors with fields: </p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/c42f4359-e0ac-4514-b6dc-d27bcaf6705c/clickup-rows-with-errors-in-red.png\" /></p>\n<p>This is the final step before upload, so this is ClickUp’s last attempt at getting its users to perfect their data import. In this case, ClickUp highlights a field in red if it’s marked as required but contains no data. </p>\n<p>The color alone should call attention to the fields. However, what if the user had imported a file with hundreds or thousands of rows and doesn’t see the red at first glance? Giving them a way to zero in on these red lines would be super valuable. </p>\n<p>And ClickUp’s “Only show rows with problems” toggle does this:</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/8424817d-216c-4a85-80bf-8903c5826b49/clickup-only-show-rows-with-problems.png\" /></p>\n<p>Let’s face it: Unless your data importer tells your users when and where there’s a problem with their data, they’re probably not going to give it a second glance. That is, not until they’re in the software and wondering why their records are all messed up. </p>\n<p>Of course, they’ll blame it on the importer and the software; not on their own negligence. So, providing these colorful markers throughout the process will be a huge help. </p>\n<h3>Wrapping Up</h3>\n<p>As I mentioned before, if you’re not confident that you can pull off the tricky balancing act between building a friction- and error-free data importer while designing it to be attractive, intuitive and helpful, then why bother? </p>\n<p>As we’ve already seen, <a href=\"https://www.flatfile.io/product/concierge/?utm_source=partner&amp;utm_medium=content&amp;utm_campaign=smashing-magazine-content_q4-2020-second-article-designing-an-importer&amp;utm_content=external-link&amp;utm_term=smashing-magazine-designing-an-importer\">Flatfile Concierge</a> is a ready-made data importer solution that’s not only built to handle a wide range of data import scenarios, but it looks great, too. By letting it power your data import process, you can devote more time to building products and your clients can dedicate more time to providing their users with better customer service and support.</p>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"ab069ca35bf300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"52887b226e6e11e1fb5e9710184e701223472c8f19127e56200c18a6dec5acf2","category":"Tech"}