{"title":"The Deplorables","link":"https://www.pewresearch.org/politics/2021/01/15/biden-begins-presidency-with-positive-ratings-trump-departs-with-lowest-ever-job-mark/","date":1610748069000,"content":"\n<p>Pew Research:</p>\n\n<blockquote>\n  <p>As Joe Biden prepares to take office just days after a deadly riot\ninside the U.S. Capitol, 64% of voters express a positive opinion\nof his conduct since he won the November election. Majorities also\napprove of Biden’s Cabinet selections and how he has explained his\nplans and policies for the future.</p>\n\n<p>Donald Trump is leaving the White House with the lowest job\napproval of his presidency (29%) and increasingly negative ratings\nfor his post-election conduct. The share of voters who rate\nTrump’s conduct since the election as only fair or poor has risen\nfrom 68% in November to 76%, with virtually all of the increase\ncoming in his “poor” ratings (62% now, 54% then).</p>\n\n<p>Trump voters, in particular, have grown more critical of their\ncandidate’s post-election conduct. The share of his supporters who\ndescribe his conduct as poor has doubled over the past two months,\nfrom 10% to 20%.</p>\n</blockquote>\n\n<p><a href=\"https://time.com/4486502/hillary-clinton-basket-of-deplorables-transcript/\">Hillary Clinton in September 2016</a>:</p>\n\n<blockquote>\n  <p>“You know, to just be grossly generalistic, you could put half of\nTrump’s supporters into what I call the basket of deplorables.\nRight?” Clinton said. “The racist, sexist, homophobic, xenophobic,\nIslamaphobic — you name it. And unfortunately there are people\nlike that. And he has lifted them up.”</p>\n\n<p>She said the other half of Trump’s supporters “feel that the\ngovernment has let them down” and are “desperate for change.”</p>\n</blockquote>\n\n<div>\n<a  title=\"Permanent link to ‘The Deplorables’\"  href=\"https://daringfireball.net/linked/2021/01/15/the-deplorables\">&nbsp;★&nbsp;</a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"55ee259bedd3227c8c4d1fd8e453c79c20096bbdb789646d43c9591f8bf8a609","category":"Tech"}