{"title":"Apple's New 'Time to Walk' Feature Launches Today for Fitness+ Subscribers","link":"https://www.macrumors.com/2021/01/25/apple-fitness-time-to-walk-launches-today/","date":1611585042000,"content":"Apple today <a href=\"https://www.apple.com/newsroom/2021/01/time-to-walk-an-inspiring-audio-walking-experience-comes-to-apple-fitness-plus/\">officially introduced Time to Walk</a>, a new feature for Apple Fitness+ subscribers with audio stories from influential people that Apple Watch users can listen to with AirPods or other wireless headphones while walking.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/01/apple_time-to-walk_apple-watch-airpods_01252021_inline.jpg.large_.jpg\" alt=\"\" width=\"653\" height=\"705\" class=\"aligncenter size-full wp-image-780094\" />\r\n<br/>\r\nTime to Walk episodes will be automatically downloaded to the Apple Watch with a Fitness+ subscription, and users can start an episode directly from the Workout app. New episodes ranging from 25 to 40 minutes in length will appear in the Workout app from a different guest each Monday through the end of April, according to Apple.\r\n<br/>\r\n\r\n<br/>\r\nApple says each episode will be shaped by the guest's \"personal, life-shaping moments\" and include \"lessons learned, meaningful memories, thoughts on purpose and gratitude, moments of levity, and other thought-provoking topics.\" Each episode will be complemented by photos that appear on the Apple Watch, and end with a short playlist of songs selected by the guest that users can listen to as they complete their Walk workout. \r\n<br/>\r\n\r\n<br/>\r\nTime to Walk launches today with four episodes from the following guests:<blockquote>- <strong>Country music star Dolly Parton</strong> has won nine GRAMMYs and is also a celebrated actor, businessperson, and humanitarian. Dolly reflects on her career, family, and growing up in rural Tennessee. \"I've loved walking ever since I was a little girl in the Smoky Mountains,\" Parton says. \"I think it's so important to be able to get out and walk if we can during this time. I do my best thinking when I walk. And while many of us feel confined during this time, I'm hopeful that people will take a walk down memory lane with me and we can all feel a little more freedom taking the time to walk together.\"\r\n<br/>\r\n\r\n<br/>\r\n- <strong>NBA player Draymond Green</strong> won three basketball championships with the Golden State Warriors, helping to change how the game is played. He reflects on the virtues of failure and tuning out criticism. \"There's nothing better than a walk in nature, getting lost in my thoughts, and taking a deep breath of fresh air,\" Green says. \"Take all the stresses of your day and let them blow away with the wind. I hope sharing my stories with those who go on a walk with me will give them the same drive to chase their dreams that I had in chasing mine.\"\r\n<br/>\r\n\r\n<br/>\r\n- <strong>Musician Shawn Mendes</strong> went viral on social media at 15, had his first platinum album by 19, and has toured the world. He shares how a slower pace has helped him personally and creatively. \"Taking a walk is a great way to clear your mind,\" Mendes says. \"It's the most simple thing you can do to calm the body and soul, reflect, and slow down. I hope people get to feel the same sense of calm I do while walking and can bring that to their own experiences.\"\r\n<br/>\r\n\r\n<br/>\r\n- <strong>Emmy Award winner Uzo Aduba</strong> found stardom on the series, \"Orange Is the New Black,\" but only after many rejections. She talks about lifelong relationships and keeping the faith. \"I love walking either by myself or with my dog,\" Aduba says. \"It's a time to connect and have the conversations with myself that can often get overlooked throughout the day, and bring peace of mind. The experience of walking and telling my stories gave me that familiar feeling that walking brings, answering questions that need to be answered, and addressing topics that need to be addressed. I'm so excited to share that with those who take the time to walk with me.\"</blockquote>An equivalent Time to Push feature will be available for wheelchair users.\r\n<br/>\r\n\r\n<br/>\r\nApple Fitness+ launched last month, providing subscribers with access to a library of workout videos, with new content added on a weekly basis. Fitness+ integrates personal metrics such as heart rate from the Apple Watch to motivate users, animating them on the screen during key moments in the workout. Time to Walk will be unique given that the workouts can be completed outdoors without needing to watch a screen.\r\n<br/>\r\n\r\n<br/>\r\nApple Fitness+ is currently available in the United States, Canada, Australia, New Zealand, Ireland, and the United Kingdom. After a one-month trial, the service is priced at &#36;9.99 per month or &#36;79.99 per year in the United States.<div class=\"linkback\">Related Roundup: <a href=\"https://www.macrumors.com/roundup/apple-watch/\">Apple Watch Series 6</a></div><div class=\"linkback\">Tag: <a href=\"https://www.macrumors.com/guide/apple-fitness-plus/\">Apple Fitness Plus</a></div><div class=\"linkback\">Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#Apple_Watch\">Apple Watch (Neutral)</a></div><br/>This article, &quot;<a href=\"https://www.macrumors.com/2021/01/25/apple-fitness-time-to-walk-launches-today/\">Apple&#039;s New &#039;Time to Walk&#039; Feature Launches Today for Fitness+ Subscribers</a>&quot; first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br/><br/><a href=\"https://forums.macrumors.com/threads/apples-new-time-to-walk-feature-launches-today-for-fitness-subscribers.2281793/\">Discuss this article</a> in our forums<br/><br/><div class=\"feedflare\">\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=gPjXSTVFeTU:OfrW4p4UgWE:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" border=\"0\"></img></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=gPjXSTVFeTU:OfrW4p4UgWE:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" border=\"0\"></img></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/gPjXSTVFeTU\" height=\"1\" width=\"1\" alt=\"\"/>","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"663bece2d6b1fffe2ab19677466aae7ca9cfd798fd994b553a54fab8459342a7","category":"Apple"}