{"title":"The lady in yellow who rides at the front of the Tour de France","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/the-lady-in-yellow-who-rides-at-the-front-of-the-tour-de-france-1","date":1610553048000,"content":"\n      <p><span style=\"font-weight: 400;\"><strong>“Listen this is my CV and a covering letter, I’ve been wanting to work on the Tour de France for the last five years, but to work on the Tour de France you need to know people and I don’t, so I’m counting on you,” Claire Pedrono said to Christian Prudhomme when she finally managed to track him down at a cycling conference in 2010, held in her locale of Vannes, Brittany.</strong></span></p>\n<div class=\"klaviyo-form-Ymj3Vm\"></div>\n<p>In life there are dreamers and then there are doers. It’s not to say the doers don’t dream too, they just add a few more layers onto the dreams and get stuff done. Pedrono is definitely a doer.</p>\n<p><span style=\"font-weight: 400;\">The director of the Tour de France smiled and replied: “Go and see my assistant, Laurent Bezault, who is here and pass it onto him and tell him what you want to do”.</span></p>\n<p><span style=\"font-weight: 400;\">“No, he already has his letter, this one I want to give to you,” she replied.</span> </p>\n<p><span style=\"font-weight: 400;\">One of the layers that doers add to dreams is persistence, this indefatigable energy to not give up. Prudhomme obviously saw it that day in Pedrono, along with flattery that someone can hold that much passion towards his event. It’s what people like him yearn for in potential employees.</span> </p>\n<p><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-2021\">Related – The Tour de France 2021: Everything you need to know<br></a><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/wout-van-aert\">Related – Wout van Aert: Comeback Kid</a></strong></em></p>\n<p><span style=\"font-weight: 400;\">As a result of her tenacity, Prudhomme invited Pedrono to a cocktail party which was attended by Bezault and a handful of ex-pros such as Pascal Lino. “I couldn’t believe where I was and I was explaining to people why I was there, but I didn’t feel like I was at my proper place,” Pedrono explains. “Christian introduced me to all the former pros telling them that I was really motivated to work at the Tour. I said to them: ‘well I’m very motivated but unfortunately that’s not enough to get a place on the Tour’”.</span></p>\n<p><span style=\"font-weight: 400;\">A few weeks passed by and there was still no word. Having tried every entry route possible from marketing on the caravan to going straight to the top of the ASO pyramid, even the doer’s dreams can start to wilt.</span></p>\n<p><span style=\"font-weight: 400;\">“Then a month later I received a phone call from Laurent Bezault. He said: ‘We’ve thought about you for the role of blackboard girl. We want to test you out at the Tour de Picardie.’”</span></p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Claire_Pedrono_Blackboard_girl_TdF2018_001_1024x1024.jpg?v=1610552697\" alt=\"\"></p>\n<p><span style=\"font-weight: 400;\">There’s that saying that you wait ages for a bus, then all of a sudden three come at once. “At the same time, just before doing my test at the Tour de Picardie, I received a mail offering me a job at the Tour de France as a hostess. </span></p>\n<p>\"I was a bit annoyed because in my head I now wanted the blackboard girl job but I didn’t know if the test was going to work out. I wanted to keep that second option open,” Pedrono explains. “So I called Laurent and said to him: ‘Listen I’m going to do the interview for the hostess job on the Tour but I just wanted to make sure you are aware that my dream is to be the blackboard girl.’” </p>\n<p><span style=\"font-weight: 400;\">Shuttling between breakaway and peloton, chasers and stragglers, the job of the 'ardoisière’ is to relay time gaps on a blackboard to riders in the race. Had she ever ridden pillion on a motorbike before?</span></p>\n<p><span style=\"font-weight: 400;\">“No, never! I had never been on one, so before the Tour de Picardie I went to Rennes to do a test on my own to ride behind a pilot, just to see what it felt like. Laurent told me at the time that if the test went well I would be the first woman to do this role so I shouldn't talk about it too much.</span> </p>\n<p><span style=\"font-weight: 400;\">“So when I went to the garage to do the test on the motorbike I lied and said I was a former cyclist and I just wanted to understand what it’s like to be on a motorbike, not getting into the details of the job,” Pedrono giggles as she recalls the absurdity of it. She admits that during her first time in Rennes riding pillinger on the bike, she was discreetly holding her arms out as if presenting a blackboard to see if she could keep her balance.</span></p>\n<p><span style=\"font-weight: 400;\"><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Claire_Pedrono_Blackboard_girl_TdF2018_004_1024x1024.jpg?v=1610552679\" alt=\"\"></span></p>\n<p><span style=\"font-weight: 400;\">As the Tour de Picardie approached Pedrono looked for guidance and found it in a former blackboard guy, Joseph Lappartient, father of David. He helped guide her through the first part of her career. In the week leading up to Picardie, an accident left Pedrono worried about how she was going to fare: “I’d hit my arm in the car and had blocked the nerves in my whole arm leaving me in quite a lot of pain.</span> </p>\n<p><span style=\"font-weight: 400;\">“After three days of Picardie I was absolutely exhausted, from the injury, from the stress of trying to be really good, based on the fact it was a test for the Tour de France. I felt so much pressure.</span> </p>\n<p><span style=\"font-weight: 400;\">\"But on the Sunday night of the final day of Picardie Laurent Bezault told me: 'you’ll be with us in July',” Pedrono recalls. “I was happy but what I was really thinking was: 'Wow, I’m exhausted after three days in Picardie, what’s it going to be like after three weeks on the Tour de France!’”</span></p>\n<p><span style=\"font-weight: 400;\">Pedrono has now spent eight years fulfilling that dream of working on the Tour. What have been the best bits of living within the peloton?</span> </p>\n<p><span style=\"font-weight: 400;\">“I enjoy when the breakaway starts to take shape because that’s when my work starts. I really enjoy hearing the riders in the breakaway or in the peloton setting up strategies. I can hear them talking to each other about their tactics, it’s exciting to watch what happens next,” Pedrono enthuses.</span></p>\n<p><span style=\"font-weight: 400;\">Being in the thick of it is thrilling but also tiring. If you ask anyone who works on the Tour de France to describe what it’s like, fatigue is a word that will crop up time and again, due to the transient way of living over three weeks. Add to that the task of maintaining a high level of focus, trying to feed yourself and grab nature breaks when the race allows.</span></p>\n<p><span style=\"font-weight: 400;\">“If I have done a Tour and not managed to eat a lot then I know it’s been an exciting Tour,” she explains. “2013 was one of the best, the 100th edition, the geography, the crowds, it was incredible. I hardly ate that Tour.”  </span></p>\n<p><span style=\"font-weight: 400;\"><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Claire_Pedrono_Blackboard_girl_TdF2018_005_1024x1024.jpg?v=1610552889\" alt=\"\"></span></p>\n<p><span style=\"font-weight: 400;\">This year there’s been another dimension of difficulty added into Pedrono’s three week circumnavigation around France – leaving her eight month old son at home. Luckily this year the location of the first week of the Tour meant she was able to spend quite a few nights at home with her family. But as the Tour went on, the separation was starting to take its toll. “When I’m on the motorbike and I see children at the side of the road, it makes me think about him all the time.”</span></p>\n<p><span style=\"font-weight: 400;\">Balancing working on the Tour and family life can be hard, and Pedrono appreciates having a husband who understands her passion, using up most of her annual leave from her day job at a bank to work on the Tour each summer. Last year when pregnant, Pedrono had to skip the Tour but all she could think about was wanting to be there, riding along with the  peloton, which after eight years of doing the job is a whole other family to her.</span> </p>\n<p><span style=\"font-weight: 400;\">But it’s a family that Pedrono wants to share with her little boy.</span></p>\n<p><span style=\"font-weight: 400;\">“When I was pregnant with him I used to talk to him and say that one day I would take him to discover the Tour de France, allow him to develop a passion for something like no other he will experience,\" she says. \"I’m excited for him to meet the crazy world I chased to be a part of.” </span></p>\n<div class=\"klaviyo-form-UFKPji\"></div>\n    ","author":"Miles Baker-Clarke","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"699a66ebfd7e48262ffe65e0ad719bccb006e62c7acfc7bf226f54a2a3201ecb","category":"Cycling"}