{"title":"‘They Absolutely Do Not Believe Their Own Bullshit, but It’s Useful for Them to Pretend They Do.’","link":"https://twitter.com/lilithsaintcrow/status/1347293759155838976","date":1610337540000,"content":"\n<p>Wonderful thread on Twitter by Lili Saintcrow, on her dealings with an old racist neighbor:</p>\n\n<blockquote>\n  <p>One afternoon, Gene mentioned whatever the current outrage du jour\non Fox was. (This was well before Der Trumpenfuhrer’s reign, by\nthe way.)</p>\n\n<p>He fixed me with his baleful, watery stare, and said, “Obama was\nborn in Kenya, you know.” […]</p>\n\n<p>So I dead-eyed Gene and said, “You don’t really believe that. I\nknow you don’t.”</p>\n\n<p>I will never forget the look that crossed his face. Because it was\n<em>familiar</em>. It was the same shit-eating grin my racist stepfather\nused to wear when spouting Rush Limbaugh dittohead shit at the\ndinner table. It was the same wink-wink-nudge-nudge all the\nfucking white supremacists and Satanic Panic assholes give.</p>\n\n<p>Gene absolutely, positively did not believe that Obama was born in\nKenya. But he would continue to say he believed it, no matter who\nasked, to the end of his life. Because he thought saying he\nbelieved it <em>absolved him of responsibility</em>.</p>\n</blockquote>\n\n<p>“You know that isn’t true” — I’m going to remember that reply. She also includes this Zen koan, which I don’t recall seeing before, but which I just love, and is perfectly apt for our moment: “You cannot wake someone up who is pretending to be asleep.”</p>\n\n<div>\n<a  title=\"Permanent link to ‘‘They Absolutely Do Not Believe Their Own Bullshit, but It’s Useful for Them to Pretend They Do.’’\"  href=\"https://daringfireball.net/linked/2021/01/10/they-do-not-believe-their-own-bullshit\">&nbsp;★&nbsp;</a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"6a07c128d947e5dd777a5482302996431f16b65bc0d6ee8151c9067e85c63a69","category":"Tech"}