{"title":"Apple Elaborates on Potential for iPhone 12 and MagSafe Accessories to Interfere With Implantable Medical Devices","link":"https://www.macrumors.com/2021/01/23/apple-updates-iphone-magnet-support-document/","date":1611441727000,"content":"Since the launch of iPhone 12 models in October, Apple has acknowledged that the devices may cause electromagnetic interference with medical devices like pacemakers and defibrillators, but the company has now shared additional information.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2020/10/magsafecasedangle.jpg\" alt=\"\" width=\"3840\" height=\"2160\" class=\"aligncenter size-full wp-image-765667\" />\r\n<br/>\r\nApple added the following paragraph to a related <a href=\"https://support.apple.com/en-us/HT211900\">support document</a> today:<blockquote>Medical devices such as implanted pacemakers and defibrillators might contain sensors that respond to magnets and radios when in close contact. To avoid any potential interactions with these devices, keep your iPhone and MagSafe accessories a safe distance away from your device (more than 6 inches / 15 cm apart or more than 12 inches / 30 cm apart if wirelessly charging). But consult with your physician and your device manufacturer for specific guidelines.</blockquote>While the support document already mentioned \"MagSafe accessories\" in the title, Apple has further emphasized that accessories like the MagSafe Charger and MagSafe Duo Charger may also interfere with medical devices:<blockquote>All MagSafe accessories (each sold separately) also contain magnets—and MagSafe Charger and MagSafe Duo Charger contain radios. These magnets and electromagnetic fields might interfere with medical devices.</blockquote>Apple continues to state that while all iPhone 12 models contain more magnets than prior iPhone models, they are \"not expected to pose a greater risk of magnetic interference to medical devices than prior iPhone models.\"\r\n<br/>\r\n\r\n<br/>\r\nEarlier this month, an <a href=\"https://www.heartrhythmjournal.com/article/S1547-5271(20)31227-3/fulltext\">article in the Heart Rhythm Journal</a> indicated that iPhone 12 models can \"potentially inhibit lifesaving therapy in a patient\" due to magnetic interference with implantable medical devices. Three doctors in Michigan tested this interaction by holding an iPhone 12 near a patient's implantable cardioverter defibrillator, which immediately went into a \"suspended\" state for the duration of the test, according to the article.\r\n<br/>\r\n\r\n<br/>\r\n\"We hereby bring an important public health issue concerning the newer generation iPhone 12 which can potentially inhibit lifesaving therapy in a patient particularly while carrying the phone in upper pockets,\" the doctors wrote. \"Medical device manufacturers and implanting physicians should remain vigilant in making patients aware of this significant interaction of the iPhone 12 and other smart wearables with their cardiac implantable electronic devices.\"\r\n<br/>\r\n\r\n<br/>\r\nThe article in the Heart Rhythm Journal was first surfaced by Brazilian website <a href=\"https://macmagazine.com.br/post/2021/01/11/iphones-12-podem-interferir-em-marcapassos-e-cdis-mostra-estudo/\"><em>MacMagazine</em></a>. \r\n<br/>\r\n\r\n<br/>\r\nApple provides more information in the <a href=\"https://support.apple.com/en-us/guide/iphone/iph301fc905/ios\">\"Important safety information for iPhone\" section</a> of the iPhone User Guide.<div class=\"linkback\">Related Roundups: <a href=\"https://www.macrumors.com/roundup/iphone-12/\">iPhone 12</a>, <a href=\"https://www.macrumors.com/roundup/iphone-12-pro/\">iPhone 12 Pro</a></div><div class=\"linkback\">Tag: <a href=\"https://www.macrumors.com/guide/magsafe/\">MagSafe</a></div><div class=\"linkback\">Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#iPhone-12\">iPhone 12 (Buy Now)</a>, <a href=\"https://buyersguide.macrumors.com/#iPhone-12-Pro\">iPhone 12 Pro (Buy Now)</a></div><br/>This article, &quot;<a href=\"https://www.macrumors.com/2021/01/23/apple-updates-iphone-magnet-support-document/\">Apple Elaborates on Potential for iPhone 12 and MagSafe Accessories to Interfere With Implantable Medical Devices</a>&quot; first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br/><br/><a href=\"https://forums.macrumors.com/threads/apple-elaborates-on-potential-for-iphone-12-and-magsafe-accessories-to-interfere-with-implantable-medical-devices.2281604/\">Discuss this article</a> in our forums<br/><br/><div class=\"feedflare\">\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=DopsHs-PFNw:OSkLqUY9v24:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" border=\"0\"></img></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=DopsHs-PFNw:OSkLqUY9v24:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" border=\"0\"></img></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/DopsHs-PFNw\" height=\"1\" width=\"1\" alt=\"\"/>","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"6a621b8bc8a276d1396281619ea973259b6ccfd1937c3add29b9015e49bebd0e","category":"Apple"}