{"title":"New York State Bar Association Launches Inquiry to Expel Rudy Giuliani","link":"https://nysba.org/new-york-state-bar-association-launches-historic-inquiry-into-removing-trump-attorney-rudy-giuliani-from-its-membership/","date":1610401361000,"content":"\n<p>The New York State Bar Association:</p>\n\n<blockquote>\n  <p>But the president did not act alone. Hours before the angry mob\nstormed the Capitol walls, Trump’s personal attorney, Rudolph\nGiuliani, addressed a crowd of thousands at the White House,\nreiterating baseless claims of widespread election fraud in the\npresidential election and the Georgia U.S. Senate runoffs. “If\nwe’re wrong, we will be made fools of, but if we’re right a lot of\nthem will go to jail,” Mr. Giuliani said. “Let’s have trial by\ncombat.” […]</p>\n\n<p>NYSBA’s bylaws state that “no person who advocates the overthrow\nof the government of the United States, or of any state, territory\nor possession thereof, or of any political subdivision therein, by\nforce or other illegal means, shall be a member of the\nAssociation.” Mr. Giuliani’s words quite clearly were intended to\nencourage Trump supporters unhappy with the election’s outcome to\ntake matters into their own hands. Their subsequent attack on the\nCapitol was nothing short of an attempted coup, intended to\nprevent the peaceful transition of power.</p>\n\n<p>Mr. Giuliani will be provided due process and have an opportunity — should he so choose — to explain and defend his words and\nactions.</p>\n</blockquote>\n\n<p>So among his other troubles, the president’s personal attorney is going to be <s>disbarred</s> disgraced by the New York State Bar Association. “America’s Mayor”.</p>\n\n<p><strong>Update:</strong> The NY Bar Association is a voluntary organization — more like a private club — and neither bars nor disbars anyone. But it’s a bad look for Giuliani. And, unsurprisingly, <a href=\"https://www.nytimes.com/2021/01/11/us/giuliani-disbarment.html\">he has been referred to the NY State Senate’s judiciary committee for proper disbarment</a>.</p>\n\n<div>\n<a  title=\"Permanent link to ‘New York State Bar Association Launches Inquiry to Expel Rudy Giuliani’\"  href=\"https://daringfireball.net/linked/2021/01/11/giuliani-nysba\">&nbsp;★&nbsp;</a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"6c5b1c6a3ac3fc1dbf2b709c0ad405b90d1e0b5e855ca1b2a73aa2557c1c22ee","category":"Tech"}