{"title":"Alvarado and Van Aert take wins at Overijse World Cup: Daily News Digest","link":"https://cyclingtips.com/2021/01/alvarado-and-van-aert-take-wins-in-final-world-cup-round-in-overijse-daily-news-digest/","date":1611529268000,"content":"<p>Hello again, CyclingTips readers,</p>\n\n\n\n<p>Sunday brought the final World Cup race of this cyclocross season on Sunday in Overijse, Belgium, where most of the big names in &#8216;cross battled as the world championships loom. In other news, current and former pros reacted to the news that Dumoulin is taking a break from competition, while the road event at the Santos Festival of Cycling reached its conclusion after four days of racing.</p>\n\n\n\n<p>Read on for the latest from the world of cycling.</p>\n\n\n\n<p><em>Dane Cash<br>News Editor</em></p>\n\n\n\n<h2>What&#8217;s news?</h2>\n\n\n\n<h3>Alvarado and Van Aert take wins in final World Cup round</h3>\n\n\n\n<p>Sunday saw most of the top stars of cyclocross doing battle in Overijse, Belgium, in the final World Cup event before the upcoming world championships, and when all was said and done, Ceylin del Carmen Alvarado and Wout van Aert emerged victorious on the day, with Lucinda Brand and Van Aert taking the overall series wins.</p>\n\n\n\n<p>Alvarado, Lucinda Brand, Denise Betsema, Manon Bakker, and Clara Honsinger led the women&#8217;s race on the fourth of five laps before Alvarado and Brand rode clear, and then Alvarado pulled away on a muddy downhill in the final lap. Alvarado then pressed on alone and there was no catching her from there.</p>\n\n\n\n<p>The reigning world champ soloed to victory with a 20-second gap over Brand, who took second after outsprinting Bakker in the finale. Brand&#8217;s second-place finish was good enough to secure her the overall series win.</p>\n\n\n\n<p>Van Aert took the men&#8217;s victory after holding off Mathieu van der Poel, who punctured early in the race. Van Aert soloed away following Van der Poel&#8217;s puncture, and although Van der Poel managed to close the gap back down to within 10 seconds, he was unable to fully get back up to Van Aert, and before long the gap yawned out again.</p>\n\n\n\n<p>Van Aert took a comfortable win in the end with Van der Poel in second, 1:03 back, and Tom Pidcock in third, 2:07 back. With his win on the day, Van Aert secured the World Cup series win.</p>\n\n\n\n<h3>Gigante and Durbridge take overall wins at Santos Festival of Cycling</h3>\n\n\n\n<p>Sarah Gigante and Luke Durbridge took the overall victories at the Santos Festival of Cycling on Sunday at the end of four days of road racing as Georgia Baker and Sam Welsford took wins on the final stage.</p>\n\n\n\n<p>Baker sprinted to the stage 4 victory over Ruby Roseman-Gannon and Peta Mullens in the women&#8217;s race with Gigante finishing safely with the pack to secure the overall title. Lucy Kennedy and Roseman-Gannon rounded out the GC podium.</p>\n\n\n\n<p>Welsford took the stage 4 win in a sprint ahead of Kaden Groves and Jensen Plowright, with Durbridge rolling across the line with the peloton to seal the overall win. Luke Plapp took overall runner-up honors with Chris Harper finishing third on GC.</p>\n\n\n\n<h3>Current and former pros offer support for Dumoulin after he decides to take a break from racing</h3>\n\n\n\n<p>Tom Dumoulin announced on Saturday that he would be stepping away from racing for the time being, and a number of fellow current and former pros have since offered words of support either in social media posts or interviews. Among them was the aforementioned Wout van Aert, Dumoulin&#8217;s teammate at Jumbo-Visma, who told media at Flandriencross on Saturday that &#8220;everyone has difficult times and you have to respect that,&#8221; and said that he hoped Dumoulin would &#8220;come back stronger.&#8221; Dumoulin&#8217;s former teammate Marcel Kittel, who retired from pro cycling in 2019, was another.</p>\n\n\n\n<p>&#8220;I&#8217;ve always admired Tom Dumoulin for his strength. On the bike when [we] were teammates and won Tour de France stages together,&#8221; Kittel wrote on Facebook.</p>\n\n\n\n<p>&#8220;And off the bike for his clear opinion and honest critic.</p>\n\n\n\n<p>&#8220;Of course it&#8217;s sad to see him taking a timeout from cycling now, but he also stays true to himself to take the time he needs and figure out what who he is and what he wants. I know from personal experience how it feels and how difficult it can be when you&#8217;re doubting what you do and you want to look beyond your current life and identity. Only time will give you the answers and I hope for Tom that he&#8217;ll find them soon.&#8221;</p>\n\n\n\n<h3>Alvarado and Van der Poel take victories at Flandriencross</h3>\n\n\n\n<p>In case you missed the racing on Saturday, Ceylin del Carmen Alvarado and Mathieu van der Poel rode to the wins at the Flandriencross X2O Badkamers Trofee race.</p>\n\n\n\n<p>Alvarado soloed to victory in the the women&#8217;s event, taking the win with a 19-second advantage over Denise Betsema. Manon Bakker rounded out the podium on day, finishing 25 seconds down.</p>\n\n\n\n<p>Van der Poel took the men&#8217;s race after a close battle with Wout van Aert. The Dutchman hit the line seven seconds ahead of his Belgian rival, with Laurens Sweeck taking third on the day, one minute down.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cyclingtips.com/2021/01/alvarado-and-van-aert-take-wins-in-final-world-cup-round-in-overijse-daily-news-digest/\">Alvarado and Van Aert take wins at Overijse World Cup: Daily News Digest</a> appeared first on <a rel=\"nofollow\" href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"73164bbee31c4ed450cd39b407ef247a15a2ab08b27c13a2d441018e8b76318c","category":"Cycling"}