{"title":"The Republicans Are Turning on Trump","link":"https://www.nytimes.com/live/2021/01/12/us/impeachment-trump-25th-amendment","date":1610487991000,"content":"\n<p>Two links from The Times this afternoon illustrate how quickly Trump is falling into political ignominy and shame. <a href=\"https://www.nytimes.com/live/2021/01/12/us/impeachment-trump-25th-amendment/in-a-tacit-break-with-trump-house-republicans-will-not-formally-lobby-against-his-impeachment\">First, Republicans in the House began inching away</a>:</p>\n\n<blockquote>\n  <p>House Republican leaders have decided not to formally lobby\nmembers of the party against voting to impeach President Trump,\nmaking a tacit break with him as they scrambled to gauge support\nwithin their ranks for a vote on Wednesday to charge him with\ninciting violence against the country. While Representative Kevin\nMcCarthy of California, the minority leader, has said that he will\n“personally” oppose impeachment and sought to steer Republicans in\na different direction, his decision not to officially lean on\nlawmakers to vote against the move constituted a subtle shift away\nfrom the president.</p>\n\n<p>Representative Liz Cheney of Wyoming, the No. 3 House Republican\nwho was considering backing the impeachment charge against Mr.\nTrump, privately told colleagues on a call Monday the matter was a\n“vote of conscience.” Ms. Cheney, the scion of a storied\nRepublican family, was also privately counseling fellow\nRepublicans on how to navigate a vote that could shape their\ncareers.</p>\n</blockquote>\n\n<p>Second, <a href=\"https://www.nytimes.com/2021/01/12/us/mitch-mcconnell-trump-impeachment.html\">Mitch McConnell</a>, who leads Republicans in the Senate, (and who is a <em>measure twice, cut once</em> sort of fellow):</p>\n\n<blockquote>\n  <p>Senator Mitch McConnell, the Republican leader, has told\nassociates he believes President Trump committed impeachable\noffenses and that he is pleased that Democrats are moving to\nimpeach him, believing that it will make it easier to purge him\nfrom the party, according to people familiar with his thinking.\nThe House is voting Wednesday to formally charge Mr. Trump with\ninciting violence against the country.</p>\n</blockquote>\n\n<p>And, just a few hours after trying out the “I’m not for impeachment but it’s OK if other Republicans are” line, McCarthy moves even further:</p>\n\n<blockquote>\n  <p>At the same time, Representative Kevin McCarthy, the minority\nleader and one of Mr. Trump’s most steadfast allies in Congress,\nhas asked other Republicans whether he ought to call on Mr. Trump\nto resign in the aftermath of last week’s riot at the Capitol,\naccording to three Republican officials briefed on the\nconversations.</p>\n</blockquote>\n\n<p>Political bankruptcy, just like the financial sort, happens two ways. Gradually, then suddenly.</p>\n\n<div>\n<a  title=\"Permanent link to ‘The Republicans Are Turning on Trump’\"  href=\"https://daringfireball.net/linked/2021/01/12/the-republicans-are-turning-on-trump\">&nbsp;★&nbsp;</a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"7af43bed30fcfa12d4cd9a4abb76f6c04720c1426c1003d4a0b581afccc8b9ef","category":"Tech"}