{"title":"New RISC-V hardware designs from 5G startup EdgeQ","link":"https://arstechnica.com/?p=1737314","date":1611666035000,"content":"<div id=\"rss-wrap\">\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul class=\"gallery shortcode-gallery gallery-wide\"><li>\n        <div class=\"gallery-item-content\">  \n        <div class=\"gallery-image\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/01/edgeq-risc-v-cpu-extended-980x537.png\" alt=\"\"></div>\n        <p>\n          This is a diagram of an entire host board. EdgeQ's extended RISC-V CPU is on the upper right; \"Host Processor\" on the left is the CPU the Linux OS would actually run on.                      [credit:\n                        <a href=\"https://www.edgeq.io/\">EdgeQ</a>\n                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p>Today, 5G cellular startup EdgeQ is announcing the addition of two new members to its advisory board—former Qualcomm CEO Paul Jacobs, and former Qualcomm CTO Matt Grob. Their mission is to cut the Total Cost of Ownership (TCO) of 5G cellular base stations in half by leveraging and extending open hardware RISC-V designs.</p>\n<p>Traditionally, Radio Access Network (RAN) devices have tended to be closed design and deeply proprietary—much like consumer Wi-Fi and network hardware, they depend on closed-design ASICs with vendor-provided drivers and firmware. Such closed stacks generally cannot be upgraded to accommodate new protocols and use cases—for example, a Radio Unit or Distributed Unit designed for 4G networks must typically be replaced in its entirety in order to service 5G devices.</p>\n<p>By contrast, vendors can implement their own <a href=\"https://telecominfraproject.com/openran/\">OpenRAN</a> solutions, which generally implement fewer functions in hardware, and more in software running on traditional operating systems such as Linux. But implementing such an O-RAN properly requires very deep protocol expertise to get right, and it tends to be extremely power-hungry and expensive to maintain once finished.</p></div><p><a href=\"https://arstechnica.com/?p=1737314#p3\">Read 5 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1737314&comments=1\">Comments</a></p>","author":"Jim Salter","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"7d279e5bb232b04aa98c307ab526e995fe88696c35fd76ee45f2b4e494902d3b","category":"Tech"}