{"title":"COROS Rolls Out Update Adding Waypoint Navigation: Hands-on","link":"https://www.dcrainmaker.com/2021/01/coros-rolls-out-update-adding-waypoint-navigation-hands-on.html","date":1610983328000,"content":"<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/01/DSC_2441.jpg\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"DSC_2441\" src=\"https://media.dcrainmaker.com/images/2021/01/DSC_2441_thumb.jpg\" alt=\"DSC_2441\" width=\"720\" height=\"480\" border=\"0\" /></a></p>\n<p>COROS has begun rolling out a new firmware update today that adds in more exacting time splits for certain sports, as well as a new waypoints-like feature for outdoor route navigation. In addition, the running track mode now supports structured workouts.</p>\n<p>These updates are available for the COROS VERTIX, APEX Pro, and PACE 2, with the APEX coming a bit later this week. Note that while the rollouts began this morning, they are typically staged, which means it won’t necessarily show up on your device instantly – but may take a few hours/days. Also, you’ll need the latest COROS smartphone app to both update and utilize these features.</p>\n<p>Here’s the full list of what’s in this update:</p>\n<ol>\n<li>Adds 0.01s to Run, Track Run, Bike, Pool Swim, and Rowing</li>\n<li>Adds checkpoint feature that allows users to record a point before, or during the outdoor workout under route navigation [Not for COROS Pace 2, as it doesn’t support navigation]</li>\n<li>Workout program supports track run</li>\n<li>App workout details include weather info: temperature, humidity, and wind</li>\n<li>New map layer options in the app from Mapbox: outdoor terrain, winter, and dark</li>\n</ol>\n<p>Got all that? Good. Essentially all COROS watches get this update save the original COROS Pace, which is great! COROS is still mostly early enough in their existence as a company that it’s relatively easy for them to support all watches for firmware updates. But as we saw with the original COROS Pace, eventually it becomes challenging to plan hardware wise for things years down the road. While that’s easier on high powered devices like a phone (or an Apple Watch), it’s far more challenging on endurance wearables that are designed to eke out every little bit of battery performance (at the expense of system capacity).</p>\n<h3><span style=\"font-weight: bold;\">New Navigation Bits:</span></h3>\n<p>I wanted to briefly talk about the new routing/navigation features related to so-called ‘Checkpoints’. Ultimately, these ‘checkpoints’ are actually just called waypoints by all other apps/platforms/standards, though, the actual nuance of how they are implemented is different than what other platforms do.</p>\n<p>In talking to COROS about it over the last few days, they see this as a starting point for deeper features around navigation and waypoints.</p>\n<p>First though, let’s establish the core new features here to begin with, bullet-point style:</p>\n<p>A) Ability to view checkpoints in the COROS smartphone app atop an existing GPX route within the COROS app<br />\nB) Can then transfer that route/course to your watch, inclusive of the checkpoints<br />\nC) On the watch you’ll see the distance and elevation remaining to the next checkpoint<br />\nD) You’ll also see the checkpoints listed on the breadcrumb and elevation profile pages<br />\nE) While out on the trail you can then save a new waypoint/checkpoint at any time<br />\nF) That waypoint is then added to the file and synced back to the smartphone app</p>\n<p>Now, before I show this – the big-ticket item that’s *NOT* here though is the ability to navigate to a newly saved checkpoint on your watch, such as using the compass. Meaning, if you save a waypoint next to a given spot, you can’t then later on navigate back to that spot. There’s no menu for navigating to a new checkpoint on the watch. But COROS says that type of functionality is in the queue to implement.</p>\n<p>To get started you’ll need a GPX file *WITH WAYPOINTS* defined in it. Unfortunately this isn’t something you can create in the app (either the route or the waypoints in the route). So you will need to use a 3rd party app to do that.</p>\n<p>Side note: This turned out to be a solid pain in the ass to do purely web-based. Strava doesn’t create waypoints, and while Komoot creates waypoints, they don’t export them in the GPX file. Next, Garmin Connect allows waypoint creation, but doesn’t actually put them in the .GPX file upon export. Google Maps only allows KML/KMZ export. Easy Route, which I typically use, can’t create waypoints. Other apps I tried could create waypoints, but then sucked creating routes because they didn’t leverage auto-trail following. Ultimately, ended up using Suunto Movescount. #NotKidding.</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/01/image-28.png\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"image\" src=\"https://media.dcrainmaker.com/images/2021/01/image_thumb-27.png\" alt=\"image\" width=\"722\" height=\"376\" border=\"0\" /></a></p>\n<p><em>(Another side note: </em><a href=\"https://www.suunto.com/fy-nl/Content-pages/suuntos-digital-services/\"><em>According to this page</em></a><em>, I’ve got a mere one week left till Movescount wouldn’t allow me to do this either. Shame. Long Live Movescount!)</em></p>\n<p>Ok, with that file created, I e-mailed it to myself and told my phone to open it using the COROS app. From there I could see the route, and it even shows me the waypoints (thank god, given how long I spent trying to get to this point). Also, each time you click on a waypoint it’ll show how long between points and the elevation.</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/01/IMG_6453.png\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"IMG_6453\" src=\"https://media.dcrainmaker.com/images/2021/01/IMG_6453_thumb.png\" alt=\"IMG_6453\" width=\"237\" height=\"510\" border=\"0\" /></a> <a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/01/IMG_6454.png\"><img style=\"display: inline; background-image: none;\" title=\"IMG_6454\" src=\"https://media.dcrainmaker.com/images/2021/01/IMG_6454_thumb.png\" alt=\"IMG_6454\" width=\"237\" height=\"510\" border=\"0\" /></a> <a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/01/IMG_6455.jpg\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"IMG_6455\" src=\"https://media.dcrainmaker.com/images/2021/01/IMG_6455_thumb.jpg\" alt=\"IMG_6455\" width=\"237\" height=\"510\" border=\"0\" /></a></p>\n<p>In this case, while there is actually a mere 15m of elevation gain to the top of the hill – Suunto Movescount doesn’t quite show it, thus, COROS doesn’t show it. Look, by this point in the post you’re lucky you’re getting any example data at all given how much time I burned trying to create a functional file.</p>\n<p>You can edit the waypoints, handy since you’ll have noticed I managed to spell ‘Hill’ wrong earlier. So I fixed that down below. Then, I sent it off to the watch to sync to the Vertix:</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/01/IMG_6456.png\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"IMG_6456\" src=\"https://media.dcrainmaker.com/images/2021/01/IMG_6456_thumb.png\" alt=\"IMG_6456\" width=\"237\" height=\"510\" border=\"0\" /></a> <a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/01/IMG_6457.png\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"IMG_6457\" src=\"https://media.dcrainmaker.com/images/2021/01/IMG_6457_thumb.png\" alt=\"IMG_6457\" width=\"237\" height=\"510\" border=\"0\" /></a> <a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/01/IMG_6460.png\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"IMG_6460\" src=\"https://media.dcrainmaker.com/images/2021/01/IMG_6460_thumb.png\" alt=\"IMG_6460\" width=\"237\" height=\"510\" border=\"0\" /></a></p>\n<p>After that’s done, load up your route on the COROS watch of choice, and you’ll see the waypoints showing up as little orange icons:</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/01/DSC_2427.jpg\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"DSC_2427\" src=\"https://media.dcrainmaker.com/images/2021/01/DSC_2427_thumb.jpg\" alt=\"DSC_2427\" width=\"720\" height=\"480\" border=\"0\" /></a></p>\n<p>There’s also a new menu item called ‘Sections’, which lists the sections between each waypoint. This is pretty handy to be able to break-up the course, showing the same sections as seen earlier on the app:</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/01/DSC_2428.jpg\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"DSC_2428\" src=\"https://media.dcrainmaker.com/images/2021/01/DSC_2428_thumb.jpg\" alt=\"DSC_2428\" width=\"355\" height=\"237\" border=\"0\" /></a> <a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/01/DSC_2429.jpg\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"DSC_2429\" src=\"https://media.dcrainmaker.com/images/2021/01/DSC_2429_thumb.jpg\" alt=\"DSC_2429\" width=\"355\" height=\"237\" border=\"0\" /></a></p>\n<p>And if you look in the elevation field, you’d likely see the elevation profiles of each one. But as discussed earlier, my file produced null elevation data and it’s Monday and lunch should have been three hours ago. Maybe on a Wednesday I might have tried harder.</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/01/DSC_2430.jpg\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"DSC_2430\" src=\"https://media.dcrainmaker.com/images/2021/01/DSC_2430_thumb.jpg\" alt=\"DSC_2430\" width=\"720\" height=\"480\" border=\"0\" /></a></p>\n<p>Next, as I start, it’ll show me the segments and how much distance to each segment. This is pretty darn cool – I like it!</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/01/DSC_2424.jpg\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"DSC_2424\" src=\"https://media.dcrainmaker.com/images/2021/01/DSC_2424_thumb.jpg\" alt=\"DSC_2424\" width=\"720\" height=\"480\" border=\"0\" /></a></p>\n<p>And you’ll also get a notification upon each checkpoint/waypoint you arrive at – ‘Reach Check Point 2’ – as seen below. After that, though not immediately, it’ll update to show the next checkpoint. It seemed to wait about 100-150m after I left the checkpoint before it triggered showing details to the next checkpoint.</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/01/DSC_2425.jpg\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"DSC_2425\" src=\"https://media.dcrainmaker.com/images/2021/01/DSC_2425_thumb.jpg\" alt=\"DSC_2425\" width=\"720\" height=\"480\" border=\"0\" /></a></p>\n<p>There isn’t any way to navigate to an existing checkpoint after you’ve gone past it. So you can’t pull open checkpoint #2 after you’ve gone to #4. Which in some ways hints at how COROS sees this feature used: Race checkpoints. They outlined a scenario where a race director posts a .GPX file of the race with the various aide stations or – literally – checkpoints in the file. Hence the rebranding of waypoints to checkpoints.</p>\n<p>As I mentioned earlier you can save waypoints at any time, and even see them on the map mid-route too once saved:</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/01/DSC_2417.jpg\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"DSC_2416\" src=\"https://media.dcrainmaker.com/images/2021/01/DSC_2416_thumb.jpg\" alt=\"DSC_2416\" width=\"355\" height=\"237\" border=\"0\" /> <img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"DSC_2417\" src=\"https://media.dcrainmaker.com/images/2021/01/DSC_2417_thumb.jpg\" alt=\"DSC_2417\" width=\"355\" height=\"237\" border=\"0\" /></a></p>\n<p>However, these are not accessible to route to within this section. Instead, they’re accessible afterwards on the COROS smartphone app in your completed activity, you’ll see the little icon added to the screen (#1 below), and then if you save that specific route it’ll save that checkpoint for your next workout. However, it won’t convey over any of the existing checkpoints from that previous run/ride/whatever. Meaning, the checkpoints that I defined from the earlier GPX file aren’t carried through to the new route if I add a new checkpoint.</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/01/IMG_6461.png\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"IMG_6461\" src=\"https://media.dcrainmaker.com/images/2021/01/IMG_6461_thumb.png\" alt=\"IMG_6461\" width=\"357\" height=\"770\" border=\"0\" /></a> <a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/01/IMG_6463.png\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"IMG_6463\" src=\"https://media.dcrainmaker.com/images/2021/01/IMG_6463_thumb.png\" alt=\"IMG_6463\" width=\"357\" height=\"770\" border=\"0\" /></a></p>\n<p>Note that it&#8217;s not possible at this time to do both a structured workout and navigation at the same time.</p>\n<p>And with that, you know everything there is to know about checkpoints on COROS watches.</p>\n<p>Overall, it’s good to see COROS expanding their navigational aspects here. And it’s clear they’re starting to build the foundation for more features, as they themselves noted in my chat with them. I really like the segmenting of chunks between checkpoints, that makes a lot of sense – and fills in the two core metrics most people care about (distance to next point and elevation gain to next point).</p>\n<p>Given this is their first slice at this, it won’t have anywhere near the depth of features of watches that have been around a decade. And I think if one looks at my feedback to COROS over the last year, I’ve been pretty consistent that they need to focus on polish on the app/platform side. To that end, we have been seeing that. Aside from the <a href=\"https://www.dcrainmaker.com/2020/09/coros-pace-2-in-depth-review-multisport-running-power.html\">super-well executed COROS Pace 2 this past fall</a>, almost everything else has been updates for existing watches – which is great. However, I think my attempt to write this post inadvertently exemplifies some of the opportunities COROS has to simplify the platform side further. In my ideal world I’d simply have authenticated my COROS account to Strava or Komoot or whomever, pulled in the route I created there, and then added any waypoints quickly using the COROS app. No messy files to create, e-mail to myself, edit, and so on.</p>\n<p>But ultimately, no vendor boils the ocean overnight – and COROS has shown they can keep heating up the water each month. As always, looking forward to seeing what they add next.</p>\n<p>With that – thanks for reading!</p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"7ee5f0efbabe4e39069efa986c70676dd98fa97ae910fc53420de51dc5a38102","category":"Cycling"}