{"title":"Nice NYT Profile on Letterboxd","link":"https://www.nytimes.com/2021/01/13/movies/letterboxd-growth.html?referringSource=articleShare","date":1610747641000,"content":"\n<p>Calum Marsh, writing for The New York Times:</p>\n\n<blockquote>\n  <p>Early last decade, <a href=\"https://matthewbuchanan.name/\">Matthew Buchanan</a> and Karl von Randow, web\ndesigners based in Auckland, New Zealand, were seeking a passion\nproject. Their business, a boutique web design studio called\nCactuslab, developed apps and websites for various clients, but\nthey wanted a project of their own that their team could plug away\nat when there wasn’t much else to do.</p>\n\n<p>Buchanan had an idea for a social media site about movies. At the\ntime, he reflected, he used <a href=\"http://flickr.com/\">Flickr</a> to share photos and\n<a href=\"http://last.fm/\">Last.fm</a> to share his taste in music. <a href=\"http://imdb.com/\">IMDb</a> was a database;\nit wasn’t, in essence, social. That left a gap in the field. The\nresult was an app and social media network called <a href=\"https://letterboxd.com/\">Letterboxd</a>,\nwhich its website describes, aptly, as “Goodreads for film.”</p>\n</blockquote>\n\n<p>Letterboxd harks back to an earlier era of the internet: it’s just <em>nice</em>. It’s nice to look at, nice to use, and serves several useful purposes. It’s a great place to track what you’ve watched <em>and</em> to find new things to watch. But also: that’s it. There’s no world domination plan. It’s just an exquisite app and website made by people trying to make something nice for movie lovers.</p>\n\n<div>\n<a  title=\"Permanent link to ‘Nice NYT Profile on Letterboxd’\"  href=\"https://daringfireball.net/linked/2021/01/15/letterboxd\">&nbsp;★&nbsp;</a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"7fe086a0bc903e4971523dee509684fcac3a9e874b96571dcd95052234a42c31","category":"Tech"}