{"title":"Dan Riccio Transitioning to New Project, John Ternus to Lead Apple's Hardware Engineering Team","link":"https://www.macrumors.com/2021/01/25/dan-riccio-transitioning-new-project/","date":1611612327000,"content":"Apple <a href=\"https://www.apple.com/newsroom/2021/01/dan-riccio-begins-a-new-chapter-at-apple/\">today announced</a> that current Apple hardware engineering SVP Dan Riccio is transitioning to a new role where he will focus on an unspecified project, with John Ternus set to take over as Apple's senior vice president of hardware engineering.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/01/apple-dan-riccio.jpg\" alt=\"\" width=\"1960\" height=\"1362\" class=\"aligncenter size-full wp-image-780190\" />\r\n<br/>\r\nIn a statement, Apple CEO <a href=\"https://www.macrumors.com/guide/tim-cook/\">Tim Cook</a> said that Riccio made Apple a better and more innovative company, and that Ternus will bring a deep expertise and breadth of experience to the Hardware Engineering teams.<blockquote>\"Every innovation Dan has helped Apple bring to life has made us a better and more innovative company, and we're thrilled that he'll continue to be part of the team,\" said &zwnj;Tim Cook&zwnj;, Apple's CEO. \"John's deep expertise and wide breadth of experience make him a bold and visionary leader of our Hardware Engineering teams. I want to congratulate them both on these exciting new steps, and I'm looking forward to many more innovations they'll help bring to the world.\"</blockquote>There is no word on what project Riccio will be working on, but Apple has an <a href=\"https://www.macrumors.com/roundup/apple-car/\">Apple Car</a> and various augmented reality and virtual reality devices in the works. The &zwnj;Apple Car&zwnj; project was <a href=\"https://www.macrumors.com/2020/12/08/apple-car-join-giannandrea/\">recently taken over</a> by Apple AI chief John Giannandrea, so Riccio's role is a mystery.\r\n<br/>\r\n\r\n<br/>\r\nGoing forward, Riccio will be a vice president of engineering, which seems to be a title downgrade, so it's possible that he is aiming to take a step back from Apple. Riccio has been with Apple since 1998, when he joined the product design team. \r\n<br/>\r\n\r\n<br/>\r\nRiccio became vice president of <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a> Hardware Engineering in 2010, and in 2012, took over the Hardware Engineering team. Apple says that Riccio will \"continue to play an instrumental role in shaping the future of Apple's products.\"\r\n<br/>\r\n\r\n<br/>\r\nIn a statement, Riccio said that working at Apple has been \"the opportunity of a lifetime\" and that it is now the right time for a change.<blockquote>\"Working at Apple has been the opportunity of a lifetime, spent making the world's best products with the most talented people you could imagine,\" said Riccio. \"After 23 years of leading our Product Design or Hardware Engineering teams -- culminating with our biggest and most ambitious product year ever -- it's the right time for a change. Next up, I'm looking forward to doing what I love most -- focusing all my time and energy at Apple on creating something new and wonderful that I couldn't be more excited about.\"</blockquote>John Ternus initially joined Apple as part of the Product Design team in 2001, and in 2013 took on a role as vice president of Hardware Engineering. He has overseen the launch of products that include the first-generation <a href=\"https://www.macrumors.com/guide/airpods/\">AirPods</a>, every &zwnj;iPad&zwnj;, and the <a href=\"https://www.macrumors.com/roundup/iphone-12/\">iPhone 12</a> and 12 Pro.\r\n<br/>\r\n\r\n<br/>\r\n<div class=\"linkback\">Tags: <a href=\"https://www.macrumors.com/guide/dan-riccio/\">Dan Riccio</a>, <a href=\"https://www.macrumors.com/guide/john-ternus/\">John Ternus</a></div><br/>This article, &quot;<a href=\"https://www.macrumors.com/2021/01/25/dan-riccio-transitioning-new-project/\">Dan Riccio Transitioning to New Project, John Ternus to Lead Apple&#039;s Hardware Engineering Team</a>&quot; first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br/><br/><a href=\"https://forums.macrumors.com/threads/dan-riccio-transitioning-to-new-project-john-ternus-to-lead-apples-hardware-engineering-team.2281858/\">Discuss this article</a> in our forums<br/><br/><div class=\"feedflare\">\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=QRpeDWaaz_k:lpDAu_js6VQ:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" border=\"0\"></img></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=QRpeDWaaz_k:lpDAu_js6VQ:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" border=\"0\"></img></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/QRpeDWaaz_k\" height=\"1\" width=\"1\" alt=\"\"/>","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"804e67735becc8311a5524e3ba7f933facc48abdbf71f822d67446f4b667d8f3","category":"Apple"}