{"title":"Apple's Jeff Williams and Jay Blahnik Discuss New 'Time to Walk' Feature","link":"https://www.macrumors.com/2021/01/25/apple-time-to-walk-jeff-williams-jay-blahnik/","date":1611597144000,"content":"Apple is <a href=\"https://www.macrumors.com/2021/01/25/apple-fitness-time-to-walk-launches-today/\">today launching</a> a new \"Time to Walk\" feature that will allow Apple Watch owners who are Apple Fitness+ subscribers to listen to audio stories from celebrities, musicians, athletes, and other influential people while they walk.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/01/time-to-walk-apple-watch-1.jpg\" alt=\"\" width=\"1306\" height=\"1101\" class=\"aligncenter size-full wp-image-780135\" />\r\n<br/>\r\nApple Chief Operating Officer Jeff Williams and Director of Fitness and Health technologies Jay Blahnik spoke to <em><a href=\"https://www.independent.co.uk/life-style/gadgets-and-tech/apple-fitness-watch-latest-feature-b1792355.html\">The Independent</a></em> about the new feature to give some insight into how it works and how Apple envisions it being used.\r\n<br/>\r\n\r\n<br/>\r\nWith Time to Walk, guests that include Shawn Mendes and Dolly Parton will tell Apple Watch owners about their lives during the course of the walk. It's set up as a one-to-one experience, with the guest in question also on a walk, and photographs are shared at key points during each story.\r\n<br/>\r\n\r\n<br/>\r\nAccording to Blahnik, there were many avenues for the \"creative execution\" of Time to Walk, but \"having just the guest felt like the right thing.\" Williams said that Apple was aiming for a human connection in a time when many people are isolated.\r\n<br/>\r\n<blockquote>\"If you ask somebody to tell you a life story, they will almost always involve challenges and, because we all face those, it's wonderful to hear about other people's challenges and how they've dealt with them. It's such a part of the human connection.\"\r\n<br/>\r\n\r\n<br/>\r\n\"I think this is useful anytime, but one of the things with shelter-in-place is it can drive isolation. I think people yearn for social connection and Time to Walk encourages people to get out and walk and offers this sense of connection to interesting people. I've found that within a couple of minutes of an episode, I feel like I'm out walking with someone.\"</blockquote>\r\n<br/>\r\nTime to Walk is an experience meant to mimic walking alongside someone else, and Williams said that there's \"something just really intimate\" about taking a walk and sharing it with another person. \"There was a lot of thought put into how this could be the most intimate experience for the individual,\" said Williams.\r\n<br/>\r\n\r\n<br/>\r\nOn the topic of the full Apple Fitness+ service, Blahnik said that it was designed to be \"welcoming to everybody,\" and that early feedback suggests Apple has been successful.\r\n<br/>\r\n<blockquote>There's a lot of people saying they're really motivated to do a whole bunch of things on their own, but they just need someone to lead them through a 10-minute yoga session. And then there are other people saying, 'I've never done anything and this is my first step and I'm doing the 10-minute yoga because I'm brand new'. I think we'll see that with Time to Walk: there'll be people who usually do something much more hardcore for their workout, but they really enjoy walking their dog and this makes it more entertaining.</blockquote>\r\n<br/>\r\nBlahnik expects that people may spend more time out walking with the Time to Walk stories, and that it may be a good on-ramp to get people involved with Apple Fitness+.\r\n<br/>\r\n\r\n<br/>\r\nEach of the four Time to Walk episodes that are available now range from 25 to 40 minutes in length, and Apple plans to add new episodes every Monday between now and April. Time to Walk is considered a watchOS 7.3 feature, but episodes are available now for Apple Fitness+ subscribers.\r\n<br/>\r\n\r\n<br/>\r\nApple Fitness+ is priced at &#36;9.99 per month, and in addition to these Time to Walk episodes, it provides access to home workouts across a range of categories from yoga and dance to running and cycling. Workouts can be watched on <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a>, <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a>, and <a href=\"https://www.macrumors.com/roundup/apple-tv/\">Apple TV</a>.\r\n<br/>\r\n\r\n<br/>\r\n<b>Update:</b> Williams and Blahnik also <a href=\"https://www.wellandgood.com/apple-time-to-walk/\">did an interview with Well + Good</a> that covers similar topics. <div class=\"linkback\">Related Roundups: <a href=\"https://www.macrumors.com/roundup/apple-watch/\">Apple Watch Series 6</a>, <a href=\"https://www.macrumors.com/roundup/apple-watch-se/\">Apple Watch SE</a>, <a href=\"https://www.macrumors.com/roundup/watchos-7/\">watchOS 7</a></div><div class=\"linkback\">Tags: <a href=\"https://www.macrumors.com/guide/jeff-williams/\">Jeff Williams</a>, <a href=\"https://www.macrumors.com/guide/jay-blahnik/\">Jay Blahnik</a>, <a href=\"https://www.macrumors.com/guide/health-and-fitness/\">health and fitness</a></div><div class=\"linkback\">Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#Apple_Watch\">Apple Watch (Neutral)</a>, <a href=\"https://buyersguide.macrumors.com/#Apple_Watch_SE\">Apple Watch SE (Buy Now)</a></div><br/>This article, &quot;<a href=\"https://www.macrumors.com/2021/01/25/apple-time-to-walk-jeff-williams-jay-blahnik/\">Apple&#039;s Jeff Williams and Jay Blahnik Discuss New &#039;Time to Walk&#039; Feature</a>&quot; first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br/><br/><a href=\"https://forums.macrumors.com/threads/apples-jeff-williams-and-jay-blahnik-discuss-new-time-to-walk-feature.2281821/\">Discuss this article</a> in our forums<br/><br/><div class=\"feedflare\">\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=eD1BpT5m9Pg:5gE73xD3wIA:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" border=\"0\"></img></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=eD1BpT5m9Pg:5gE73xD3wIA:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" border=\"0\"></img></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/eD1BpT5m9Pg\" height=\"1\" width=\"1\" alt=\"\"/>","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"895c285d88048fc5c9643661dcacbdae8367dffa71d873af74c46ff8d85a64dd","category":"Apple"}