{"title":"On Strategy","link":"https://markpeak.net/on-strategy/","date":1610381691000,"content":"<p>มีโอกาสได้อ่านโพสต์ที่เกี่ยวข้องกับ &#8220;ยุทธศาสตร์&#8221; (strategy) สองโพสต์ที่พูดถึงประเด็นเดียวกัน</p>\n<p>โพสต์แรกเป็นของ ชัชชาติ สิทธิพันธุ์ ที่นำประเด็นจากหนังสือ Good Strategy Bad Strategy ที่เขียนโดย Richard Rumelt อาจารย์ที่ UCLA และผู้เชี่ยวชาญด้านกลยุทธ์องค์กร สรุปกลยุทธ์ที่ดีและแย่ว่ามีลักษณะใดบ้าง</p>\n<p><iframe style=\"border: none; overflow: hidden;\" src=\"https://www.facebook.com/plugins/post.php?href=https%3A%2F%2Fwww.facebook.com%2Fchadchartofficial%2Fposts%2F3792996867427804&amp;width=500&amp;show_text=true&amp;appId=128606133826684&amp;height=735\" width=\"500\" height=\"735\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"allowfullscreen\"></iframe></p>\n<p>โพสต์ของคุณชัชชาติ นำกรอบเรื่องกลยุทธ์ที่ดี 3 ประการจาก Rumelt มาเปรียบเทียบกับสถานการณ์ COVID รอบต้นปี 2021</p>\n<blockquote><p>Rumelt อธิบายถึงแก่น (Kernel) ของการพัฒนากลยุทธ์ที่ดี ไว้ง่ายๆสามขั้นตอนคือ</p>\n<p>1. Diagnosis วิเคราะห์สถานการณ์ว่าเป็นอย่างไร อะไรคือความท้าทาย อุปสรรค ที่แท้จริง<br />\n2. A Guiding Policy นโยบายหลักที่ใช้ในการขับเคลื่อนเพื่อเอาชนะอุปสรรคและความท้าทายนั้น<br />\n3. A Set of Coherent Actions แผนการทำงานที่สอดคล้องกันทุกหน่วยงานเพื่อให้บรรลุตามนโยบาย Guiding Policy</p>\n<p>กลยุทธ์ที่แย่มักจะเกิดจากความผิดพลาดในสามขั้นตอนนี้ เช่น ไม่เข้าใจสถานการณ์ที่แท้จริง ไม่กล้าพูดถึงปัญหาหลัก นโยบายหลักไม่สอดคล้องกับความเป็นจริง หรือความไม่เป็นอันหนึ่งอันเดียวกันของแต่ละหน่วยงาน</p>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\">ถ้าลองยกตัวอย่างกรณีการระบาดครั้งใหม่ของโควิด 19 ในส่วนของกลยุทธ์ย่อยในการควบคุมจุดเริ่มของการระบาด จากมุมมองของประชาชนคนหนึ่ง</div>\n</div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\"></div>\n<div dir=\"auto\">Diagnosis การวิเคราะห์: การระบาดส่วนหนึ่งเริ่มจากกิจกรรมที่ผิดกฎหมาย เช่น การลักลอบข้ามแดน การเปิดบ่อนการพนัน เมื่อผิดกฎหมายก็ไม่สามารถควบคุมเรื่องการคัดกรอง การเว้นระยะห่าง รวมถึงการพยายามปกปิดข้อมูล ทำให้การระบาดแพร่กระจายมากขึ้น</div>\n</div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\"></div>\n<div dir=\"auto\">Guiding Policy นโยบายหลัก: ต้องดำเนินการอย่างเด็ดขาดกับผู้ทำผิดกฎหมายโดยเฉพาะเจ้าหน้าที่ของรัฐที่มีส่วนร่วม</div>\n</div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\"></div>\n<div dir=\"auto\">Coherent Actions: ทำแผนปฎิบัติการร่วมกันทุกหน่วย จริงจังในการปฏิบัติ ไม่ลูบหน้าปะจมูก ลงโทษผู้บังคับบัญชาของหน่วยงานที่ปล่อยปละละเลย ให้รางวัลในการชี้เบาะแส</div>\n</div>\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\n<div dir=\"auto\"></div>\n<div dir=\"auto\">แต่ถ้าเราเริ่มต้นการวิเคราะห์ว่า ไม่มีการทำผิดกฎหมาย ไม่มีบ่อน ไม่มีการลักลอบข้ามชายแดน ไม่มีเจ้าหน้าที่เกี่ยวข้อง สุดท้าย กลยุทธ์ก็จะไปเน้นไปที่การควบคุมคนที่ทำถูกกฎหมายแทน เพราะทำได้ง่ายกว่า สั่งปิด สั่งเปิด ได้ง่ายกว่า แต่ปัญหาและความท้าทายจริงๆไม่ได้รับการแก้ไข</div>\n</div>\n</blockquote>\n<p>อีกโพสต์นึงคือ <a href=\"https://onetonion.com/2020/12/02/%e0%b8%84%e0%b8%a7%e0%b8%b2%e0%b8%a1%e0%b9%80%e0%b8%82%e0%b8%a5%e0%b8%b2%e0%b8%82%e0%b8%ad%e0%b8%87%e0%b8%9c%e0%b8%b9%e0%b9%89%e0%b8%a1%e0%b8%b5%e0%b8%ad%e0%b8%b3%e0%b8%99%e0%b8%b2%e0%b8%88/\">ความเขลาของผู้มีอำนาจ</a> ของคุณวันชัย ตันติวิทยาพิทักษ์ อดีตบรรณาธิการนิตยสารสารคดี ที่เขียนเรื่องคำสั่ง 66/2523 ในยุคป๋าเปรม</p>\n<div class=\" content_cards_card content_cards_domain_onetonion-com\">\n\t\t\t<div class=\"content_cards_image\">\n\t\t\t\t<a class=\"content_cards_image_link\" href=\"https://onetonion.com/2020/12/02/%e0%b8%84%e0%b8%a7%e0%b8%b2%e0%b8%a1%e0%b9%80%e0%b8%82%e0%b8%a5%e0%b8%b2%e0%b8%82%e0%b8%ad%e0%b8%87%e0%b8%9c%e0%b8%b9%e0%b9%89%e0%b8%a1%e0%b8%b5%e0%b8%ad%e0%b8%b3%e0%b8%99%e0%b8%b2%e0%b8%88/\">\n\t\t\t\t\t<img src=\"https://onetonion.files.wordpress.com/2020/12/image_big_5cea87482b8c6.jpg\" alt=\"ความเขลาของผู้มีอำนาจ\">\t\t\t\t</a>\n\t\t</div>\n\t\n\t<div class=\"content_cards_title\">\n\t\t<a class=\"content_cards_title_link\" href=\"https://onetonion.com/2020/12/02/%e0%b8%84%e0%b8%a7%e0%b8%b2%e0%b8%a1%e0%b9%80%e0%b8%82%e0%b8%a5%e0%b8%b2%e0%b8%82%e0%b8%ad%e0%b8%87%e0%b8%9c%e0%b8%b9%e0%b9%89%e0%b8%a1%e0%b8%b5%e0%b8%ad%e0%b8%b3%e0%b8%99%e0%b8%b2%e0%b8%88/\">\n\t\t\tความเขลาของผู้มีอำนาจ\t\t</a>\n\t</div>\n\t<div class=\"content_cards_description\">\n\t\t<a class=\"content_cards_description_link\" href=\"https://onetonion.com/2020/12/02/%e0%b8%84%e0%b8%a7%e0%b8%b2%e0%b8%a1%e0%b9%80%e0%b8%82%e0%b8%a5%e0%b8%b2%e0%b8%82%e0%b8%ad%e0%b8%87%e0%b8%9c%e0%b8%b9%e0%b9%89%e0%b8%a1%e0%b8%b5%e0%b8%ad%e0%b8%b3%e0%b8%99%e0%b8%b2%e0%b8%88/\">\n\t\t\t<p>ตั้งแต่รัฐบาลชุดนี้เข้ามาบริหารประเทศต่อจากรัฐบาลเผด็จการ เราไม่เคยทราบเลยว่าหน่วยงานความมั่นคงของรัฐ อันประกอบด้วยหน่วยงานมากมาย ตั้งแต่สภาความมั่นคงแห่งชาติ กองทัพ ตำรวจ ฯลฯทำงานแบบมีเป้าประสงค์อ…</p>\n\t\t</a>\n\t</div>\n\t<div class=\"content_cards_site_name\">\n\t\t<img src=\"https://onetonion.files.wordpress.com/2019/02/6b3c7419-a6b8-422c-b716-0bb2b83dc7f5.jpeg?w=32\" alt=\"ONETONION \" class=\"content_cards_favicon\"/>\t\tONETONION \t</div>\n</div>\n<p>คนที่รู้จักนโยบาย 66/2523 คงทราบดีว่ามันเป็นการ &#8220;พลิกมุมคิด&#8221; ของสงครามต่อสู้คอมมิวนิสต์ในยุคนั้น</p>\n<blockquote><p>พลเอกเปรม เป็นอดีตแม่ทัพภาคสอง เป็นนายทหารที่ปฏิบัติหน้าที่สู้รบกับคอมมิวนิสต์มายาวนาน  การใช้กำลังทางทหารอย่างเดียว ไม่อาจแก้ปัญหาได้เลย มีการสู้รบกันทุกวัน ทั้งสองฝ่ายต่างสูญเสีย ซึ่งเป็นคนไทยทั้งนั้น</p>\n<p>ในระหว่างนั้นท่านมีทีมงานนายทหารหลักแหลมเป็นสายพิราบ  อาทิ พล.ต.ปฐม เสริมสิน, พ.อ.หาญ ลีนานนท์, พ.อ.เลิศ กนิษฐะนาคะ (ยศในขณะนั้น) ค่อย ๆ ออกแบบยุทธศาสตร์การแก้ปัญหาสงครามกลางเมือง  คิดว่าหากยังแก้ปัญหาแบบเดิมประเทศไปไม่รอดแน่นอน</p>\n<p>พวกเขาทราบดีว่า ชาวบ้านที่เข้าป่า เพราะถูกเจ้าหน้าที่หรือนายทุนข่มเหงรังแก จนทนไม่ไหวต้องเข้าป่าจับอาวุธ</p>\n<p>เช่นเดียวกับนักศึกษาสามพันกว่าคนที่เข้าป่า คนเหล่านี้เป็นเด็กรุ่นใหม่ที่เป็นกำลังสำคัญของประเทศ แต่เมื่อพวกเขาไม่มีทางเลือก ต้องจับอาวุธสู้กับรัฐบาล</p>\n<p>และเมื่อพลเอกเปรมเข้าสู่เก้าอี้ผู้นำประเทศได้ไม่นาน  ป๋าเปรมได้นำเอกสารคำสั่ง 66/2523 เข้าสู่ที่ประชุมสภาความมั่นคงแห่งชาติ เปิดโอกาสให้วิจารณ์ได้ ซึ่งที่ประชุมส่วนใหญ่เห็นชอบว่าเป็นแนวทางที่จะยุติสงครามกลางเมืองได้ แม้จะถูกต่อต้านอย่างหนักหน่วงจากนายทหารสายเหยี่ยวจำนวนมากในตอนนั้น</p>\n<p>หลักการเหล่านี้ ต้องยอมรับว่ามีความก้าวหน้ามาก ทำให้สองปีผ่านไป นโยบาย 66/23 ได้ทำให้เกิดสภาพ “ป่าแตก” เกิดสภาพ“ทหารป่าคืนเมือง” มีผู้คนออกจากป่าหลายพันคนมามอบตัวอย่างไม่ผิดกฎหมาย ในนามผู้ร่วมพัฒนาชาติไทย จนได้ทำให้พรรคคอมมิวนิสต์แห่งประเทศไทยต้องประกาศยุติสงครามในที่สุด ( ไม่นับสาเหตุอื่น อาทิ เกิดความขัดแย้งของแกนนำในพรรคฯ และพรรคคอมมิวนิสต์จีนที่เคยให้ความสนับสนุนได้ลดความช่วยเหลือลงด้วย)</p>\n<p>เหตุการณ์ในอดีตเมื่อสี่สิบปีก่อนนั้น แสดงถึงกึ๋นของนายทหารสายพิราบ หน่วยงานความมั่นคงฯ ที่ทำงานแบบมืออาชีพ เมื่อเห็นความแตกแยกของประเทศครั้งใหญ่ พวกเขาสุมหัวกันคิด และกล้านำเสนอยุทธศาสตร์ใหม่ตามแนวทาง “การเมืองนำการทหาร” แม้จะได้รับการต่อต้านอย่างหนักจากบรรดานายพลสายเหยี่ยว</p>\n<p>นายทหารเหล่านี้ล้วนแต่เคยอยู่แนวหน้า ลงพื้นที่เสี่ยงตายท่ามกลางการสู้รบ แต่สุดท้ายพวกเขาทราบดีว่า ยิ่งรบก็ยิ่งพัง และที่สำคัญคือเขาไม่ได้มองพี่น้องประชาชนที่คิดต่างเป็นศัตรู</p></blockquote>\n<p>ทั้งสองโพสต์มีความเหมือนกันในเรื่องของการวิเคราะห์สถานการณ์ (ตามข้อแรกของ Rumelt) ว่าต้องมองสถานการณ์ให้ถูกต้องกับความเป็นจริงซะก่อน ซึ่งในทางปฏิบัติก็ไม่ง่ายนัก เพราะว่าคำว่า &#8220;จริง&#8221; มันลื่นไหล จริงของเรากับจริงของเขามันไม่เหมือนกัน</p>\n<p>แต่หากมีความกล้าหาญที่จะพูดในความจริงที่ไม่อยากฟัง (inconvenient truth) เป็นจุดเริ่มต้นแล้ว กระบวนการถกเถียงเพื่อให้การวิเคราะห์ใกล้เคียงกับความจริงที่สุด ก็ไม่น่าใช่เรื่องยากจนเกินไปนัก</p>The post <a href=\"https://markpeak.net/on-strategy/\">On Strategy</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"8c40480243b8cce3d33b98cdcf4681db2e4ea1b75cc9595f9935ee97eb2aafb3","category":"Thai"}