{"title":"Zdenek Stybar will race at Cyclocross Worlds: Daily News Digest","link":"https://cyclingtips.com/2021/01/zdenek-stybar-will-race-at-cyclocross-worlds-daily-news-digest/","date":1611618387000,"content":"<p>Hello again, CyclingTips readers,</p>\n\n\n\n<p>We head into the new week with news that three-time cyclocross world champ Zdenek Stybar is planning to return to CX Worlds for the first time since 2014, news that Movistar is forming an E-Team, and an update from the Richard Freeman medical tribunal, among other news items.</p>\n\n\n\n<p>Read on for the latest from the cycling world.</p>\n\n\n\n<p><em>Dane Cash<br>News Editor</em></p>\n\n\n\n<h2>What&#8217;s news?</h2>\n\n\n\n<h3>Stybar plans to race Cyclocross Worlds</h3>\n\n\n\n<p>Zdenek Stybar plans to race at the Cyclocross World Championships in Ostend, Belgium, on Sunday in what will be a first CX Worlds appearance for the three-time world champion since 2014.</p>\n\n\n\n<p>&#8220;It was not expected that I would ride the Worlds this year, but things have evolved. As we know this discipline is my passion, so after watching some races on television I felt in my stomach that I really wanted to race,&#8221; Stybar said.</p>\n\n\n\n<p>&#8220;It would not have normally fit in to my schedule, but things have changed and having done a lot of training my condition feels good. I weighed up my options and discussed it with [Deceuninck-QuickStep manager] Patrick Lefevere, as well the team’s management, and I am very grateful to have received the team’s support. So, from there I started the process of preparing the materials and decided that I will go for it.”</p>\n\n\n\n<h3>Movistar on the hunt for talent for E-Team</h3>\n\n\n\n<p>Movistar is forming an e-racing squad and will be <a href=\"https://cyclingtips.com/2021/01/team-movistar-searching-for-10-riders-to-form-a-new-e-sports-team/\" target=\"_blank\" rel=\"noreferrer noopener\">looking for talent</a> through Zwift.</p>\n\n\n\n<p>The team is looking to add five men and five women for its newly announced e-racing lineup. The talent identification process will take the form of a competition called the &#8220;Movistar Team Challenge.&#8221; 300 riders have been invited to participate, and anyone can qualify through qualifiers held on February 3. You can find out more about the qualifiers <a href=\"https://news.zwift.com/en-WW/195973-do-you-have-what-it-takes-your-chance-to-race-for-the-new-movistar-e-team-awaits\" target=\"_blank\" rel=\"noreferrer noopener\">here</a>.</p>\n\n\n\n<h3>Medical tribunal told that Freeman ordered testosterone &#8216;to dope a rider&#8217; in closing argument</h3>\n\n\n\n<p>The lawyer for the General Medical Council (GMC) made its case against former British Cycling and Sky doctor Richard Freeman on Monday in a <a rel=\"noreferrer noopener\" href=\"https://cyclingtips.com/2021/01/closing-argument-tribunal-is-told-that-freeman-ordered-testosterone-to-dope-a-rider/\" target=\"_blank\">closing argument</a> at the tribunal assessing Freeman&#8217;s fitness to practice medicine. Freeman is accused of having ordered testosterone to British Cycling headquarters in 2011 &#8220;knowing or believing&#8221; that it was for an athlete. His defense has argued that he acquired the testosterone for former Sky and British Cycling coach Shane Sutton to treat erectile dysfunction.</p>\n\n\n\n<p>Simon Jackson, representing the GMC, said that &#8220;the only logical and proper conclusion&#8221; one could draw from the evidence was that Freeman had ordered the testosterone to help a rider a dope, according to <a rel=\"noreferrer noopener\" href=\"https://www.theguardian.com/sport/2021/jan/25/dr-freeman-worked-with-sleepers-when-buying-testogel-tribunal-told\" target=\"_blank\">The Guardian</a>.</p>\n\n\n\n<p>&#8220;I underline that Team Sky and British Cycling were not aware of this but there were sleepers, there were dopers in the past who were within these organizations, when Dr Freeman was acquiring the Testogel,&#8221; Jackson said, The Guardian reports.</p>\n\n\n\n<p>“They had doped before. And so these aren’t bold allegations in the sense they are unsubstantiated. The GMC has been able to pull all these strands together. The only reasonable conclusions are they weren’t clinically indicated but they were used to dope a rider.”</p>\n\n\n\n<p>Freeman&#8217;s lawyer Mary O&#8217;Rourke will begin making her closing argument on Tuesday when the tribunal resumes.</p>\n\n\n\n<h3>No Cyclocross Worlds for Aru</h3>\n\n\n\n<p>Returning to CX Worlds start list news, Fabio Aru won&#8217;t be taking on the event despite having expressed interest in doing so after making a few cyclocross starts this season. In a video posted on Twitter, Aru said that he wouldn&#8217;t be making the start after talking with national coach Fausto Scotti.</p>\n\n\n\n<p>&#8220;It’s only right to leave the space to the specialists and young riders who have dedicated so much time to this discipline,&#8221; Aru said. The 30-year-old Italian thanked the cyclocross world for having welcomed him and thanked Qhubeka-Assos for giving him the chance to branch out, and said that he was now at training camp with the team and looking ahead to the road season.</p>\n\n\n\n<h3>Former pro Gins says she was denied DS job with Belgian U23 team due to photos</h3>\n\n\n\n<p>Former pro Tara Gins has told <a href=\"https://www.cyclingnews.com/features/tara-gins-denied-management-role-due-to-previous-modeling-photoshoots/\" target=\"_blank\" rel=\"noreferrer noopener\">Cyclingnews</a> that a job offer she had to be a sport director for a Belgian under-23 team was withdrawn due to modeling photos previously taken of her.</p>\n\n\n\n<p>Gins said that she had a verbal agreement to join a club team for U23 riders as a sport director, but that the team had broken the agreement after a team staffer saw photos of her from either a Playboy photoshoot or a calendar photoshoot, which were taken in 2020. Gins said that a verbal agreement had been in place since November but that she was told on Saturday that she would not be a director with the team.</p>\n\n\n\n<p>&#8220;There are so many women who want a position in men’s cycling, or in cycling in general, and they have the capabilities to do it but they don’t advance because of idiotic things like this,&#8221; Gins said, according to Cyclingnews.</p>\n\n\n\n<p>&#8220;To make the issue more known that these things are still happening and to be more aware of it. There are women who are capable of being directors at a men’s team, but it’s very hard to get a chance anywhere.&#8221;</p>\n\n\n\n<h2>In case you missed it&#8230;</h2>\n\n\n\n<h3>Trek Domane AL Disc 4 review: An astounding and affordable all-roader</h3>\n\n\n\n<p>Dave Rome has the review of <a href=\"https://cyclingtips.com/2021/01/trek-domane-al-disc-4-review/\" target=\"_blank\" rel=\"noreferrer noopener\">Trek&#8217;s Domane AL Disc 4</a>.</p>\n\n\n\n<h3>&#8216;COVID-free&#8217; Turkmenistan to vaccinate riders against virus it won&#8217;t acknowledge</h3>\n\n\n\n<p>Iain Treloar has the latest on <a href=\"https://cyclingtips.com/2021/01/covid-free-turkmenistan-to-vaccinate-riders-against-virus-it-wont-acknowledge/\" target=\"_blank\" rel=\"noreferrer noopener\">Turkmenistan&#8217;s plans to vaccinate riders</a> ahead of the 2021 Track Cycling World Championships.</p>\n\n\n\n<h3>From the Top: How 7Mesh was built</h3>\n\n\n\n<p>Wade Wallace caught up with the founders of 7Mesh in the <a href=\"https://cyclingtips.com/2021/01/from-the-top-how-7mesh-was-built/\" target=\"_blank\" rel=\"noreferrer noopener\">latest episode of From the Top</a>.</p>\n\n\n\n<h3>Sorry Taya, your new Rollerless chain isn&#8217;t an innovation</h3>\n\n\n\n<p>Dave Rome looked into some of the claims that Taya made about its <a href=\"https://cyclingtips.com/2021/01/taya-new-rollerless-chain-isnt-an-innovation/\" target=\"_blank\" rel=\"noreferrer noopener\">Rollerless chains</a>.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cyclingtips.com/2021/01/zdenek-stybar-will-race-at-cyclocross-worlds-daily-news-digest/\">Zdenek Stybar will race at Cyclocross Worlds: Daily News Digest</a> appeared first on <a rel=\"nofollow\" href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"8cc97d00387e7a4df796012398463a3f0ec24b5b7f927505694e09387420c4ff","category":"Cycling"}