{"title":"AWS Audit Manager Simplifies Audit Preparation","link":"https://aws.amazon.com/blogs/aws/aws-audit-manager-simplifies-audit-preparation/","date":1607450627000,"content":"<p>Gathering evidence in a timely manner to support an audit can be a significant challenge due to manual, error-prone, and sometimes, distributed processes. If your business is subject to compliance requirements, preparing for an audit can cause significant lost productivity and disruption as a result. You might also have trouble applying traditional audit practices, which were originally designed for legacy on-premises systems, to your cloud infrastructure.<strong><br /> </strong></p> \n<p>To satisfy complex and evolving sets of regulation and compliance standards, including the General Data Protection Regulation (GDPR), Health Insurance Portability and Accountability Act (HIPAA), and Payment Card Industry Data Security Standard (PCI DSS), you’ll need to gather, verify, and synthesize evidence.</p> \n<p>You’ll also need to constantly reevaluate how your <a href=\"https://aws.amazon.com/\" title=\"\">AWS</a> usage maps to those evolving compliance control requirements. To satisfy requirements you may need to show data encryption was active, and log files showing server configuration changes, diagrams showing application high availability, transcripts showing required training was completed, spreadsheets showing that software usage did not exceed licensed amounts, and more. This effort, sometimes involving dozens of staff and consultants, can last several weeks.</p> \n<p>Available today, <a href=\"https://aws.amazon.com/audit-manager/\" title=\"AWS Audit Manager\">AWS Audit Manager</a> is a fully managed service that provides prebuilt frameworks for common industry standards and regulations, and automates the continual collection of evidence to help you in preparing for an audit. Continuous and automated gathering of evidence related to your <a href=\"https://aws.amazon.com/\" title=\"\">AWS</a> resource usage helps simplify risk assessment and compliance with regulations and industry standards and helps you maintain a continuous, audit-ready posture to provide a faster, less disruptive preparation process.</p> \n<p>Built-in and customizable frameworks map usage of your cloud resources to controls for different compliance standards, translating evidence into an audit-ready, immutable assessment report using auditor-friendly terminology. You can also search, filter, and upload additional evidence to include in the final assessment, such as details of on-premises infrastructure, or procedures such as business continuity plans, training transcripts, and policy documents.</p> \n<p>Given that audit preparation typically involves multiple teams, a delegation workflow feature lets you assign controls to subject-matter experts for review. For example, you might delegate reviewing evidence of network security to a network security engineer.</p> \n<p>The finalized assessment report includes summary statistics and a folder containing all the evidence files, organized in accordance with the exact structure of the associated compliance framework. With the evidence collected and organized into a single location, it’s ready for immediate review, making it easier for audit teams to verify the evidence, answer questions, and add remediation plans.</p> \n<p><span style=\"text-decoration: underline;\"><strong>Getting started with <span title=\"\">Audit Manager</span></strong></span><br /> Let’s get started by creating and configuring a new assessment. From <span title=\"\">Audit Manager</span>‘s console home page, clicking <strong>Launch AWS Audit Manager</strong> takes me to my <strong>Assessments</strong> list (I can also reach here from the navigation toolbar to the left of the console home). There, I click <strong>Create assessment</strong> to start a wizard that walks me through the settings for the new assessment. First, I give my assessment a name, optional description, and then specify an <a href=\"https://aws.amazon.com/s3/\" title=\"\">Amazon Simple Storage Service (S3)</a> bucket where the reports associated with the assessment will be stored.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2020/12/02/new-assessment-1.png\"><img class=\"size-full wp-image-45028 aligncenter\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2020/12/02/new-assessment-1.png\" alt=\"\" width=\"900\" height=\"624\" /></a>Next, I choose the framework for my assessment. I can select from a variety of prebuilt frameworks, or a custom framework I have created myself. Custom frameworks can be created from scratch or based on an existing framework. Here, I’m going to use the prebuilt <strong>PCI DSS</strong> framework.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2020/12/08/new-assessment-2-1.png\"><img class=\"wp-image-45389 size-full aligncenter\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2020/12/08/new-assessment-2-1.png\" alt=\"Screenshot of framework selection\" width=\"864\" height=\"1077\" /></a>After clicking <strong>Next</strong>, I can select the <a href=\"https://aws.amazon.com/\" title=\"\">AWS</a> accounts to be included in my assessment (<span title=\"\">Audit Manager</span> is also integrated with <a href=\"https://aws.amazon.com/organizations/\" title=\"\">AWS Organizations</a>). Since I have a single account, I select it and click <strong>Next</strong>, moving on to select the <a href=\"https://aws.amazon.com/\" title=\"\">AWS</a> services that I want to be included in evidence gathering. I’m going to include all the suggested services (the default) and click <strong>Next</strong> to continue.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2020/12/02/new-assessment-3.png\"><img class=\"wp-image-45030 size-full aligncenter\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2020/12/02/new-assessment-3.png\" alt=\"Screenshot of service selection for assessment\" width=\"900\" height=\"539\" /></a>Next I need to select the owners of the assessment, who have full permission to manage it (owners can be <a href=\"https://aws.amazon.com/iam/\" title=\"\">AWS Identity and Access Management (IAM)</a> users or roles). You must select at least one owner, so I select my account and click <strong>Next</strong> to move to the final <strong>Review and create</strong> page. Finally, clicking <strong>Create assessment</strong> starts the gathering of evidence for my new assessment. This can take a while to complete, so I’m going to switch to another assessment to examine what kinds of evidence I can view and choose to include in my assessment report.</p> \n<p>Back in the <strong>Assessments</strong> list view, clicking on the assessment name takes me to details of the assessment, a summary of the controls for which evidence is being collected, and a list of the control sets into which the controls are grouped. <strong>Total evidence</strong> tells me the number of events and supporting documents that are included in the assessment. The additional tabs can be used to give me insight into the evidence I select for the final report, which accounts and services are included in the assessment, who owns it, and more. I can also navigate to the <span title=\"\">S3</span> bucket in which the evidence is being collected.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2020/12/02/assessment_home.png\"><img class=\"wp-image-45042 size-full aligncenter\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2020/12/02/assessment_home.png\" alt=\"Screenshot of assessment home page\" width=\"899\" height=\"610\" /></a>Expanding a control set shows me the related controls, with links to dive deeper on a given control, together with the status (<strong>Under review</strong>, <strong>Reviewed</strong>, and <strong>Inactive</strong>), whom the control has been delegated to for review, the amount of evidence gathered for that control, and whether the control and evidence have been added to the final report. If I change a control to be Inactive, meaning automated evidence gathering will cease for that control, this is logged.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2020/11/30/assessment_control.png\"><img class=\"size-full wp-image-44758 aligncenter\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2020/11/30/assessment_control.png\" alt=\"Screenshot of assessment control\" width=\"900\" height=\"244\" /></a>Let’s take a closer look at a control to show how the automated evidence gathering can help identify compliance issues before I start compiling the audit report. Expanding&nbsp;<strong>Default control set</strong>, I click control&nbsp;<strong>8.1.2 For a sample of privileged user IDs…</strong> which takes me to a view giving more detailed information on the control and how it is tested. Scrolling down, there is a set of evidence folders listed and here I notice that there are some issues. Clicking the issue link in the&nbsp;<strong>Compliance check</strong> column summarizes where the data came from. Here, I can also select the evidence that I want included in my final report.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2020/11/30/control_issues_source.png\"><img class=\"size-full wp-image-44759 aligncenter\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2020/11/30/control_issues_source.png\" alt=\"Screenshot of issue summary\" width=\"879\" height=\"237\" /></a>Going further, I can click on the evidence folder to note that there was a failure, and in turn clicking on the time of the failure takes me to a detailed summary of the issues for this control, and how to remediate.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2020/12/03/control_issue_evidence.png\"><img class=\"wp-image-45285 size-full aligncenter\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2020/12/03/control_issue_evidence.png\" alt=\"Screenshot of evidence for a control\" width=\"900\" height=\"506\" /></a><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2020/11/30/control_issue_evidence_detail.png\"><img class=\"size-full wp-image-44761 aligncenter\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2020/11/30/control_issue_evidence_detail.png\" alt=\"Screenshot of evidence detail\" width=\"900\" height=\"645\" /></a>With the evidence gathered, it’s a simple task to select sufficient controls and appropriate evidence to include in my assessment report that can then be passed to my auditors. For the purposes of this post I’ve gone ahead and selected evidence for a handful of controls into my report. Then, I selected the <strong>Assessment report selection</strong> tab, where I review my evidence selections, and clicked <strong>Generate assessment report</strong>. In the dialog that appeared I gave my report a name, and then clicked <strong>Generate assessment report</strong>. When the dialog closes I am taken to the <strong>Assessment reports</strong> view and, when my report is ready, I can select it and download a zip file containing the report and the selected evidence. Alternatively, I can open the <span title=\"\">S3</span> bucket associated with the assessment (from the assessment’s details page) and view the report details and evidence there, as shown in the screenshot below. The overall report is listed (as a PDF file) and if I drill into the evidence folders, I can also view PDF files related to the specific items of evidence I selected.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2020/12/02/assessment_report_objects.png\"><img class=\"size-full wp-image-45050 aligncenter\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2020/12/02/assessment_report_objects.png\" alt=\"Screenshot of assessment report output in S3\" width=\"900\" height=\"563\" /></a>And to close, below is a screenshot of the beginning of the assessment report PDF file showing the number of selected controls and evidence, and services that I selected to be in scope when I created the assessment. Further pages go into more details.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2020/12/04/assessment_report_preface-1.png\"><img class=\"wp-image-45310 size-full aligncenter\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2020/12/04/assessment_report_preface-1.png\" alt=\"Screenshot of assessment report\" width=\"899\" height=\"493\" /></a><strong><span title=\"\">Audit Manager</span> is available today in 10 <a href=\"https://aws.amazon.com/\" title=\"\">AWS</a> Regions:</strong> US East (Northern Virginia, Ohio), US West (Northern California, Oregon), Asia Pacific (Singapore, Sydney, Tokyo), and Europe (Frankfurt, Ireland, London).</p> \n<p><strong>Get all the details about <a href=\"https://aws.amazon.com/audit-manager/\" title=\"AWS Audit Manager\">AWS Audit Manager</a> and get started today.</strong></p> \n<a href=\"https://twitter.com/bellevuesteve\" title=\"Steve on Twitter\">— Steve</a>","author":"Steve Roberts","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"8d596ff7941e754b6fc00fcffbe354a8120197f050afd97f49a2ea4a9d3f2817","category":"Tech"}