{"title":"Is it au revoir to the yellow Mavic neutral service car?","link":"https://www.cyclist.co.uk/news/9128/is-it-au-revoir-to-the-yellow-mavic-neutral-service-car","date":1611049143000,"content":"<span class=\"field field-name-field-author field-type-node-reference field-label-hidden\">\n      <span class=\"field-item even\"><a href=\"/authors/joe-robinson\">Joe Robinson</a></span>\n  </span><div class=\"field field-name-field-published-date field-type-datetime field-label-hidden\">  \n  <div class=\"field-items\">      <div class=\"field-item even\"><span class=\"date-display-single\" property=\"dc:date\" datatype=\"xsd:dateTime\" content=\"2021-01-19T10:06:00+00:00\">19 Jan 2021</span></div>    </div></div><p class=\"short-teaser\">\nComponent brand Shimano takes on duty of Tour de France neutral service</p>\n<div class=\"primary-image\">\n      <img typeof=\"foaf:Image\" src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/1/97/mavic_bikes_0.jpg?itok=SwjBY3U1\" alt=\"Mavic bike\" title=\"Mavic bike\" />  </div>\n<div class=\"field field-name-body\">\n      <p> The iconic yellow Mavic neutral service car will be absent from the <a href=\"/tags/tour-de-france\">Tour de France</a> this year for the first time since 1977. It comes as Japanese component giant Shimano has cut a deal with Tour organiser ASO to take on the noble duty.</p>\n<p>The agreement will also see Shimano continue its neutral service duties at the Vuelta a Espana, <a href=\"/tags/paris-roubaix\">Paris-Roubaix</a>, Liege-Bastogne-Liege, Fleche Wallonne, Paris-Tours and amateur events L'Etape du Tour and Roc d'Azur. Shimano will start its neutral service offerings for 2021 at Paris-Nice in March.</p>\n<p>With Shimano stepping up to the role of neutral service at this summer's Tour, it appears it is curtains for Mavic and its iconic yellow neutral service car.</p>\n<p>First used at the 1973 Paris-Nice, the Mavic neutral service car made its Tour debut in 1977, offering spare wheels and bikes to get stranded riders going again.</p>\n<p>It seems, however, that after a tumultuous 12 months in which the company was placed into receivership <a href=\"/news/8487/mavic-saved-as-new-owners-are-confirmed\">before being bought out by French investment firm</a> the Bourrelier Group, the brand has lost its spot in the Tour peloton to Shimano.</p>\n<p>In the announcement of the deal with Shimano, managing director of Amaury Sport Organisation Yann Le Moenner neglected to mention Mavic, instead praising Shimano for its extended partnership.</p>\n<p>'We are incredibly pleased to have extended our partnership with a player as innovative as Shimano. Partnering up on all of our professional and amateur cycling events with a family business and pioneer in the cycling world testifies to our commitment to offering excellent support to athletes as well as all of the cyclists involved in our events,' said Le Moenner.</p>\n<p>'The innovation and consistent level of excellence provided by the brand over its 100 years of existence make Shimano a crucial player in world and everyday cycling and a brand that we are proud to be associated with.'</p>\n<div class=\"field field-name-field-see-related field-type-node-reference field-label-above\">      <div class=\"field-label\">See related&nbsp;</div>\n  \n  <div class=\"field-items\">      <div class=\"field-item even\"><a href=\"/buying-guides/3865/buyers-guide-best-bicycle-mudguards\">Best bicycle mudguards for winter 2021: protect your bike </a></div>      <div class=\"field-item odd\"><a href=\"/buying-guides/2079/best-winter-gloves-for-cycling\">Best cycling gloves for winter 2021</a></div>      <div class=\"field-item even\"><a href=\"/buying-guides/7925/turbo-training-accessories-everything-you-need-for-training-indoors\">Turbo training accessories: Everything you need for training indoors</a></div>    </div></div><p>\nIn the year that Shimano celebrates its 100th birthday, vice president Taizo Shimano understandably heralded the partnership saying: 'We are proud to announce a partnership to support the ASO’s events with neutral support. That means we will be providing first-class support to riders at ASO events to get them back on the road and back in the race.</p>\n<p>'Working with ASO will allow Shimano to provide more support to the sport and more support to athletes to help them perform at the top level. As a company, we take great pride in the quality of work that the thousands of global Shimano dealers carry out. This partnership with ASO is the best example of the service that they provide.</p>\n<p>'Not only do we hope this partnership will inspire a new generation of people to ride their bikes more often, but we hope to inspire people to trust in our product quality.' </p>\n  </div>\n<div class=\"field field-name-field-category-primary field-type-taxonomy-term-reference field-label-hidden\">  \n  <div class=\"field-items\">      <div class=\"field-item even\"><a href=\"/general-news\" typeof=\"skos:Concept\" property=\"rdfs:label skos:prefLabel\" datatype=\"\">General news</a></div>    </div></div>","author":"jrobinson","siteTitle":"Featured Articles","siteHash":"f129cda89106022134374fa071789f236ffc24ddd29b6bf4220b1143ee6f092f","entryHash":"9150388ec273295a5577c881e170e2db0243a70d3e61677edaac1a4b2d531012","category":"Cycling"}