{"title":"Suunto Movescount Begins Final Shutdown on Tuesday","link":"https://www.dcrainmaker.com/2021/01/suunto-movescount-begins-final-shutdown-on-tuesday.html","date":1611147632000,"content":"<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/01/image-35.png\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"image\" src=\"https://media.dcrainmaker.com/images/2021/01/image_thumb-32.png\" alt=\"image\" width=\"702\" height=\"326\" border=\"0\" /></a></p>\n<p>There are few sports tech stories that have longer plot lines than a Netflix series – but the turndown of Suunto’s once flagship online platform is giving Game of Thrones a run for its money. But, to quote <span style=\"text-decoration: line-through;\">arguably</span> factually the best movie series ever made: <a href=\"https://www.youtube.com/watch?v=Jdf5EXo6I68\">I’m not dead [yet]</a>!</p>\n<p>As you may remember in my <a href=\"https://www.dcrainmaker.com/2019/01/suunto-announces-decommission-plans-for-movescount-platform-impacting-some-watches.html\">occasional</a> <a href=\"https://www.dcrainmaker.com/2019/11/mid-week-tidbits-canyon-supports-trainer-riding-and-suunto-clarifies-platform-future.html#suunto-provides-movescount-web-app-direction-update\">coverage</a> of this series, we last left off <a href=\"https://www.dcrainmaker.com/2020/09/suunto-announces-final-steps-for-movescount-transition-not-all-bad-news.html\">back in September</a> when Suunto updated that they’d be starting shutdown sequences within two weeks. However, that launch didn’t happen. They pulled out their 2020 card and decided then was not the time. Instead, like the rest of the world – 2021 was when the party would start.</p>\n<p>And thus, we find ourselves steamrolling towards Tuesday, January 26th, where in a confirmation e-mail sent out this morning the first of a series of turn-offs will truly begin. Probably. According to a page I stumbled on <a href=\"https://www.suunto.com/fy-nl/Content-pages/suuntos-digital-services/\">earlier this week</a>*, starting this upcoming Tuesday the Suunto 9 and Spartan series web and app features will be closed. Though, your training data remains accessible. In addition, for Ambit3 and Traverse users, the Movescount app closes off too.</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/01/image-36.png\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"image\" src=\"https://media.dcrainmaker.com/images/2021/01/image_thumb-33.png\" alt=\"image\" width=\"722\" height=\"150\" border=\"0\" /></a></p>\n<p><em>(*Fun fact: I stumbled on this page purely by accident while trying to find a way to create routes with GPS waypoints exported in the files, for <a href=\"https://www.dcrainmaker.com/2021/01/coros-rolls-out-update-adding-waypoint-navigation-hands-on.html\">my COROS navigation post</a>. Suunto Movescount was literally the only platform that managed to do it mostly correctly. A shade of irony that I had to use Suunto’s page to demonstrate a COROS feature for a watch that’s slowly taking market share from Suunto.)</em></p>\n<p>The definition of ‘closed’ is a little fuzzy to me, but I presume that means you can’t create new things – like routes, or upload workouts to it.</p>\n<p>In any case, then two weeks later on Tuesday, February 9th, 2021, Suunto will join other <a href=\"https://www.on-this-day.com/onthisday/thedays/alldays/feb09.htm\">famous events in February 9th history</a>, by ending sync from the Ambit and Traverse series watch to Movescount. In case you were wondering, other famous Feb 9th events include The Simpsons becoming the longest-running prime-time animated series, and the first flight of the Boeing 747. Both the Simpsons and the Boeing 747 are still going (mostly) strong.</p>\n<p>The good news though is your watch doesn’t die. Instead, it just connects to a different platform with less features. But again, it’s not dead. At the bottom of that earlier linked page (not the Simpsons one, <a href=\"https://www.suunto.com/en-us/Content-pages/suuntos-digital-services/\">this one</a>), they allow you to click on which watch you have, and then it’ll show you the steps for linking it up to the Suunto App and associated backend platform that’s <a href=\"https://www.suunto.com/en-us/Support/faq-articles/suunto-app/what-is-sports-tracker-and-why-do-i-see-it-in-suunto-app2/\">powered by what used to be Sports Tracker</a>.</p>\n<p><a href=\"https://www.suunto.com/en-us/Content-pages/suuntos-digital-services/\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"image\" src=\"https://media.dcrainmaker.com/images/2021/01/image-37.png\" alt=\"image\" width=\"722\" height=\"155\" border=\"0\" /></a></p>\n<p>Plus, if you’ve got an older Spartan, Ambit, Ambit 2, Ambit 3, or Traverse watch – they’re still offering that 30% discount to upgrade to a newer Suunto watch, including the Suunto 7. Though, the 30% discount is less than the 40%+ discount offered by retailers over the holiday, and only 5% more than the 25% discount currently offered by retailers. Suunto’s fine print says it could take 2-4 weeks to get the discount. Amazon says it can deliver me another <a href=\"https://amzn.to/3p2WYvl\">Suunto 7 tomorrow morning with the 25% discount</a> (if I order in the next 3 hours and 23 minutes). But you do you!</p>\n<p>In any case, I don’t know if this will be the end of this Movescount mini-series or not. But, I will give Suunto credit that while the new Suunto App isn’t the analytic rich environment that Movescount was, it’s certainly far more mobile-friendly, and does have newer features that the older Suunto platform doesn’t have – such as the Strava-like route creation tools to find and create popular routes, a <a href=\"https://www.dcrainmaker.com/2020/08/suunto-rolls-out-new-popular-routes-starting-points-app-features.html\">feature I tested this past summer</a>.</p>\n<p>With that – thanks for reading!</p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"91afac8d3c3b6abcb7de6145811e2ac0bcce171e3a26f45047018a545e993f8b","category":"Cycling"}