{"title":"★ Facebook: Free as in Bullshit","link":"https://daringfireball.net/2020/12/facebook_free_as_in_bullshit","date":1608333797000,"content":"\n<p>Facebook’s second full-page newspaper ad attacking Apple, helpfully transcribed (and photographed) <a href=\"https://www.macrumors.com/2020/12/17/facebook-runs-apple-vs-free-internet-ad/\">by MacRumors</a>:</p>\n\n<blockquote>\n  <p>Apple vs. the free internet</p>\n\n<p>Apple plans to roll out a forced software update that will change\nthe internet as we know it — for the worse.</p>\n\n<p>Take your favorite cooking sites or sports blogs. Most are free\nbecause they show advertisements.</p>\n</blockquote>\n\n<p>It’s an unfortunate quirk of the English language that <em>free as in freedom</em> and <em>free as in beer</em> are very different meanings of <em>free</em>. But when you see an ad headlined “Apple vs. The Free Internet”, most people would assume they’re about to hear an argument about <em>free as in freedom</em>.</p>\n\n<p>Not Facebook. They’re arguing about <em>free as in beer</em>. I mean, they’re alleging that Apple is taking away freedom — the freedom of small business advertisers to benefit from unrestricted tracking for ad targeting — but their argument to the public is that such privacy initiatives will cost users their free beer.</p>\n\n<p>There’s nothing “forced” about the software update Facebook is talking about either, which, I think, is going to be iOS 14.4. It’s actually quite interesting that Apple does not force software updates, or perform them in a hard-to-disable-or-detect manner. What’s “forced” isn’t the software update, but Facebook’s compliance with new rules that they wish they could ignore.</p>\n\n<blockquote>\n  <p>Apple’s change will limit their ability to run personalized ads.\nTo make ends meet, many will have to start charging you\nsubscription fees or adding more in-app purchases, making the\ninternet much more expensive and reducing high-quality free\ncontent.</p>\n</blockquote>\n\n<p>Are we talking about apps or websites? This is a very short ad — I haven’t omitted a word in my blockquoted text — but it suddenly veers from “cooking sites or sports blogs” to “in-app purchases” without explaining how it got there.</p>\n\n<p>Apple clearly has no control over anything related to the advertising on websites, other than whatever privacy controls are built into Safari. Apple isn’t limiting the ability of <em>apps</em> on iOS to show personalized ads, either. They’re also not limiting the ability of ad-tracking technology to track users. What they’re doing is giving users awareness of and control over that tracking. In broad terms, changing tracking from opt-out to opt-in.</p>\n\n<p>This may well result in diminishing the effectiveness of personalized advertising. <a href=\"https://daringfireball.net/2020/09/online_privacy_real_world_privacy\">If so, so be it</a>. Facebook’s argument is along the lines of arguing that the police shouldn’t crack down on burglaries because doing so might hurt pawn shops that have been thriving during a years-long crime spree. The information used for tracking belongs to the users whose behavior and interests is being tracked, not to Facebook and the companies, no matter how small and noble, who advertise with them.</p>\n\n<p><em>No fair!</em> claims the company objecting to blinds being installed on windows it had long peered through unhindered.</p>\n\n<blockquote>\n  <p>Beyond hurting apps and websites, many in the small business\ncommunity say this change will be devastating for them too, at a\ntime when they face enormous challenges. They need to be able to\neffectively reach the people most interested in their products and\nservices to grow.</p>\n</blockquote>\n\n<p>Here come the pandemic waterworks. How dare Apple institute improved privacy controls during a severe recession. Boo-fucking-hoo. I do give some credit to Facebook for putting it so plainly that they’re claiming they need to invade our privacy without our awareness or permission.</p>\n\n<blockquote>\n  <p>Forty-four percent of small to medium businesses started or\nincreased their usage of personalized ads on social media during\nthe pandemic, according to a new Deloitte study. Without\npersonalized ads, Facebook data shows that the average small\nbusiness advertiser stands to see a cut of over 60% in their sales\nfor every dollar they spend.</p>\n</blockquote>\n\n<p>Well if Facebook says so, it must be true. If only anyone could remember a time when advertising wasn’t based on privacy-invasive tracking, we could know whether there were any successful small businesses back then.</p>\n\n<p>This whole ad reads more like an ad <em>for</em> Apple’s privacy initiatives than against them. Apple’s response to this campaign is simply to show the very simple easily-understood opt-in dialog box that Facebook is objecting to. <a href=\"https://twitter.com/MikeIsaac/status/1339350618335428612\">Apple’s entire statement</a>:</p>\n\n<blockquote>\n  <p>We believe that this is a simple matter of standing up for our\nusers. Users should know when their data is being collected and\nshared across other apps and websites — and they should have the\nchoice to allow that or not.</p>\n</blockquote>\n\n<p>It’s illustrated with this example permission dialog:</p>\n\n<p><a href=\"/misc/2020/12/facebook-tracking-example.png\" class=\"noborder\">\n  <img\n    src=\"/misc/2020/12/facebook-tracking-example.png\"\n    alt=\"Example ad tracking permission dialog for Facebook.\"\n  /></a></p>\n\n<p><em>That’s</em> what Facebook is objecting to. Given that their privacy nutrition label <a href=\"https://twitter.com/_inside/status/1339689228549181440\">looks like this</a>, you can almost sympathize.</p>\n\n\n\n    ","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"91b73c81af09f2df0c8e63e18a64f79ad6e14a131b9f93280bb3bb3119738255","category":"Tech"}