{"title":"5 Random Things I Did This Weekend","link":"https://www.dcrainmaker.com/2021/01/5-random-things-i-did-this-weekend-110.html","date":1610975038000,"content":"<p>It’s been a while since a ‘5 Random Things’ post. Not because I haven’t been doing things, but because they’re a bit less random. With everything pretty locked down, our weekend routine is pretty ‘repeatable’ – especially in the winter. So I try not to bore you with what is basically groundhog day on the weekends these days. Still, every once in a while there’s just enough variability to make it interesting. And thus, this weekend.</p>\n<h3><span style=\"font-weight: bold;\">1) Unboxing the Scosche Rhythm 2.0</span></h3>\n<p>Last <a href=\"https://www.dcrainmaker.com/2021/01/scosche-rhythm-2-optical-heart-rate-band-details.html\">week Scosche announced the new Rhythm 2.0</a> optical HR sensor. It made its way across the pond and eventually to the DCR Cave. And by ‘it’, I mean a box full of parts. Multiple units and enough armbands to easily violate the number of adults allowed together, per COVID rules in the Netherlands.</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/01/IMG_6176.jpg\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"IMG_6176\" src=\"https://media.dcrainmaker.com/images/2021/01/IMG_6176_thumb.jpg\" alt=\"IMG_6176\" width=\"720\" height=\"477\" border=\"0\" /></a></p>\n<p>I got it all unboxed. Notably, there are actually two different boxed versions. One for retail stores, and one for Amazon. For Amazon, the box is roughly half the size. That saves on shipping (both cost and environmental aspects), and also saves on shelf space at Amazon, since Amazon charges companies based on the size of the item too.</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/01/IMG_6177.jpg\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"IMG_6177\" src=\"https://media.dcrainmaker.com/images/2021/01/IMG_6177_thumb.jpg\" alt=\"IMG_6177\" width=\"720\" height=\"480\" border=\"0\" /></a></p>\n<p>There was also the new charging case. Basically it’s an 860mAh USB battery pack built into the side of a small case. It charges via USB-C, but has a ‘normal’ USB port inside, so you can plug in the Scosche to it while travelling:</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/01/DSC_2402.jpg\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"DSC_2402\" src=\"https://media.dcrainmaker.com/images/2021/01/DSC_2402_thumb.jpg\" alt=\"DSC_2402\" width=\"355\" height=\"237\" border=\"0\" /></a> <a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/01/DSC_2407.jpg\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"DSC_2407\" src=\"https://media.dcrainmaker.com/images/2021/01/DSC_2407_thumb.jpg\" alt=\"DSC_2407\" width=\"355\" height=\"237\" border=\"0\" /></a></p>\n<p>I’ve already got a few workouts in by now on it, and things are looking pretty good indoors on the bike. But I’ve yet to throw down some outdoor track workouts. Likely tomorrow. As for a full in-depth review, we’ll see on exact timing. Scosche sent a note on Friday that shipping has slipped from February to March. So I’ll probably wait a little bit longer to ensure that the same firmware/hardware that I have now hits you then. Plus, it’ll give me a longer timeframe to validate test results.</p>\n<h3><span style=\"font-weight: bold;\">2) Zwift Friday Night Crashing</span></h3>\n<p>Friday night after the kids went to bed, The Girl and I each jumped on bikes to get workouts in. I headed to the shed on a Tacx NEO 2, while she jumped on the Peloton bike. I decided to do a random race that fit that timeframe – and all started out well:</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/01/IMG_6199.jpg\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"IMG_6199\" src=\"https://media.dcrainmaker.com/images/2021/01/IMG_6199_thumb.jpg\" alt=\"IMG_6199\" width=\"720\" height=\"405\" border=\"0\" /></a></p>\n<p>And by ‘well’, I mean I was dying, because as always I forgot just how hard the starts are, and then spent waaaaay too long trying to catch back up.</p>\n<p>In any case, just after crossing the finish line as the results displayed – Zwift crashed – <a href=\"https://www.dcrainmaker.com/2021/01/stages-adds-ant-bike-lights-support-suunto-7-firmware-update-and-zwift-large-event-update.html\">less than 3 hours after I just wrote a post</a> about Zwift releasing a major update designed to fix Zwift crashes.</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/01/IMG_6207.jpg\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"IMG_6207\" src=\"https://media.dcrainmaker.com/images/2021/01/IMG_6207_thumb.jpg\" alt=\"IMG_6207\" width=\"679\" height=\"452\" border=\"0\" /></a></p>\n<p>This was on a near brand new Apple TV 4K, with the most recent Zwift update that I talked about on Friday – specifically designed to prevent crashing in events (mostly larger events).</p>\n<p>As I <a href=\"https://twitter.com/dcrainmakerblog/status/1350168449234968585\">ranted on Twitter</a>, I get that Zwift will never be able to mitigate every crash on every platform. But Apple TV is literally the easiest platform for them to develop for. There are exactly *TWO* supported models of Apple TV (4K and not-4K), and these models haven’t changed in over 3 years. It’s a QC dream. And yet, I get the feeling that doesn’t happen.</p>\n<p>More than that – my entire post on Friday was about Zwift “finding” an issue with large-scale events in the platform, an issue that has been around seemingly forever that they’ve never bothered to fix.</p>\n<p>Which ultimately gets to the core of my question: Is Zwift doing any crash diag/logging at scale in an automated way. We know they do heavy amounts of logging to <a href=\"https://www.dcrainmaker.com/2020/11/zwift-bans-two-pro-racers-for-altering-data-an-explainer-of-sorts.html\">snag a 19 year old female rider and implicate them in cheating scandals due to pairing the wrong power source</a> – but are they spending any time using that logging to fix real-world crashes?</p>\n<p>It took Zwift less than an hour to reach out after my Twitter post, so hopefully more soon there. While I’m annoyed at another crash, I’m far more interested in understanding what Zwift is doing to mitigate this at scale, and what that looks like at the platform level. Because based on the number of Instagram and Twitter responses, I’m most definitely not alone here. A heck of a lot of you experience crashes (and yes, I know some of you never do). More soon…</p>\n<p><em>(Also, Zwift then froze again Sunday night too, mid-way through my group ride.)</em></p>\n<h3><span style=\"font-weight: bold;\">3) Amsterdam Night Snow Exploring</span></h3>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/01/IMG_6307.jpg\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"IMG_6307\" src=\"https://media.dcrainmaker.com/images/2021/01/IMG_6307_thumb.jpg\" alt=\"IMG_6307\" width=\"720\" height=\"480\" border=\"0\" /></a></p>\n<p>Snow in Amsterdam is actually a fairly rare occurrence. The last time it stuck was three years ago. So when it started snowing Saturday afternoon the first priority was letting our kids enjoy making a snowman and throwing snowballs. Especially since it’s unlikely we’ll be able to travel to any mountains this winter.</p>\n<p>But the second priority after the kids went to bed was to try and get a few photos around the city with the new-fallen snow. So after they were settled, I took the cargo bike out for a bit of exploration. First to a nearby windmill:</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/01/Windmill.jpg\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"Windmill\" src=\"https://media.dcrainmaker.com/images/2021/01/Windmill_thumb.jpg\" alt=\"Windmill\" width=\"720\" height=\"480\" border=\"0\" /></a></p>\n<p>Then from there I just meandered over the course of a few hours through the desolate city.</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/01/AmsterdamCenter.jpg\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"AmsterdamCenter\" src=\"https://media.dcrainmaker.com/images/2021/01/AmsterdamCenter_thumb.jpg\" alt=\"AmsterdamCenter\" width=\"720\" height=\"480\" border=\"0\" /></a></p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/01/AmsterdamCanals.jpg\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"AmsterdamCanals\" src=\"https://media.dcrainmaker.com/images/2021/01/AmsterdamCanals_thumb.jpg\" alt=\"AmsterdamCanals\" width=\"720\" height=\"480\" border=\"0\" /></a></p>\n<p>Eventually my limiter was I didn’t think to bring extra DSLR camera batteries. It’s funny, I so rarely use the ‘real camera’ for anything but product review photography these days. With kids, the iPhone is usually a far better tool because it’s able to capture the exact moments better with live photos and such – things that don’t exist on big cameras. I usually take birthday photos and things like that with the nicer camera, but gone are the days when I’d take boatloads of photos for non-work purposes on fancy cameras. Or maybe it’s just gone are the days of travel. Not sure.</p>\n<p>Either way, it was nice getting a few hours of quiet to take photos.</p>\n<h3><span style=\"font-weight: bold;\">4) Into the forest in search of snow</span></h3>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/01/IMG_6335.jpg\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"IMG_6335\" src=\"https://media.dcrainmaker.com/images/2021/01/IMG_6335_thumb.jpg\" alt=\"IMG_6335\" width=\"720\" height=\"540\" border=\"0\" /></a></p>\n<p>Sunday morning the temps were rising fast, but our kids still (logically) wanted to play in the snow. So we went in search of whatever snow we could find in the forest (Amsterdam Bos). A surprising amount had melted overnight, but we eventually found a few fields that were pretty functional for toddlers to run around and be happy:</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/01/IMG_6336.jpg\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"IMG_6336\" src=\"https://media.dcrainmaker.com/images/2021/01/IMG_6336_thumb.jpg\" alt=\"IMG_6336\" width=\"720\" height=\"540\" border=\"0\" /></a></p>\n<p>Sadly, within a few hours the snow would be all gone. Our snowman at home lasted till later in the day, some <a href=\"https://www.instagram.com/dcrainmaker/\">timestamped pics up on my Instagram Stories</a> feed (which, is where all the action is).</p>\n<h3><span style=\"font-weight: bold;\">5) Peloton DFC Broadcaster</span></h3>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/01/IMG_6429.jpg\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"IMG_6429\" src=\"https://media.dcrainmaker.com/images/2021/01/IMG_6429_thumb.jpg\" alt=\"IMG_6429\" width=\"720\" height=\"480\" border=\"0\" /></a></p>\n<p>Over the last month I’ve been using a <a href=\"https://intelligenate.com/dfc.html\">nifty little Peloton accessory</a> that’s ideal if you want to connect your Garmin or other watch to record your Peloton data, or, if you want to connect Zwift or TrainerRoad to Peloton (or any other app/device). I’ll dive into it more in a separate post, but a few of you asked about it this weekend. It’s called DFC, made by the company Intelligenate. The small red box broadcasts your Peloton power and cadence numbers out over Bluetooth Smart as a standard Bluetooth Smart power meter:</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/01/IMG_6436.jpg\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"IMG_6436\" src=\"https://media.dcrainmaker.com/images/2021/01/IMG_6436_thumb.jpg\" alt=\"IMG_6436\" width=\"720\" height=\"486\" border=\"0\" /></a></p>\n<p>The little red box basically sits in between the 3.5mm cable that connects to the back of your Peloton display. So instead of plugging that 3.5mm headphone-jack style cable from your flywheel into your Peloton display, you plug it into the little red box, and then plug another included cable to the Peloton display. It simply reads the data and transmits it out as a Bluetooth Smart power meter for any other app/device to read/pickup:</p>\n<p>The solution is then powered via the Micro-USB port on your Peloton bike. The great part of this solution is there’s no ‘hacking’ of your Peloton bike or anything. Also, it takes exactly 7 seconds to install and you can just leave it there. Obviously, I could make this look prettier by tidying up the cables a bit. But I’m lazy.  Then, on your watch/app of choice simply scan for the Bluetooth Smart power meter and pair it up. Here it is <a href=\"https://www.dcrainmaker.com/2020/09/garmin-forerunner-745-depth-review.html\">on my FR745</a>:</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/01/IMG_6442.jpg\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"IMG_6442\" src=\"https://media.dcrainmaker.com/images/2021/01/IMG_6442_thumb.jpg\" alt=\"IMG_6442\" width=\"720\" height=\"480\" border=\"0\" /></a></p>\n<p><em>(Obviously, since the Peloton and Garmin refresh/smoothing rates are slightly different, you’ll see the numbers a few units apart while taking a photo. The underlying data though is identical.)</em></p>\n<p>The company is hoping to start taking orders soon, for $99 I think. The plan is for supporting the base Peloton bike initially, but that it’ll ultimately support both Peloton Bike &amp; Bike+. The original Bike is easier to support because everything is analog signals, so it’s super simplistic. Whereas the Bike+ is a bit trickier. I’ll do a full standalone post on the DFC bit with more details once they announce it’s available to buy. Though the TLDR version is it’s been working flawlessly for me.</p>\n<p>&#8212;</p>\n<p>With that – thanks for reading!</p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"9eef8b0a862f6b42cbf2c50db7711ab7a735607571e500a2929e4c27528b235f","category":"Cycling"}