{"title":"Hands-On With the New Apple Fitness+ 'Time to Walk' Feature","link":"https://www.macrumors.com/2021/01/25/time-to-walk-hands-on/","date":1611607877000,"content":"Apple today announced the launch of a new \"Time to Walk\" feature that's available to Apple Watch owners who are also Fitness+ subscribers, with the service offering up audio stories from celebrities.\r\n<br/>\r\n\r\n<br/>\r\n<div class=\"center-wrap\"><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/OPNPQVQ94aE\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></div><div class=\"center-wrap\"><em><a href=\"https://www.youtube.com/user/macrumors?sub_confirmation=1\">Subscribe to the MacRumors YouTube channel</a> for more videos.</em></div>\r\n<br/>\r\nWe took a quick look at Time to Walk in our latest YouTube video to see what it's all about and whether it's a worthwhile addition to the Fitness+ service.\r\n<br/>\r\n\r\n<br/>\r\nTime to Walk is technically a watchOS 7.3 feature and will be announced in the watchOS 7.3 release notes, but it is accessible now in watchOS 7.2 as <a href=\"https://www.macrumors.com/2021/01/25/apple-fitness-time-to-walk-launches-today/\">Apple released it</a> as an over-the-air server side update.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/01/apple-time-to-walk-draymond-green.jpg\" alt=\"\" width=\"570\" height=\"836\" class=\"aligncenter size-full wp-image-780169\" />\r\n<br/>\r\nDesigned specifically for outdoor walks done while wearing an Apple Watch, Time to Walk features stories from musicians, actors, and athletes, with each story lasting from 25 to 40 minutes. Right now, there are four audio stories available from country music star Dolly Parton, NBA player Draymond Green, musician Shawn Mendes, and actress Uzo Aduba.\r\n<br/>\r\n\r\n<br/>\r\nEach audio story is meant to focus on the guest's \"personal, life-shaping moments,\" and Apple has designed these workouts to feel like you're walking alongside the celebrity that's speaking. The person telling the story is <em>also</em> on a walk, and will describe their surroundings before jumping into a personal discussion.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/01/time-to-walk-shawn-mendes.jpg\" alt=\"\" width=\"1700\" height=\"863\" class=\"aligncenter size-full wp-image-780170\" />\r\n<br/>\r\nShawn Mendes, for example, describes his walk in Griffith Park in Los Angeles before he delves into a discussion on the anxiety he faced when he went viral as a 15 year old, and the mindfulness techniques that he uses to achieve a sense of calm. Each of the Time to Walk stories is accompanied by photos at key intervals in the story, with Apple designing the discussions to feel like an intimate one-on-one experience.\r\n<br/>\r\n\r\n<br/>\r\nApple Watch owners <a href=\"https://www.macrumors.com/2021/01/25/apple-time-to-walk-jeff-williams-jay-blahnik/\">are meant to feel</a> like they're walking right alongside the celebrity sharing their Time to Walk story, and stories are punctuated by the ambient sounds like birds, footsteps, breathing, and other people in the area. After a story has finished, each speaker provides three songs to listen to that are related.\r\n<br/>\r\n\r\n<br/>\r\nTime to Walk workouts are available to all Apple Fitness+ subscribers and can be accessed in the Workout app as a unique workout type. Since the audio is coming from the Apple Watch, <a href=\"https://www.macrumors.com/guide/airpods/\">AirPods</a> or other Bluetooth headphones are required to listen. Time to Walk episodes can also be found in the Fitness+ section on the <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a>.\r\n<br/>\r\n\r\n<br/>\r\nTime to Walk episodes download automatically as long as you have the setting enabled on the &zwnj;iPhone&zwnj;, and it's turned on by default. It can be found if you open the Apple Watch app, scroll down to Workout, and make sure \"Add Newest Workouts to Watch\" is enabled. Apple plans to release new Time to Walk episodes every Monday through April.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/01/time-to-walk-shawn-mendes-2.jpg\" alt=\"\" width=\"2000\" height=\"1967\" class=\"aligncenter size-full wp-image-780171\" />\r\n<br/>\r\nApple is hoping that Time to Walk might serve as a gateway to getting people more involved with Apple Fitness+, which has been designed to be welcoming to people of all skill levels. Apple launched Apple Fitness+ last month, and the service offers workouts across a wide range of categories from dance and yoga to cycling, running, and HIIT.\r\n<br/>\r\n\r\n<br/>\r\nA Fitness+ subscription is required for Time to Walk, and Fitness+ is priced at &#36;9.99 per month or &#36;79.99 per year, though those who purchased a new Apple Watch this year can get a free three month trial.<div class=\"linkback\">Tag: <a href=\"https://www.macrumors.com/guide/apple-fitness-plus/\">Apple Fitness Plus</a></div><br/>This article, &quot;<a href=\"https://www.macrumors.com/2021/01/25/time-to-walk-hands-on/\">Hands-On With the New Apple Fitness+ &#039;Time to Walk&#039; Feature</a>&quot; first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br/><br/><a href=\"https://forums.macrumors.com/threads/hands-on-with-the-new-apple-fitness-time-to-walk-feature.2281848/\">Discuss this article</a> in our forums<br/><br/><div class=\"feedflare\">\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=UJ23iloQQWI:hyc3_mVh-L4:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" border=\"0\"></img></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=UJ23iloQQWI:hyc3_mVh-L4:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" border=\"0\"></img></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/UJ23iloQQWI\" height=\"1\" width=\"1\" alt=\"\"/>","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"a0885b5d252ff383bb8909d0617e70e24a7f198b64572e6bda71b04343346ba7","category":"Apple"}