{"title":"Full speed ahead","link":"https://www.cyclist.co.uk/sponsored/9109/full-speed-ahead","date":1610461385000,"content":"<span class=\"field field-name-field-author field-type-node-reference field-label-hidden\">\n      <span class=\"field-item even\"><a href=\"/authors/sponsored\">Sponsored</a></span>\n  </span><div class=\"field field-name-field-published-date field-type-datetime field-label-hidden\">  \n  <div class=\"field-items\">      <div class=\"field-item even\"><span class=\"date-display-single\" property=\"dc:date\" datatype=\"xsd:dateTime\" content=\"2021-01-13T00:31:00+00:00\">13 Jan 2021</span></div>    </div></div><p class=\"short-teaser\">\nIn the final instalment of this three-part special, your training plan is bringing you to a peak</p>\n<div class=\"primary-image\">\n      <img typeof=\"foaf:Image\" src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2021/01/dhb_winter_training.jpg?itok=hp8o51_h\" />  </div>\n<div class=\"field field-name-body\">\n      <p dir=\"ltr\">The combination of expert coaching and high-performance clothing from dhb means you’re going further, faster towards your goals this winter – and now the finish line is in sight.</p>\n<p>Let’s recap: you’ve now spent eight weeks on the bike <a href=\"/sponsored/8899/get-your-training-in-gear\" target=\"_blank\">building your base fitness</a> and you have gradually <a href=\"/sponsored/8989/getting-in-the-zone\" target=\"_blank\">increased the duration and intensity</a> of your training, especially over the previous four weeks.</p>\n<p dir=\"ltr\">‘Towards the end of phase two we added some work at zone 4 to remind you what it feels like, and to keep your muscles switched on,’ says Tim Elverson, owner, coach and sports director of the Canyon dhb SunGod UCI Continental pro team.</p>\n<p dir=\"ltr\">‘Now is the time to up the intensity as we reach the final four weeks of the training plan.’</p>\n<p dir=\"ltr\">Most of your training to date has taken place in training zones 2 and 3, which build endurance by allowing you to work comfortably below your maximum heart rate (40-45bpm below for zone 2, 30-40bpm below for zone 3). Zone 4 is an intensive effort at 25-30bpm below your MHR, which makes a big difference to how you feel and how your muscles adapt. This is a harder effort, and it will feel harder.</p>\n<p dir=\"ltr\">Phase three of our training plan has two goals. The first is to keep on racking up the miles, because that is still and always will be important. Your training plan will continue to include one long ride per week. However, the second goal is to work harder for less time in your other sessions.</p>\n<p dir=\"ltr\">‘Overall, you should be reducing volume and increasing the intensity in this phase to focus on the areas that need sharpening up,’ says Elverson.</p>\n<p dir=\"ltr\">‘If you’re planning to race, this means including some sprint sessions. If you simply want to focus on getting fitter or maybe completing a sportive, you can add some tempo intervals that take you from zone 3 – your happy place – into zone 4, which is an intensive effort rather than an endurance one. This final month is about taking you into the zones that push you a bit more.’</p>\n<p dir=\"ltr\">Just remember, once again, that your body needs time to rest and recover as well, because this is actually when you get fitter.</p>\n<p dir=\"ltr\">‘Rest becomes even more important as you up the intensity,’ says Elverson. ‘Even my full-time athletes, who train in the morning and rest in the afternoon, will have recharge rides and one day’s rest a week, and that’s during the season too. Training at higher intensity is about quality not quantity – and that’s what will help you get results.’</p>\n<div id=\"file-42318\" class=\"file file-image file-image-png file-content-full-width\">\n<div class=\"content\">    <img typeof=\"foaf:Image\" src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/insert_main_wide_image/public/2021/01/dhb_training_plan_phase_3.png?itok=mbNGQAjo\" alt=\"\" />  </div>\n</div>\n<h3 dir=\"ltr\">The plan: Phase three</h3>\n<p dir=\"ltr\">As well as doing one long ride per week, you will do a medium-intensity endurance ride. This is a zone 3 effort, or about 80 to 90% of your Functional Threshold Power. Then you can pick from a sprint or tempo session to help you sharpen up.</p>\n<p dir=\"ltr\">‘Sprint sessions can include sprinting all out for 25 seconds [Z6-7, just below or at your MHR], then dropping back to Z4 for one minute,’ says Elverson. ‘Repeat this anywhere from four to ten times, depending on fitness, in a one-hour Z3 ride.’</p>\n<p dir=\"ltr\">‘For tempo intervals, warm up for 10 minutes, then do 40 seconds on [Z4], 20 seconds off [Z3], for 20 minutes. Then ride at zone 3 for 20 minutes and do one more block before cooling down for 10 minutes,’ says Elverson.</p>\n<h3 dir=\"ltr\">In the right gear</h3>\n<p dir=\"ltr\">This three-part series has featured some of dhb’s latest winter kit, including:</p>\n<ul>\n<li>The Aeron LAB All Winter Polartec Jacket. Combining three innovative fabrics from Polartec®, this jacket has been designed to wear over a base layer when you are pushing the pace in tough conditions</li>\n<li>The Aeron LAB Equinox Bib Tight. For high-intensity efforts in early season, this features wind- and water-resistant fabrics along with the advanced moisture management of Flash from Schoeller®</li>\n<li>The Merino Long Sleeve Jersey. Blending the natural powers of wool and modern fabric technologies for comfort and performance</li>\n<li>The Aeron Merino Bib Tight. Developed for comfort with extra-fine Merino wool and minimal seam construction, the centre back panel is cut higher to underlap your jersey or jacket</li>\n<li>The Aeron Deep Winter Softshell. Constructed in a fleece-backed softshell with a high-performance membrane to block out wind and rain, this jacket is designed to withstand the toughest winter conditions</li>\n</ul>\n<p><strong><em>Visit <a href=\"http://pubads.g.doubleclick.net/gampad/clk?id=5586087795&amp;iu=/359/impcount.co.uk\" target=\"_blank\" rel=\"nofollow\">www.wiggle.co.uk/dhb</a> to see more of their winter training series</em></strong> </p>\n  </div>\n<div class=\"field field-name-field-category-primary field-type-taxonomy-term-reference field-label-hidden\">  \n  <div class=\"field-items\">      <div class=\"field-item even\"><a href=\"/training\" typeof=\"skos:Concept\" property=\"rdfs:label skos:prefLabel\" datatype=\"\">Training</a></div>    </div></div>","author":"HughA","siteTitle":"Featured Articles","siteHash":"f129cda89106022134374fa071789f236ffc24ddd29b6bf4220b1143ee6f092f","entryHash":"a2c2994696ac3e878b6317223755073bcc704b4ecfab2813bef4df193dc7258e","category":"Cycling"}