{"title":"Closing argument: Tribunal is told that Freeman ordered testosterone ‘to dope a rider’","link":"https://cyclingtips.com/2021/01/closing-argument-tribunal-is-told-that-freeman-ordered-testosterone-to-dope-a-rider/","date":1611617992000,"content":"<p>The lawyer for the General Medical Council (GMC) made the case on Monday that former Sky and British Cycling doctor Richard Freeman ordered testosterone &#8220;to dope a rider.&#8221; The statements were made in a closing argument before the tribunal assessing Freeman&#8217;s fitness to practice medicine.</p>\n\n\n\n<p>Freeman is accused of having ordered Testogel packets to British Cycling headquarters in 2011 &#8220;knowing or believing&#8221; the drug was for an athlete, and the tribunal has heard evidence on the matter in sporadic sessions over the course of nearly two years now. Freeman has admitted to 18 of the 22 charges levied against him at the tribunal, but his defense said that former Sky and British Cycling coach Shane Sutton &#8220;bullied&#8221; Freeman into acquiring the testosterone to treat erectile dysfunction.</p>\n\n\n\n<p>Simon Jackson, representing the GMC, made its closing argument on Monday as the long-running tribunal nears its end. According to The Guardian, Jackson said that &#8220;the only logical and proper conclusion&#8221; one could draw from the evidence presented was that the testosterone was meant to help a rider dope, and that Freeman had tried to make Sutton the &#8220;fall guy&#8221; in an attempt to cover up his action.</p>\n\n\n\n<p>&#8220;I underline that Team Sky and British Cycling were not aware of this but there were sleepers, there were dopers in the past who were within these organizations, when Dr Freeman was acquiring the Testogel,&#8221; Jackson said, according to the Guardian.</p>\n\n\n\n<p>“They had doped before. And so these aren’t bold allegations in the sense they are unsubstantiated. The GMC has been able to pull all these strands together. The only reasonable conclusions are they weren’t clinically indicated but they were used to dope a rider.”</p>\n\n\n\n<p>The AFP reports that Jackson questioned why Freeman had not shown text messages from Sutton that he alleged were &#8220;threatening&#8221; to the police or his lawyer, and why he had lost or deleted so much information that could have been used as evidence in the case.</p>\n\n\n\n<p>He also reportedly referenced the contention of an endocrinology expert that testosterone would not have been the proper treatment even had Sutton requested it.</p>\n\n\n\n<p>According to the Guardian, Freeman&#8217;s lawyer Mary O&#8217;Rourke called the arguments &#8220;a complete change in the GMC&#8217;s case&#8221; making allegations &#8220;that we have never heard before.&#8221;</p>\n\n\n\n<p>O&#8217;Rourke will make her closing arguments when the tribunal continues on Tuesday.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cyclingtips.com/2021/01/closing-argument-tribunal-is-told-that-freeman-ordered-testosterone-to-dope-a-rider/\">Closing argument: Tribunal is told that Freeman ordered testosterone &#8216;to dope a rider&#8217;</a> appeared first on <a rel=\"nofollow\" href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"a35924a3d08c6d2a4f5762a58ca41aaf0709388550800cce1082c281dfb9500a","category":"Cycling"}