{"title":"บริษัทวิจัยตลาดเผย ผู้ใช้มือถือเปลี่ยนรุ่นช้าลง เริ่มเปลี่ยนแค่ตอนมือถือพังมากขึ้น","link":"https://www.blognone.com/node/120820","date":1611651895000,"content":"<div class=\"field field-name-body field-type-text-with-summary field-label-hidden\"><div class=\"field-items\"><div class=\"field-item even\"><p>CCS Insight บริษัทวิจัยตลาด ทำการสำรวจกลุ่มผู้บริโภคกว่า 5,000 คน ในสหราชอาณาจักร พบว่าประมาณ 34 เปอร์เซ็นต์ ระบุว่าจะใช้มือถือที่ใช้อยู่ในปัจจุบันนานกว่ารุ่นก่อนๆ ซึ่งมีจำนวนมากกว่าผู้บริโภคที่ระบุว่าจะเปลี่ยนมือถือไวกว่าเดิมถึงสองเท่า</p>\n<p>CCS Insight ระบุว่าตลาดมือถือ เริ่มเปลี่ยนจากอุปกรณ์ที่ใช้งานแค่สองปี เข้าไปใกล้เคียงกับการเป็น “white goods” หรืออุปกรณ์เครื่องใช้ไฟฟ้าขนาดใหญ่ที่ผู้ใช้จะเปลี่ยนเมื่อพังแล้วเท่านั้นมากขึ้น เพราะความแตกต่างในด้านประสิทธิภาพของมือถือ ลดน้อยลงทุกๆ ปี และการอัพเกรดรุ่น ไม่ได้เป็นการก้าวกระโดดทางประสิทธิภาพเหมือนเคย</p>\n<p>ในด้านการซัพพอร์ตมือถืออย่างยาวนาน Apple ยังเป็นผู้นำอยู่ เช่น iPhone 6S และ iPhone SE รุ่นแรกที่ยังได้รับอัพเดต iOS ส่วนฝั่ง Android แม้จะแตกต่างกันไปในแต่ละแบรนด์ แต่ก็เริ่มมีค่ายต่างๆ เช่น Samsung ที่ระบุว่าจะ<a href=\"https://www.blognone.com/node/118010\">อัพเดตมือถือตระกูล Galaxy อย่างน้อยสามปี</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/455b380322ac2562d0f5a26e78f0bcba.jpg\" alt=\"\" /></p>\n<p>พฤติกรรมในการซื้อมือถือของผู้บริโภคก็เปลี่ยนไปเช่นกัน โดย CCS Insight เปิดเผยว่าจากเดิม (ก่อนปี 2019) มีผู้บริโภคเพียง 36 เปอร์เซ็นต์เท่านั้นที่ซื้อมือถือผ่านช่องทางออนไลน์ แต่กลับเพิ่มเป็น 63 เปอร์เซ็นต์ในการสำรวจครั้งล่าสุด คาดว่าน่าจะเป็นผลกระทบจากการระบาดของไวรัส COVID-19</p>\n<p>ผู้ที่ยังไปร้านขายมือถืออยู่ สาเหตุหลักไปเพราะต้องการความช่วยเหลือด้านเทคนิค คิดเป็น 20 เปอร์เซ็นต์ อีก 13 เปอร์เซ็นต์ไปเพื่อทำเรื่องเกี่ยวกับการจ่ายค่าบริการ และ 18 เปอร์เซ็นต์ ไปเพื่อซื้ออุปกรณ์เสริม</p>\n<p>CCS Insight ระบุด้วยว่าร้านขายมือถือคงยังไม่หายไปไหน แต่ก็ต้องปรับตัวเสียใหม่ หาจุดสมดุลระหว่างการขายเครื่อง ให้การช่วยเหลือด้านเทคนิค และเป็นที่แสดงเทคโนโลยีใหม่ๆ เพื่อนำมาผนวกกับการขายทางช่องทางออนไลน์</p>\n<p>ที่มา - <a href=\"https://www.theregister.com/AMP/2021/01/25/smartphones_are_becoming_like_white/\">The Register</a></p>\n</div></div></div><div class=\"field field-name-taxonomy-vocabulary-1 field-type-taxonomy-term-reference field-label-above\"><div class=\"field-label\">Topics:&nbsp;</div><div class=\"field-items\"><div class=\"field-item even\"><a href=\"/topics/market-research\">Market Research</a></div><div class=\"field-item odd\"><a href=\"/topics/united-kingdom\">United Kingdom</a></div><div class=\"field-item even\"><a href=\"/topics/mobile\">Mobile</a></div></div></div>","author":"mheevariety","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"a48c26347dec1283e94eec8602fda7a76d8a17e77050c3eb6f9e748fdbb58120","category":"Thai"}