{"title":"Fifty Shades of Fear","link":"https://markpeak.net/fifty-shades-of-fear/","date":1611033402000,"content":"<p><em>บล็อกนี้เป็นส่วนหนึ่งของซีรีส์ COVID-2021 ตอนที่ 1</em></p>\n<p>จากสถานการณ์ COVID ช่วงต้นปี 2021 เห็นข้อสังเกตที่น่าสนใจหลายอย่าง จะทยอยเขียนเป็นซีรีส์</p>\n<p>ช่วงปีใหม่มีโอกาสคุยกับเพื่อนฝูงนักธุรกิจหลายคน ให้ช่วยกันประเมินสถานการณ์ของการระบาดระลอกใหม่ช่วงปลายปี 2020 ต่อเนื่องมายังต้นปี 2021</p>\n<p>ผมคิดว่าในภาพรวมสุดๆ แล้วการระบาดระลอก 2 (หรือที่รัฐห้ามใช้เลข 2) ถือเป็นสถานการณ์ &#8220;ปกติใหม่&#8221; (new normal) ที่มาช้ากว่าที่ควรจะเป็นในประเทศไทย</p>\n<p>ด้วยเหตุผลเรื่องการปิดเมืองแบบเข้มงวดตลอดปี 2020 โดยแลกกับความเสียหายทางเศรษฐกิจ (แต่สุดท้ายก็พิสูจน์แล้วว่าใช้ไม่ได้ผล เพราะปิดยังไงก็ไม่มิด) ในขณะที่ประเทศอื่นๆ มีการระบาดอย่างต่อเนื่องอยู่เรื่อยๆ อยู่แล้ว พูดง่ายๆ ว่าคนอื่นเขาเจอสถานการณ์แบบนี้มาก่อนเราจนกลายเป็นเรื่องปกติไปแล้ว</p>\n<p>ส่วนการระบาดระลอกแรกช่วงต้นปี 2020 ที่สามารถคุมอยู่ได้ไม่ยาก นั้นถือเป็นสถานการณ์ไม่ปกติ (irregularity) หรือถ้าจะเรียกว่าเป็น black swan ก็พอได้เช่นกัน (ประเทศไทยถือเป็นเคสพิเศษมากๆ ในโลกปี 2020)</p>\n<p>พูดง่ายๆ คือเราอยู่กับความไม่ปกติ (ปิดเมืองเข้มงวดจนไม่มีคนติดไวรัส) มาจนชิน จนคิดว่าเป็นเรื่องปกติ แต่พอมาเจอกับ &#8220;ของจริง&#8221; ที่คนประเทศอื่นเขาเจอกันจนกลายเป็นปกติ เราเลยรู้สึกว่ามันไม่ปกติ (งงมั้ย)</p>\n<p>คำถามแรกที่ต้องตอบให้ได้คือ ทำไมสถานการณ์ของเราจึงกลับกันกับประเทศอื่นๆ</p>\n<p>ผมเจอคำตอบนี้ในบทความของ &#8220;หนุ่มเมืองจันท์&#8221; ซึ่งเป็นนักเขียนที่เก่งฉกาจในเรื่องการสังเกตอารมณ์ของคน</p>\n<p>เนื่องจากบทความไม่ยาว เลยขอยกมาทั้งก้อนเพื่อประโยชน์ในการอ้างอิง (บทความนี้มีหลายประเด็นที่ดีมาก คงได้ใช้อ้างอิงอยู่บ่อยครั้ง)</p>\n<p><img loading=\"lazy\" class=\"aligncenter size-large wp-image-2102\" src=\"https://markpeak.net/wp-content/uploads/2021/01/หนุ่มเมืองจันทร์-1024x768.jpg\" alt=\"\" width=\"700\" height=\"525\" srcset=\"https://markpeak.net/wp-content/uploads/2021/01/หนุ่มเมืองจันทร์-1024x768.jpg 1024w, https://markpeak.net/wp-content/uploads/2021/01/หนุ่มเมืองจันทร์-300x225.jpg 300w, https://markpeak.net/wp-content/uploads/2021/01/หนุ่มเมืองจันทร์-768x576.jpg 768w, https://markpeak.net/wp-content/uploads/2021/01/หนุ่มเมืองจันทร์-700x525.jpg 700w, https://markpeak.net/wp-content/uploads/2021/01/หนุ่มเมืองจันทร์.jpg 1536w\" sizes=\"(max-width: 700px) 100vw, 700px\" /></p>\n<p>คำอธิบายของหนุ่มเมืองจันท์คือ COVID ระลอกแรกเป็นภัยคุกคามใหม่ที่คนทั่วโลกไม่เคยเจอมาก่อน เราจึงกลัวในสิ่งที่มองไม่เห็นนี้ (unknown threat)</p>\n<p>กลัวแล้วทำอะไร? ปฏิกิริยาที่ตามมาขึ้นกับพื้นเพนิสัยใจคอ วัฒนธรรมของแต่ละชาติแต่ละกลุ่มแล้ว อย่างในอเมริกาที่มีวัฒนธรรมเรื่อง &#8220;เสรีภาพของปัจเจกชน&#8221; แข็งแกร่งมาก เราจึงเห็นการปฏิเสธการสวมหน้ากากกันอย่างแข็งขัน จนกลายเป็นประเด็นเรื่องการแสดงออกทางการเมือง (<a href=\"https://markpeak.net/divided-nation/\">ที่มาบวกกับ very partisan politics</a>)</p>\n<p>ถ้าตามข่าวการเมืองอเมริกาอยู่บ้าง ฝั่งของ Biden จะพยายามชูนโยบายเรื่องใส่หน้ากาก โดยใช้เหตุผลว่า according to science อิงตามหลักวิทยาศาสตร์เป็นหลัก เพื่อตอบโต้กับเหตุผลเรื่อง free speech ที่ฝังรากลึกในสังคมอเมริกันนั่นเอง</p>\n<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">Listening to scientists is not a bad thing.</p>\n<p>I can’t believe that has to be said.</p>\n<p>&mdash; Joe Biden (@JoeBiden) <a href=\"https://twitter.com/JoeBiden/status/1318674605192761350?ref_src=twsrc%5Etfw\">October 20, 2020</a></p></blockquote>\n<p><script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></p>\n<p>แต่ในบริบทของไทย (และเอเชียด้วยในภาพรวม) ที่ประชากรมีลักษณะ obedient มากกว่าสังคมตะวันตก การขอความร่วมมือจึงทำได้ง่ายกว่ามาก และเมื่อเจอกับภัยคุกคามระลอกแรกที่มีลักษณะ &#8220;ไม่รู้จัก&#8221; แนวคิดเรื่องปลอดภัยไว้ก่อนจึงกลายเป็นสิ่งแรกที่ทุกคนยอมทำตาม</p>\n<p>พอการระบาดระลอกสองเกิดขึ้น สิ่งที่ต่างไปจากเดิมคือ ไวรัสเป็นภัยคุกคามที่คนในสังคม &#8220;รู้จักมัน&#8221; ดีกว่าเดิมมากแล้ว ปฏิกิริยาตอบโต้จึงแตกต่างไปจากครั้งแรก</p>\n<p>เท่าที่สังเกตด้วยตัวเอง ผมคิดว่าปฏิกิริยารับมือของคนนั้นแตกต่างหลากหลายมาก ขึ้นกับความเชื่อ คุณค่า ไลฟ์สไตล์ของแต่ละคนหรือครอบครัว</p>\n<p>เราจึงเห็นแนวทางที่แตกต่างกันอย่างสุดขั้ว ตั้งแต่กลุ่มที่ paranoid จัดๆ ไม่ออกไปไหนเลย ฉีดสเปรย์ฆ่าเชื้อทุกพื้นที่สัมผัส ไปจนถึงกลุ่มที่ไม่แคร์อะไรเลย ออกไปปาร์ตี้ ใช้ชีวิตนอกบ้านกันตามปกติ ใส่แมสก์เฉพาะในพื้นที่สาธารณะที่โดนบังคับทำเท่านั้น และถอดเสมอเมื่อมีโอกาส</p>\n<p>รอบนี้ (และรอบต่อๆ ไป) ความกลัวของคนเป็นสเปกตรัมแล้ว</p>\n<p>นี่จึงเป็นที่มาของชื่อบล็อกว่า Fifty Shades of Fear (ลอกชื่อมาจากหนัง และหนังสือ โดยไม่มีความเกี่ยวข้องกัน) เพื่อให้เห็นภาพในเชิง conceptual</p>\n<p>ความกลัวมีหลายเฉดมาก คำถามต่อมาที่น่าสนใจคือ เราจะรับมืออย่างไร ในเมื่อคนไม่ได้ให้ความร่วมมือไปในทางเดียวกันแบบครั้งก่อน</p>\n<p>คำตอบคือวิธีการรับมือนั้นยากขึ้นกว่าเดิมมาก เพราะเราไม่มีโซลูชันที่เป็น one-size-fit-all มาตรฐานเดียวกันใช้ได้ครอบจักรวาลอีกแล้ว</p>\n<p>สิ่งที่ผมคิดว่าน่าจะเกิดขึ้นคือ สถานการณ์ on and off คือระบาดเป็นพักๆ คุมอยู่แล้วกลับมาระบาดใหม่ ซึ่งเป็นสิ่งที่ประเทศอื่นๆ เจอกันเป็นปกติ (แต่ประเทศไทยยังไม่เคยเจอ)</p>\n<p>มิตรสหายท่านหนึ่งบอกว่า รอบนี้ต่างจากรอบที่แล้วตรงที่มี &#8220;เส้นชัย&#8221; คือวัคซีนเริ่มปรากฏตัวให้เห็นริมขอบฟ้า</p>\n<p>ใช่ครับ แต่กว่าวัคซีนจะมาครบสมบูรณ์นั้นไม่ใช่เรื่องง่ายอีกเหมือนกัน ถ้าเราอยากกลับมาใช้ชีวิตแบบ &#8220;เกือบปกติ&#8221; เหมือนเดิม ผมประเมินว่าอาจต้องใช้เวลาถึงปี 2023 ด้วยซ้ำ (แต่สเกลจะไม่ขึ้นเป็น linear ดังนั้นปลายปี 2021 อาจดีขึ้นในบางอย่างแต่ไม่ใช่ทั้งหมด)</p>\n<p>ถ้าตีหยาบๆ ว่าวันปีใหม่ 2023 ทุกอย่างจะดีขึ้น เราต้องอยู่กับความไม่แน่นอนไปอีก 2 ปีเต็ม เราจะรับมือกับช่วงเวลานี้อย่างไร ที่จะเกิดสภาวะระบาดแบบ on and off และปฏิกิริยาของคนคือ มีความกลัวแตกต่างกันไปแบบสุดขั้ว</p>\n<ul>\n<li><strong>ในทางธุรกิจ</strong> เราต้องเปลี่ยนความไม่แน่นอนเป็นความแน่นอน (ขึ้นมาบ้าง) จะเขียนถึงในตอน <a href=\"https://markpeak.net/business-resilience-2021/\">Business Resilience</a></li>\n<li><strong>ในทางภาครัฐ</strong> เราต้องหานโยบาย baseline ขั้นต่ำที่ทุกคนยอมรับได้ (ซึ่งดีกรีความหนักแน่นจะลดลงจากรอบแรก) แต่จะมีอีกปัจจัยที่มาเกี่ยวข้องคือ ความน่าเชื่อถือของภาครัฐ (ตามที่หนุ่มเมืองจันท์เขียนไว้) จะเขียนถึงในตอน Trustworthy</li>\n</ul>The post <a href=\"https://markpeak.net/fifty-shades-of-fear/\">Fifty Shades of Fear</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"af8e06f700e2e32b35685f340a020546148cd3b7992c94fbe5f8f2ca28f1750b","category":"Thai"}