{"title":"Lost Passwords Lock Would-Be Millionaires Out of Their Bitcoin Fortunes","link":"https://www.nytimes.com/2021/01/12/technology/bitcoin-passwords-wallets-fortunes.html","date":1610493347000,"content":"\n<p>Nathaniel Popper, reporting for The New York Times:</p>\n\n<blockquote>\n  <p>Stefan Thomas, a German-born programmer living in San Francisco,\nhas two guesses left to figure out a password that is worth, as of\nthis week, about $220 million.</p>\n\n<p>The password will let him unlock a small hard drive, known as an\nIronKey, which contains the private keys to a digital wallet that\nholds 7,002 Bitcoin. While the price of Bitcoin dropped sharply on\nMonday, it is still up more than 50 percent from just a month ago,\nwhen it passed its previous all-time high of around $20,000.</p>\n\n<p>The problem is that Mr. Thomas years ago lost the paper where he\nwrote down the password for his IronKey, which gives users 10\nguesses before it seizes up and encrypts its contents forever. He\nhas since tried eight of his most commonly used password\nformulations — to no avail.</p>\n\n<p>“I would just lay in bed and think about it,” Mr. Thomas said.\n“Then I would go to the computer with some new strategy, and it\nwouldn’t work, and I would be desperate again.”</p>\n</blockquote>\n\n<p>Matt Levine, in his column at Bloomberg, <a href=\"https://www.bloomberg.com/opinion/articles/2021-01-12/don-t-forget-your-bitcoins\">makes the point that no one loses stock this way</a>. But another lesson: use a good password manager, and print your most important passwords and recovery codes <a href=\"https://www.schneier.com/blog/archives/2005/06/write_down_your.html\">on paper</a>, stored where you store other important documents.</p>\n\n<div>\n<a  title=\"Permanent link to ‘Lost Passwords Lock Would-Be Millionaires Out of Their Bitcoin Fortunes’\"  href=\"https://daringfireball.net/linked/2021/01/12/bitcoin-passwords\">&nbsp;★&nbsp;</a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"b00e72bc79d2479001b0389d45c3bf06a63ec10521781f5ddb2b3a8d640130d8","category":"Tech"}