{"title":"The secret to this $5,000 electric motorcycle is a cast aluminum frame","link":"https://arstechnica.com/?p=1737201","date":1611594370000,"content":"<div id=\"rss-wrap\">\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul class=\"gallery shortcode-gallery gallery-wide\"><li>\n        <div class=\"gallery-item-content\">  \n        <div class=\"gallery-image\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/01/metacycle-footer-980x648.png\" alt=\"\"></div>\n        <p>\n          Electric motorcycles, like electric cars, have been more expensive than their gasoline-powered cousins. Sondors hopes to change that with its new Metacycle.                      [credit:\n                        Sondors                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p>It's unavoidably clear that staving off the worst extremes of climate change will require a wide-scale electrification of our vehicle fleet. There's a hitch, though—it's not cheap. We have the technology to make electric vehicles, and it's getting better all the time. But as of right now, the bill of materials for an electric car is still higher than for an equivalent vehicle with an internal combustion engine, even with <a href=\"https://arstechnica.com/science/2020/12/battery-prices-have-fallen-88-percent-over-the-last-decade/\">impressive reductions in the cost of lithium-ion batteries</a>.</p>\n<p>The problem doesn't just affect passenger cars. It's more expensive to buy an <a href=\"https://arstechnica.com/cars/2019/05/seattle-makes-history-with-electric-garbage-truck/\">electric garbage truck</a> or <a href=\"https://arstechnica.com/cars/2019/12/virginia-has-big-plans-for-electric-school-buses-in-2020/\">school bus</a> than one with a diesel engine, although after four to five years of operation, it balances out thanks to the cost of fuel. It's even true for motorcycles; Harley Davidson's new electric LiveWire costs an eye-watering $30,000—only <a href=\"https://arstechnica.com/cars/2017/12/the-all-new-2018-nissan-leaf-driven/\">slightly less than a Nissan Leaf</a>. All of which makes the price of the Sondors Metacycle so notable. When it goes into production later this year, you should be able to pick one up for just $5,000.</p>\n<p>Until now, Sondors was a brand people associated with electric bicycles. It's the brainchild of company founder Storm Sondors, who decided the time was right to expand the company's range with a highly affordable electric motorbike that's meant not for enthusiasts but for everyday transport. And the key wasn't perfecting a new type of motor or battery. \"Oh, the hard part was done by people who are 1000 times smarter than any one of us,\" Sondors told me by phone.</p></div><p><a href=\"https://arstechnica.com/?p=1737201#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1737201&comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"bc883c3810eedee80de6e18e0446879841812b55fc1610f2d27013c84964dc5c","category":"Tech"}