{"title":"Six Reasons to Follow Women’s Cycling in 2021","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/six-reasons-to-follow-women-s-cycling-in-2021","date":1608748623000,"content":"\n      <p><span style=\"font-weight: 400;\">As devotees of women’s cycling already know, the racing on offer makes for some of the most exciting viewing across the sport as a whole. However if you have yet to watch the women in action, then 2021 is the season to start. </span></p>\n<div class=\"klaviyo-form-Ymj3Vm\"></div>\n<p><span style=\"font-weight: 400;\">Increasingly, thanks in part to a UCI stipulation that all Women’s WorldTour (WWT) events must provide at least one hour of live broadcast, fans are now actually able to view the women’s peloton race. Whether you’re a fully paid-up supporter or you’ve never heard the name Anna van der Breggen before, here are six reasons to follow women’s cycling in 2021.</span></p>\n<h4><span style=\"font-weight: 400;\">Fair Share</span></h4>\n<p><span style=\"font-weight: 400;\">It’s been a few seasons since the women’s peloton was under the stronghold of one team. Gone are the days when a dominant Boels Dolmans were almost guaranteed to come out on top. The only team to hold anything close to the same command in recent years has been Trek-Segafredo, prompting former world champion Annemiek van Vleuten to turn down a ride with the squad in favour of Movistar because - as she told El Peloton - \"My heart is also passionate about making women’s cycling more interesting, and not making it less interesting.”  </span></p>\n<meta charset=\"utf-8\">\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Trek_Segafredo_1024x1024.jpg?v=1608745587\" alt=\"\"></p>\n<meta charset=\"utf-8\">\n<p><em>(Image credit: Alex Whitehead/SWpix.com)</em></p>\n<p><span style=\"font-weight: 400;\">“More interesting” is exactly what the 2021 women’s cycling season promises to be. Boels Dolmans (who become SD-Worx from 2021) are still formidable adversaries and have fortified their squad for next year – signing experienced climber Ashleigh Moolman Pasio as well as a host of promising young talent. However, with the evergreen Marianne Vos heading up the newly-formed Jumbo-Visma women’s team, stacked squads from DSM (formerly Sunweb) and Liv, an in-form Amanda Spratt stepping into Van Vleuten’s leader’s shoes at Mitchelton and the myriad talented riders absorbed into the WorldTour from the closure of Equipe Paule Ka, the distribution of talent is more evenly weighted than it has ever been. And it promises to make for some thrilling racing.</span></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-podcast/rouleur-conversations-podcast-orla-chennaoui-and-andy-mcgrath-on-issue-100-and-more\"><span style=\"font-weight: 400;\"><strong><em>Related: Issue 101 of Rouleur will be an all-female issue</em></strong></span></a></p>\n<h4><span style=\"font-weight: 400;\">Bright Young Things </span></h4>\n<p><span style=\"font-weight: 400;\">Those who watched in awe during men’s races this season as young riders like Tadej Pogačar and Tao Geoghegan Hart came of age in spectacular style will likely find similar narratives playing out in the women’s peloton in 2021. </span></p>\n<p><span style=\"font-weight: 400;\">A host of prodigiously talented young female riders have been circling the upper echelons of WWT results sheets for a few seasons and many look set to achieve still greater things in 2021. </span></p>\n<p>Most notable amongst them is the young German, Liane Lippert. After winning Cadel Evans [The race, not the former Tour winner - Ed] in February, she went on to maintain a string of impressive performances to hold on to the WWT leader’s jersey for half of the 2020 season before eventually taking the U23 classification. Numerous other under-23 and junior riders also accomplished top performances in 2020 amongst them were impressive Giro Rosa rides from Kiwi duo Niamh Fisher-Black and Mikayla Harvey and 21-year-old Frenchwoman Évita Muzic. </p>\n<p><span style=\"font-weight: 400;\"><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Liane_Lippert_1024x1024.jpg?v=1608745553\" alt=\"\"></span></p>\n<p><span style=\"font-weight: 400;\">Elsewhere, 2019 Junior World Champion, 18-year-old American Megan Jastrab, will make her WorldTour debut with DSM in 2021. She will be joining Dutch rider Lorena Wiebes who - at just 20 years old - won the WWT overall in 2019. Next season will see something of a changing of the guard as these riders step up in the wake of some impending high-profile retirements.</span></p>\n<h4><span style=\"font-weight: 400;\">First Women’s Paris Roubaix </span></h4>\n<p><span style=\"font-weight: 400;\">Announcing the rearranged 2020 calendar in May, the UCI slipped the news of a Women’s Paris Roubaix amongst the Classics season as if it had been there all along. </span></p>\n<p><span style=\"font-weight: 400;\">The race, which was due to be held on 25 October, was set to take place on the same day as the men’s and cover some of the same brutal cobbled sectors that have earned it the moniker ‘The Hell of the North’. Naturally, many in the women’s peloton were delighted at the prospect of racing their own version of the iconic classic and some teams had already undertaken a course recon before the news that both the 2020 men’s and women’s events would be cancelled. </span></p>\n<meta charset=\"utf-8\">\n<p><span style=\"font-weight: 400;\"><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Annemiek_VV_Demi_Vollering_Lotte_Kopecky_Paris_Roubaix_Classics_1024x1024.jpg?v=1608745519\" alt=\"\"></span></p>\n<p><span style=\"font-weight: 400;\">With even more time to prepare and look forward to the 2021 edition, Classics specialists and chancers alike will be raring to finally put on a show at the inaugural Women’s Paris Roubaix on 11 April 2021. Many will even be hoping for rain. </span></p>\n<h4><span style=\"font-weight: 400;\">The Olympics</span></h4>\n<p><span style=\"font-weight: 400;\">2021 is now an Olympic year meaning that riders will be striving for their best possible form leading up to the Games. With many eminent figures within the women’s peloton having announced that they will be retiring at the end of the season. That includes defending Olympic and current World Champion Anna van der Breggen, meaning the competition will be fierce as riders look to go out on a high. </span></p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Anna_Van_der_Breggen_Winning_World_Championships_1024x1024.jpg?v=1608745610\" alt=\"\"><em></em></p>\n<p><em><span style=\"font-weight: 400;\">Anna Van der Breggen winning the 2020 World Championships (Credit: </span>Alex Whitehead/SWpix.com)</em></p>\n<p><span style=\"font-weight: 400;\">As the course is 137km with a brutal 2,692 metres of elevation, the women will be looking at hilly one-day races in particular to serve as a form finder ahead of Tokyo. This should make the Ardennes Classics, and other similar 1.1 events, even more competitive than usual. Those who want to know the score for the women’s road race on the 26th July should keep a close eye on such races. All of which should be broadcast, at least in part, live. </span></p>\n<h4><span style=\"font-weight: 400;\">The Characters </span></h4>\n<p><span style=\"font-weight: 400;\">As with any sport, an essential factor that makes following racing interesting is getting to know the riders and their characters before rooting for your favourites. Women’s cycling is awash with charismatic and multi-dimensional individuals who each have their own distinct racing styles and personalities. But of course, in a team sport there is also the collective vibes of each squad to take into account. </span></p>\n<p><span style=\"font-weight: 400;\">Stand-out figures include the characterful Dane, Cecillie Uttrup Ludwig of FDJ, outspoken Brit Lizzy Banks, who will ride for Ceratizit-WNT in 2021, and long-standing fan favourite, Marianne Vos who will become Jumbo-Visma team leader. However, those who already follow men’s racing will know that choosing your favourite rider or team involves the coming together of a multitude of factors and loyalties unique to each fan. More racing being broadcast provides the perfect opportunity to get to know the women’s peloton. The more racing you watch, the easier it is to figure out which riders to root for.</span></p>\n<p><span style=\"font-weight: 400;\"><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW3_7061_1024x1024.jpg?v=1608745652\" alt=\"\"></span></p>\n<p><em><span style=\"font-weight: 400;\">(Image credit: </span>Alex Whitehead/SWpix.com)</em></p>\n<h4><span style=\"font-weight: 400;\">The Return of Stage Racing </span></h4>\n<p><span style=\"font-weight: 400;\">Amongst the many casualties of the diminished 2020 women’s calendar it was stage racing in particular seemed to bear the brunt. While some lower-level events such as Setmana Ciclista Valenciana and Tour Cycliste Féminin International de l'Ardèche went ahead, riders were left with only the Giro Rosa and the Ceratizit Challenge by La Vuelta to contest at the highest (WWT) level. </span></p>\n<p><span style=\"font-weight: 400;\"><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/DSC_0662_1024x1024.jpg?v=1608745764\" alt=\"\"></span></p>\n<meta charset=\"utf-8\">\n<p><em><span style=\"font-weight: 400;\">(Image credit Simon Wilkinson/SWpix.com)</span></em></p>\n<p><span style=\"font-weight: 400;\">2021, however, heralds a much more dynamic calendar for stage racing specialists. While the beleaguered 10-day Giro Rosa has been downgraded from WWT status, after failing to provide live images in 2020, there are many races waiting to take its position as the ‘Women’s Grand Tour’. The Women’s Tour in the UK is one such race, a favourite amongst both riders and fans, it is set to return with the usual six stages and a promise of live coverage for 2021.</span></p>\n<p><span style=\"font-weight: 400;\">In addition, two new events have been confirmed. Taking place from 14 May in northern Spain are the Itzulia Women and Vuelta a Burgos Feminas. That’s alongside the return of the four-day Ladies Tour of Norway and five-day Boels Ladies’ Tour, both in August. For those who love a GC battle and the microcosm of drama it brings, the women’s 2021 calendar promises to entertain.</span></p>\n<p><em><span style=\"font-weight: 400;\">Opening </span>Image credit Alex Whitehead/SWpix.com</em></p>\n<div class=\"klaviyo-form-UFKPji\"></div>\n    ","author":"Miles Baker-Clarke","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"c0aa3f14af699c43e7875021f1fa613220827bf1cfd6561613ce6269969331c7","category":"Cycling"}