{"title":"How Final Fantasy VII Remake legitimizes sexuality and gender identity","link":"https://arstechnica.com/?p=1737241","date":1611604428000,"content":"<div id=\"rss-wrap\">\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul class=\"gallery shortcode-gallery gallery-wide\"><li>\n        <div class=\"gallery-item-content\">  \n        <div class=\"gallery-image\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/01/FF_5-980x533.png\" alt=\"\"></div>\n        <p>\n          Preeeeeeesenting...                      [credit:\n                        <a href=\"https://www.square-enix.com/\">Square Enix</a>\n                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p>In <em><a href=\"https://arstechnica.com/tag/final-fantasy-vii/\">Final Fantasy VII</a></em>, spiky-haired protagonist Cloud Strife fights countless battles. But when he arrives in the red-light district called Wall Market, he faces what might be his greatest challenge: cross-dressing. To rescue his childhood friend and ally Tifa Lockhart from a seedy old slumlord, Cloud infiltrates an adults-only establishment called the Honey Bee Inn. The catch: to get to her, he must go undercover as a woman.</p>\n<p>In the original 1997 version of <em>FFVII,</em> Cloud's drag transformation is played for laughs. Undertones of queer panic and derision punctuate nearly every character interaction while he's dressed in a frilly, lavender frock. The audience is supposed to guffaw at this warrior clad in women's clothing, tamping down any inherent issues of sexual identity and expression that could be attached to the scene. <em>Final Fantasy VII</em>, while heartfelt, dramatic, and in many ways beautiful, was never what could be interpreted as \"in tune\" with its sexual side.</p>\n<p>Nearly 25 years later, <em><a href=\"https://arstechnica.com/gaming/2020/04/final-fantasy-vii-remake-spoiler-free-review-our-kind-of-cloud-gaming/\">Final Fantasy VII Remake</a></em> flipped the script. A narrative that was once eager to mock Cloud's dalliances in drag, and which turned a blind eye to the sexual implications of the situation, has morphed. In <em>Remake</em>, this scene blossoms into a brilliant and daring piece of media that encourages the exploration and freedom of one's sexual identity. It also legitimizes both the cisgender and queer desires that certain characters harbor.</p></div><p><a href=\"https://arstechnica.com/?p=1737241#p3\">Read 22 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1737241&comments=1\">Comments</a></p>","author":"Ars Staff","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"c0bdb6fa2d74eaca6eb5b9a037ce493d6c5afa4fd3f896aa59d049e5cc0c9874","category":"Tech"}