{"title":"“People will say: When's the men's issue, then?” Orla Chennaoui on editing Rouleur’s women’s issue","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/people-will-say-whens-the-mens-issue-then-orla-chennaoui-on-editing-rouleur-s-women-s-issue","date":1609346913000,"content":"\n      <p><i><span style=\"font-weight: 400;\">Issue 101 will be the first ever women’s issue of Rouleur and is guest edited by broadcaster and Rouleur columnist Orla Chennaoui. It is published in early February 2021.</span></i></p>\n<p><i><span style=\"font-weight: 400;\">She spoke with Rouleur’s podcast presenter Ian Parkinson and Rouleur editor Andy McGrath for our Rouleur Conversations podcast, and below is an edited transcript.</span></i></p>\n<p><strong><a href=\"https://www.rouleur.cc/pages/subscribe\" title=\"Subscribe\"><i>Subscribe to Rouleur now to receive Issue 101</i></a></strong></p>\n<p><strong>Ian Parkinson:</strong> <em>Issue 100 is done and published and onto 101. And this is going to be a very different issue in your hands.</em></p>\n<p><b>Orla Chennaoui:</b><span style=\"font-weight: 400;\"> I'm guest editing issue 101 which is Rouleur's first women's issue of the magazine. By the time it hits the stands, or the virtual stands, it will have been almost a year in production. And that's for good reason. It's also a huge credit to Andy, to Ian to the whole Rouleur team, that they've wanted to invest so much time and energy into doing this and to getting it right and making it something brilliant and something celebratory and revolutionary. </span></p>\n<p>I'm very, very proud of this issue even before it's finished. Just being able to bring something that's so different, so new and, from my point of view anyway, a fresh look on cycling. </p>\n<p><span style=\"font-weight: 400;\">The brief was completely open. It was: ‘We want to do a women's issue, what should we put in it?’ And for me it was really important, first of all, to tell stories that don't usually get told in cycling media. I say cycling media but mostly we mean men's cycling media, because all of media generally is still told, mostly, and sometimes exclusively, through a male voice, by a male voice.</span></p>\n<p><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/six-reasons-to-follow-women-s-cycling-in-2021\">Related: Six Reasons to Follow Women's Cycling in 2021</a></strong></em></p>\n<p><span style=\"font-weight: 400;\">It's a male narrative so that becomes the established norm and we think of the male narrative as being <em>the</em> narrative. And as a woman, certainly in journalism and writing and broadcasting that's not always a narrative that resonates with me. </span></p>\n<p><span style=\"font-weight: 400;\">It's not something that I feel you have to be hugely feminist about. Don’t get me wrong, I do not believe for one second that feminism is an ugly or dirty word, but it's more that I feel that there's much more richness to life. There's much more complexity to life if we look at the world through female eyes. It's the same but different, and I find that really fascinating. </span></p>\n<p><span style=\"font-weight: 400;\">That’s what I wanted to do with this issue. Firstly, to explore issues that are relevant to women that aren't necessarily relevant to men, but to tell those stories as much as possible, through the words and through the eyes of women. I hope by doing that, that it is not in any way exclusive to women because our readership is mostly men. </span></p>\n<p><span style=\"font-weight: 400;\">I would love to bring more women into sport in general and certainly into cycling, and I'm hoping that this is a more inspiring and welcoming space for women to be able to read about. </span></p>\n<p>But it's not confrontational, it's not 'this is how it is for women and men just don't understand.’ I hope that men pick up this issue and learn something and they have their eyes opened and the curtains gently drawn back on the reality of what life is like for a woman - because it's the same, but it's subtly and profoundly different. And I hope that we've managed to capture some of that.</p>\n<p><b>Ian Parkinson:</b><em> So can you give us some examples of the sort of thing you're talking about?</em></p>\n<p><span style=\"font-weight: 400;\"><strong>Orla Chennaoui:</strong> Well, what I think will be our lead feature is a conversation with former world champion Lizzie Deignan, Fran Millar, who was the CEO of Team INEOS and had been at Team Sky since its inception (she’s very recently moved off to Belstaff, the fashion chain, which is also owned by the INEOS group but she's been instrumental to the success of the Sky/INEOS team) and Monica Santini, the chief executive of the Santini cycling clothing brand.</span></p>\n<p><span style=\"font-weight: 400;\"><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Lizzie_Deignan_1024x1024.jpg?v=1609346618\" alt=\"\"></span></p>\n<p><em><span style=\"font-weight: 400;\">Lizzie Deignan in conversation with Orla, Fran Miller and Monica Santini will form one of issue 101's central features (Photo credit: </span>Alex Whitehead/SWpix.com)</em></p>\n<p><span style=\"font-weight: 400;\">We sat down together for the most wonderful evening of conversation where we just shared our experiences in the sport, what it was to be a woman and whether we thought it mattered and whether we thought it made a difference. </span></p>\n<p><span style=\"font-weight: 400;\">For each and every one of us it did make a difference mostly, in a positive way. Because cycling is still a very male world, even women's cycling is still mostly run by men, I think traditionally women see the female attributes that they bring into the male world as being inferior; compassion, kindness, sometimes more of a sense of fun. I'm being reductive here, of course - every individual is completely different. Actually, when you feel empowered enough to bring those to the male world, it really enriches and enhances it. </span></p>\n<p><span style=\"font-weight: 400;\">So we talked about whether we've encountered sexism, and what it is for myself, Lizzie and Monica to be a mother in the cycling world. Lizzie made some startling revelations. We also spoke about just where we are with women's cycling. </span></p>\n<p><span style=\"font-weight: 400;\">I would just encourage anybody to read that piece because it's very subtly a women’s piece. It's about the women's experience and I felt even as a woman who's been in this sport for a long time, I haven't had enough of these conversations yet. </span></p>\n<p><span style=\"font-weight: 400;\">I felt a shared kinship with everyone that you don't get whenever you speak to men. I'd urge people to read that article and I'd be fascinated to hear from male readers as to what they see as the differences between being a man in that world compared to being a woman in that world.</span></p>\n<meta charset=\"utf-8\">\n<p><strong><a href=\"https://www.rouleur.cc/pages/subscribe\" title=\"Subscribe\"><i>Subscribe to Rouleur now to receive Issue 101</i></a></strong></p>\n<p><span style=\"font-weight: 400;\">We also explored things that were very specifically related to being female. I did a feature on labial surgery and its rise, particularly amongst professional female cyclists. I was really shocked by the prevalence of labial issues in professional cycling. One specialist that I spoke to said that one in five professional endurance cyclists will have some sort of labial discomfort, swelling or growth that needs to be addressed in some way. </span></p>\n<p><span style=\"font-weight: 400;\">I just felt like: here’s an issue that we shy away from because it talks about the vagina, and we don't like to talk about vaginas. I don't see why we shouldn't be able to say that word and discuss the part of the anatomy that's very real to 50% of the population. </span></p>\n<p><span style=\"font-weight: 400;\">I wanted to write this article to try to put it out there that it's nothing to be embarrassed about, it's very common. I just feel like I had the freedom and the confidence to write that piece in a way that maybe I wouldn't have had. </span></p>\n<p><span style=\"font-weight: 400;\"><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Anna_Van_der_Breggen_Winning_World_Championships_1024x1024.jpg?v=1608745610\" alt=\"\"></span></p>\n<p><em><span style=\"font-weight: 400;\">Women's racing provided some of the most animated moments of 2020 in cycling, and promises <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/six-reasons-to-follow-women-s-cycling-in-2021\">an exciting 2021 ahead of us</a> </span></em><em><span style=\"font-weight: 400;\"><span>(Photo credit: </span>Alex Whitehead/<span class=\"skimlinks-unlinked\">SWpix.com</span>)</span></em></p>\n<p><span style=\"font-weight: 400;\">The under representation of women's cycling in the general cycling media is something that I find really quite sad to be honest, still, or at least increasingly unjustifiable. Whenever you watch a women's race next to a man's race - the World Championships usually - or if it's the women's edition of a men's race, the women's race is usually at least as good as the men's and often it is better. </span></p>\n<p><span style=\"font-weight: 400;\">This is not 'is women's cycling better than men cycling?', who cares. Cycling is cycling, great cycling is great cycling. But the point is: if you are competing in the woman's peloton, you're much less likely to have your victory or your surprising move or your fascinating life story reported on because you're a woman.</span></p>\n<p><span style=\"font-weight: 400;\">I would really love it if we just saw it with a bit more gender neutrality, whereby we're looking at amazing racing and we're looking at amazing characters and and we're doing our best to represent that, and to open up the sport to as wide an audience as possible. That’s not just women's cycling being pushed to a wider cycling audience, but cycling itself being pushed to a wider sporting audience. </span></p>\n<p><span style=\"font-weight: 400;\">People will say, 'oh, when's the men's issue, then?' I mean, just pick up any cycling magazine - there's your men's issue, you know there'll be one, maybe two articles at most on women's cycling. I think it is important to mark a sea change, not just a morph into it, not just to quietly segue into having more women's cycling in the issue.</span></p>\n<p><span style=\"font-weight: 400;\">I think in general, as a society, we need to do better at telling women's stories that we’re historically terrible at it. And women's stories and viewpoints just get lost in all of the noise. </span></p>\n<p>How much richer our lives and our our societies would be if we add another layer of fabric to it - the tapestry of life becomes so much more beautiful. I think that's hopefully what this issue will do.</p>\n<p><em><strong>This interview originally appeared in Rouleur Conversations, which you can listen to <a href=\"https://www.rouleur.cc/blogs/the-rouleur-podcast/rouleur-conversations-podcast-orla-chennaoui-and-andy-mcgrath-on-issue-100-and-more\" target=\"_blank\" title=\"Podcast\" rel=\"noopener noreferrer\">here.</a></strong></em></p>\n<div class=\"klaviyo-form-UFKPji\"></div>\n    ","author":"Miles Baker-Clarke","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"c28d1a68ca714fe52d3c40ae418cc1a9a516e62b50604b8b1e9d3d8582048a75","category":"Cycling"}