{"title":"Neo-Pros to Watch in 2021","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/neo-pros-to-watch-in-2021","date":1608657826000,"content":"\n      <p>As seasons come and go, the pro peloton sees neo-pros rise to join the professionals, filling the void left by those retiring or leaving the sport. It’s the circle of life that gives new energy to the sport, and never more so than in recent years. </p>\n<div class=\"klaviyo-form-Ymj3Vm\"></div>\n<p><span style=\"font-weight: 400;\">Whether we look at Marc Hirschi, </span><span style=\"font-weight: 400;\">João Almeida, or any of the other </span><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/rouleurs-review-of-the-season-breakthroughs-of-2020\" title=\"Breakthrough riders\"><span style=\"font-weight: 400;\">breakthrough riders of 2020</span></a><span style=\"font-weight: 400;\">, there can be no doubt that young riders are becoming more competitive than ever before. That is no different with the season ahead, with a plethora of exciting talent transitioning to the World Tour in 2021.</span></p>\n<h4><strong>Tom Pidcock: Ineos Grenadiers</strong></h4>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/PB2_0111_1024x1024.jpg?v=1608657034\" alt=\"\"></p>\n<meta charset=\"utf-8\">\n<p><em>(Credit: Pauline Ballet/SWpix.com)</em></p>\n<p><span style=\"font-weight: 400;\">It would be nonsensical to begin with anyone other than </span><b>Tom Pidcock</b><span style=\"font-weight: 400;\">. The Brit has garnered by far the largest reputation of any neo-pro entering the pro peloton in 2021, and is set to join the INEOS Grenadiers.</span></p>\n<p><span style=\"font-weight: 400;\">In 2019, Pidcock added to his profile by winning Paris-Roubaix Espoirs, where recent winners include Filippo Ganna and Bob Jungels. He was also victorious at the Tour Alsace, winning a stage on La Planche des Belles Filles in the process. By winning on both cobbles and steep climbs, Pidcock was displaying his versatility early on.</span></p>\n<p>The Yorkshireman resisted the temptation of joining the World Tour in 2020, opting to focus on his development with Trinity Racing. After a commanding performance at the Baby Giro, which saw him win three stages and the GC, he arrived in Imola for the World Championships with great expectations. He was protected by the likes of Luke Rowe throughout the race, but ended 10 minutes down in 42nd. Adding to his results on the road, Pidcock is a cyclo-cross star. The former under-23 world champion recently defeated Mathieu van der Poel at Superprestige Gavere - a clear sign of his ability - and has rainbow stripes in the mountain bike discipline too. He can basically do it all.</p>\n<p>Pidcock will join the Grenadiers in March once the cyclo-cross season concludes, with the likes of Richie Porte and Adam Yates also coming on board for 2021.</p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tom-pidcock-that-s-entertainment\"><strong><em>Related – Tom Pidcock: That's Entertainment</em></strong></a> </p>\n<h4><strong>Marco Brenner: Team DSM</strong></h4>\n<p><span style=\"font-weight: 400;\"><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Brenner_1024x1024.jpg?v=1608656001\" alt=\"\"></span></p>\n<p><span style=\"font-weight: 400;\"><i>Marco Brenner on his way to the bronze medal at the Men's Junior World Championships ITT in Harrogate, September 2019 (Credit: </i></span><i><span>Zac Williams/SWpix.com)</span></i></p>\n<p><span style=\"font-weight: 400;\">After rising quickly through the junior ranks at Team Auto Eder Bayern, Marco Brenner has been snapped up by Team DSM (previously Team Sunweb). </span></p>\n<p><span style=\"font-weight: 400;\">Brenner ascended to prominence in 2019, winning races such as the Tour du Pays de Vaud and Oberösterreich Juniorenrundfahrt. His season culminated with a good performance in Harrogate at the Men's Junior World Championships. He finished third in the time-trial, where he was at least 12 months younger than anyone else in the top 5. Brenner showed his continued development in 2020, finishing in the top 5 in both the road race and time-trial at the Junior European Championships in Plouay.</span></p>\n<p><span style=\"font-weight: 400;\">His four-year deal with Team DSM runs until the end of 2024, a strong signal of faith from the team. At the tender age of 18, he should be afforded time to adapt to life with the pros and cultivate his craft. The good news for Brenner is that time is well and truly on his side.<br></span></p>\n<h4><strong>Megan Jastrab: Team DSM</strong></h4>\n<p><span style=\"font-weight: 400;\"><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Jastrab_1024x1024.jpg?v=1608656104\" alt=\"\"></span></p>\n<p><i><span style=\"font-weight: 400;\">Jastrab sprints to victory at the 2019 Women's Junior World Championships in Harrogate (Credit: Alex Whitehead/SWpix.com)</span></i></p>\n<p>Megan Jastrab has not raced a single day on the road in 2020, yet she is set to enter the Women’s World Tour with Team DSM, impressing the German team enough to hand her a 2-year contract.</p>\n<p><span style=\"font-weight: 400;\">It’s for good reason, too. Jastrab had a dominant 2019 season in the junior ranks, which concluded with victory at the Women's Junior World Road Race in Harrogate. Additionally, Jastrab is something of a track specialist – she is the current Junior World Champion in both the Madison and Omnium.</span></p>\n<p><span style=\"font-weight: 400;\">A quieter year was forced upon her in 2020, but with her WWT debut approaching, she should be one to watch, particularly in bunch sprint finishes.</span></p>\n<h4><strong>Olav Kooij: Team Jumbo-Visma</strong></h4>\n<p><span style=\"font-weight: 400;\"><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Kooij-viaTJV_1024x1024.jpg?v=1608656240\" alt=\"\"></span></p>\n<p><i><span style=\"font-weight: 400;\">Olav Kooij transitions to the World Tour after spending 2020 with the Jumbo-Visma Development Team.</span></i></p>\n<p>Olav Kooij<span style=\"font-weight: 400;\"> will be one of the youngest riders in the World Tour in 2021; he only turned 19 in October. He makes the step up with Jumbo-Visma, after an impressive season with their development team.</span></p>\n<p><span style=\"font-weight: 400;\">He has already won UCI races in Croatia, Slovenia, Poland, and Italy. His most impressive result came at the Coppi e Bartali, a 2.1 category race, where he sprinted to victory against the likes of Phil Bauhaus, Andrea Pasqualon and Ethan Hayter.</span></p>\n<p><span style=\"font-weight: 400;\">The Dutch sprinter has the potential to compete in World Tour sprints already, and in an increasingly GC-centric team, he could be given the chance to sprint for himself following an arduous year for Dylan Groenewegen.</span></p>\n<h4><strong>Kevin Vermaerke: Team DSM</strong></h4>\n<p><span style=\"font-weight: 400;\"><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Vermaerke_1024x1024.jpg?v=1608656355\" alt=\"\"></span></p>\n<p><span style=\"font-weight: 400;\"><i>Vermaerke pulls a turn in the breakaway at the 2019 Tour de Yorkshire (Credit: Alex Broadway/SWpix.com)</i></span></p>\n<p>Kevin Vermaerke is another neo-pro to join Team DSM in 2021, after he was signed from talent factory Hagens Berman Axeon. The American outfit led by Axel Merckx has produced an abundance of strong riders over recent years, namely Tao Geoghegan-Hart, Ruben Guerreiro, Jasper Philipsen and João Almeida.</p>\n<p><span style=\"font-weight: 400;\">Vermaerke’s former team is not all he has in common with the Portugese Giro star. They both enter the World Tour having won the under-23 Liège-Bastogne-Liège. The race is one of the most coveted in the category, and other former winners include Michael Valgren and Guillaume Martin.</span></p>\n<p><span style=\"font-weight: 400;\">Further adding to Vermaerke’s CV, the American has already acquired plenty of experience racing against World Tour opposition. He performed well at the Tour of Utah and Tour de Yorkshire in 2019, and finished 14th at the Tour de Wallonie in 2020, a race that included nine World Tour teams.</span></p>\n<p><span style=\"font-weight: 400;\">Vermaerke’s promise on hilly terrain is undisputed. Initially, he’s likely to ride in support of Marc Hirschi, Romain Bardet and Tiesj Benoot, but his results suggest he could quickly become a prominent rider for Team DSM.</span></p>\n<h4><strong>Shirin van Anrooij: Trek-Segafredo Women</strong></h4>\n<p><span style=\"font-weight: 400;\"><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/VanAnrooij_1024x1024.jpg?v=1608656449\" alt=\"\"></span></p>\n<p><span style=\"font-weight: 400;\"><i>Van Anrooij on her way to the silver medal at the Women's Junior World Champs ITT in 2019 (Credit: Alex Broadway/SWpix.com)</i></span></p>\n<p><span style=\"font-weight: 400;\">18-year-old Shirin van Anrooij joins the Women's World Tour on a permanent basis in 2021, after joining Trek-Segafredo Women as a stagiaire for the final months of the 2020 season.</span></p>\n<p><span style=\"font-weight: 400;\">This comes after she displayed a multitude of impressive performances in the junior ranks, predominantly in the time-trial discipline. In 2019, she won three of the four individual-time-trials she started, only missing out on the World Championships by four seconds after winning both the Dutch and European Championships.</span></p>\n<p><span style=\"font-weight: 400;\">Adding to her ever-growing palmarès on the road, Van Anrooij is the current women's junior world champion in cyclo-cross. She suffered a nasty arm injury at the 'cross World Cup in November, but once fully recovered, she will undoubtedly be one to watch for 2021.</span></p>\n<h4><strong>Jonathan Milan: Bahrain - Victorious</strong></h4>\n<p><span style=\"font-weight: 400;\"><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Milan_1024x1024.jpg?v=1608656638\" alt=\"\"></span></p>\n<p><i><span style=\"font-weight: 400;\">Jonathan Milan racing at the 2020 UEC European Track Championships (Credit: Alex Whitehead/SWpix.com)</span></i></p>\n<p><span style=\"font-weight: 400;\">Standing at just under 2 metres, Jonathan Milan is a powerful rider who excels at both sprinting and time-trialing. His hometown nickname demonstrates this perfectly - ‘The Giant of Buja’. Still not sold on his ability? Let's examine his track record.</span></p>\n<p><span style=\"font-weight: 400;\">2020 was an encouraging year for Milan. After obliterating his opposition in the Italian U23 ITT, he finished in the top 5 at the European U23 ITT, despite being just 19. He also showed his sprinting prowess by winning stage 5 of the Baby Giro in a bunch kick. Further, he displayed his strength on the track by winning three medals at the UEC European Track Championships.</span></p>\n<p><span style=\"font-weight: 400;\">He joins Bahrain - Victorious (formerly Bahrain - McLaren), where he will split his workload between the track and the road in 2021, focusing on the Olympics in Tokyo.</span></p>\n<h5><span style=\"font-weight: 400;\">Riders that just missed our list:</span></h5>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Diego Camargo - EF Education - Nippo</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Juan Ayuso - UAE-Team Emirates</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Neve Bradbury - Canyon SRAM Racing</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Xandres Vervloesem - Lotto Soudal</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">David Dekker - Team Jumbo-Visma</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Daniela Campos - Bizkaia Durango</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Harry Sweeny - Lotto Soudal</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Andrea Piccolo - Astana - Premier Tech</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Javier Romo - Astana - Premier Tech</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Clara Honsinger - Team TIBCO - SVB</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Jordi Meeus - BORA - hansgrohe</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Giovanni Aleotti - BORA - hansgrohe</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Sebastian Berwick - Israel Start-Up Nation</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Daniel Arroyave -  EF Education - Nippo</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Mauro Schmid - Team Qhubeka ASSOS</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Kevin Colleoni - GreenEDGE Cycling</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Ben Zwiehoff - BORA - hansgrohe </span></li>\n</ul>\n<div class=\"klaviyo-form-UFKPji\"></div>\n    ","author":"Miles Baker-Clarke","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"c36c080c2eca71ab1061d25a6e008e134463fee742e16527a297905a50bf9adc","category":"Cycling"}