{"title":"From the Top: How 7Mesh was built","link":"https://cyclingtips.com/2021/01/from-the-top-how-7mesh-was-built/","date":1611537338000,"content":"<p>In this episode we speak to the three co-founders of apparel brand, <a href=\"https://7mesh.com/\" target=\"_blank\" rel=\"noreferrer noopener\">7Mesh</a>. </p>\n\n\n\n<p>Getting into the cycling apparel business could now be one of the lowest barrier-to-entry segments in the industry. Anyone with an Instagram account and some design ability can source directly from factories in Italy or China and create a clothing ‘brand’ these days.</p>\n\n\n\n<p>That’s not to say some don’t break through and create legitimate and worthy businesses this way – I know a few first-hand who have. This low barrier to entry has enabled some wonderful brands to get started and flourish. But because of this it is now a crowded market, and it’s tough to discern who&#8217;s doing great work and innovating, and who&#8217;s just pumping out disposable fashion.</p>\n\n\n\n<p>From the moment I first discovered 7Mesh I knew this was going to be something different. </p>\n\n\n\n<iframe style=\"border: none; padding-top:20px; padding-bottom:20px;\" src=\"//html5-player.libsyn.com/embed/episode/id/17672861/height/90/theme/custom/thumbnail/yes/direction/backward/render-playlist/no/custom-color/ef444e/\" height=\"90\" width=\"90%\" scrolling=\"no\" allowfullscreen=\"\" webkitallowfullscreen=\"\" mozallowfullscreen=\"\" oallowfullscreen=\"\" msallowfullscreen=\"\"></iframe>\n\n\n\n<p>For those who don’t know, 7Mesh is an apparel brand based in Squamish, Canada which makes top quality apparel made for the demands of mountain biking, gravel and road.</p>\n\n\n\n<p>The three founders, Tyler Jordan (you’ll hear him often being referred to as TJ), Ian Martin and Calumn Davidson aren’t three people who randomly got together to do a passion project. They were three early staff members and integral to the success of outdoor clothing juggernaut, Arcteryx.</p>\n\n\n\n<p>Tyler was the CEO, Ian was VP of product, and Calum Davidson was head of operations – and all were (and still are) nuts for cycling. They were also great friends in their days at Arcteryx and were having fun, pushing boundaries, and getting shit done.</p>\n\n\n\n<p>But as the saying goes, all good things come to an end and as the three oversaw tremendous growth in the business they all gave everything up to go off on their own and create something from scratch.</p>\n\n\n\n<p>To tell the story of 7Mesh, we need to get to know Tyler, Calum and Ian in their early days at <a rel=\"noreferrer noopener\" href=\"https://arcteryx.com/ca/en/\" target=\"_blank\">Arcteryx</a> …</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cyclingtips.com/2021/01/from-the-top-how-7mesh-was-built/\">From the Top: How 7Mesh was built</a> appeared first on <a rel=\"nofollow\" href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Wade Wallace","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"c3819f944f73e05582b3a616dd80941cdb2252c93fa8a3cc99fb5cc81670c53c","category":"Cycling"}