{"title":"Brad Cox, Creator of Objective-C, Dies at 77","link":"https://www.legacy.com/us/obituaries/scnow/name/brad-cox-obituary?pid=197454225","date":1611369153000,"content":"\n<p>From an obituary published January 8:</p>\n\n<blockquote>\n  <p>The late Steve Jobs’ NeXT licensed the Objective-C language for\nits new operating system, NeXTStep. NeXT eventually acquired\nObjective-C from Stepstone. Objective-C continued to be the\nprimary programming language for writing software for Apple’s OS X\nand iOS.</p>\n</blockquote>\n\n<p>What a lovely story:</p>\n\n<blockquote>\n  <p>He and his wife, Etta, enjoyed traveling for leisure, as well, and\nvisited the Caribbean often as they both enjoyed scuba diving.\nBelize especially held fond memories for them. On one scuba diving\nexcursion while in the compound having lunch, Brad engaged a\ncouple from Germany in conversation. Brad asked about the fellow\ntraveler’s occupation and discovered he was a computer programmer.\nLikewise, Brad was asked about his life’s work and stated “I am\nalso a computer programmer.” “What do you do?” Brad was asked. “I\nwrote Objective-C.” Astonished, the gentleman said, “No, Brad Cox\nwrote that.” “Hi, I am Brad Cox”, was the response and the\nintroduction. Needless to say, much conversation ensued after the\nscuba diving concluded.</p>\n</blockquote>\n\n<p>It’s simply impossible to overstate how influential Cox and his masterpiece, Objective-C were. I wouldn’t begin to claim to be an expert on Objective-C, but I know enough to see how it was more than a language. It was a language — a thin layer of syntax on top of C — <em>but also</em> embodied the idea of a dynamic runtime. The result was a language that ran fast like C but enabled programmer expressiveness and introspection like <a href=\"https://en.wikipedia.org/wiki/Smalltalk\">Smalltalk</a>. Running fast like C is always a good thing, but it was essential on the slow desktop hardware of the ’80s and ’90s — and then, once again, on the slow mobile hardware of the early iPhone era. Smalltalk-inspired expressiveness is what makes Objective-C great for writing nontrivial applications. No other language of the era achieved such a balance.</p>\n\n<p>Great programming languages are great for writing certain types of software. Objective-C is great for writing apps and app frameworks. Turns out that made for a great language — and an enormous competitive advantage for the one company that banked its entire software stack on it.</p>\n\n<div>\n<a  title=\"Permanent link to ‘Brad Cox, Creator of Objective-C, Dies at 77’\"  href=\"https://daringfireball.net/linked/2021/01/22/brad-cox-rip\">&nbsp;★&nbsp;</a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"c4b0fddc3339b54c9ddc9358682008a41e1ad0411916f56682dae56416d03de1","category":"Tech"}