{"title":"Philippe Gilbert: The Road to Recovery, Dreaming of San Remo","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/philippe-gilbert-the-road-to-recovery-dreaming-of-san-remo","date":1610469133000,"content":"\n      <p><span style=\"font-weight: 400;\">Last year was an unconventional year for cycling. The Tour of Flanders took place in October, Paris-Roubaix was cancelled entirely, and for the first time in his professional career Philippe Gilbert failed to win a race.</span></p>\n<div class=\"klaviyo-form-Ymj3Vm\"></div>\n<p><span style=\"font-weight: 400;\">Gilbert looked to be building his season in resolute fashion when he was beaten to the line by Arnaud Démare in the final stage of the Tour de Wallonie. He had been strong but innocuous by his standards pre-lockdown, and the second-place finish was his best of the season to that point. It had come at the right moment too, with the Tour de France’s </span><span style=\"font-weight: 400;\">Grand Départ</span><span style=\"font-weight: 400;\"> imminent.</span></p>\n<p><span style=\"font-weight: 400;\">The riders set off from Nice in cloudy conditions which quickly became treacherous – so much so, teams decided a neutralisation was necessary with just over 50km remaining. However, it didn’t prevent a batch of riders hitting the deck, including Gilbert. He would fight on to finish the stage, but a fractured patella forced him to abandon before the race had reached second gear.<br></span></p>\n<p><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/wout-van-aert\">Related – Wout van Aert: Comeback Kid</a> <br><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/cycling-transfers-2021-the-smartest-moves\">Related – Cycling Transfers 2021: The Smartest Moves</a> <br><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/philippe-gilbert-classics-king-and-flanders-champion\">Related – Philippe Gilbert: Classics King And Flanders Champion</a></strong></em></p>\n<p><span style=\"font-weight: 400;\">It was not the first time Gilbert has suffered such an injury – whilst descending the Col de Portet d'Aspet at the 2018 Tour de France, Gilbert clattered a roadside wall which catapulted him into a ditch. As he did two years later, the Belgian picked himself up and battled on to finish the stage before abandoning the race. The image of a bloodied Gilbert climbing out of a ditch to continue racing couldn't better embody the sheer toughness of professional cycling.</span></p>\n<p><span style=\"font-weight: 400;\">Gilbert has been working hard to recover and prepare ahead of the 2021 season. “I am okay. I have done a lot of work over the last few weeks to get my knee better. Now, I can almost pedal without pain which is an important first step,” said Gilbert after arriving at the Lotto Soudal training camp in Xàbia, Spain. “Today is my first time with a big group of riders where I can make comparisons. I felt good. Still, it is very different to racing, so I cannot be sure of my shape.”</span></p>\n<p><span style=\"font-weight: 400;\"><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/PRESSESPORTS_579856_cycle-22_1024x1024.jpg?v=1610468311\" alt=\"\"></span></p>\n<p><em><span style=\"font-weight: 400;\">Gilbert after his 2019 win at Paris-Roubaix</span></em></p>\n<p><span style=\"font-weight: 400;\">He went on to give further details on the difficulties he has faced in his recovery. “The injury was a lot worse than expected, I faced a lot of problems with my knee and I lost a lot of muscles in both legs which meant I pretty much restarted from zero. </span></p>\n<p><span style=\"font-weight: 400;\">“In the first week, I was really at the level of someone that has just started cycling.”</span></p>\n<p><span style=\"font-weight: 400;\">Gilbert plans on commencing his 2021 campaign (a year in which he will turn 39) in France with the Grand Prix la Marseillaise, Etoile de Bessèges and the Tour de la Provence – his first opportunity to gauge his level. He then intends to race Omloop het Nieuwsblad and Paris-Nice. However, Gilbert remains wary as races continue to succumb to the pandemic – the Challenge Majorca and Vuelta a Murcia have recently been postponed until May. </span></p>\n<p><span style=\"font-weight: 400;\">“There is always a possibility that races will be cancelled. Until we arrive at the race the day before and are given our race numbers, we cannot be certain to race these days.”</span></p>\n<p><span style=\"font-weight: 400;\">Despite uncertainties regarding the race calendar, Gilbert spoke openly about his ambitions for the season, where he aims to be ready for Milan-San Remo. Gilbert is the only rider in the pro peloton to have won four of the five monuments. Milan-San Remo is the only race still missing from his palmarès. </span></p>\n<p><span style=\"font-weight: 400;\">“It’s a dream. I don’t know if it will be possible this year, but in my head it is there. It is my motivation to go training every day and make the sacrifices to try and become stronger.” Gilbert was unable to hide his fervor when speaking about the race, “I am always thinking about San Remo. I know it’s so important, I know if I can do that it will change my career.” </span></p>\n<p><span style=\"font-weight: 400;\">Gilbert’s achievements already mean he’ll go down as one of the greatest classics riders of his generation; winning four of cycling’s five monuments is a historic accomplishment. However, winning Milan-San Remo would cement his name among the all-time greats.</span></p>\n<p><span style=\"font-weight: 400;\">Rik Van Looy, Eddy Merckx and Roger De Vlaeminck are the only riders to have completed the Grand Slam, with De Vlaeminck most recently completing the set when he won the Tour of Flanders in 1977. </span></p>\n<p><span style=\"font-weight: 400;\">Becoming the fourth member of the prestigious group, with the 39-year-old's recovery still ahead of him, will demand considerable perseverance and grit. But having finished two stages on a broken knee, that seems to be one trait Gilbert has shown in abundance.</span></p>\n<div class=\"klaviyo-form-UFKPji\"></div>\n    ","author":"Miles Baker-Clarke","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"c6ff82ef4bf426293b04fdea45231237a0f7d28c693ac1411844bc4583ef4fe4","category":"Cycling"}