{"title":"Ori and the Blind Forest","link":"https://markpeak.net/ori-and-the-blind-forest/","date":1610900980000,"content":"<p>ถ้าถามว่าแนวเกมที่ชื่นชอบคืออะไร น่าจะมีอยู่ 3 แนวหลักๆ คือ platformer, J-RPG และ turn-based แต่ถ้าถามว่าเกมแนวไหนที่เป็น defining ตัวตนอย่างจริงจังก็ต้องเป็น platformer นี่แหละ (โดยเฉพาะ Mario และ Rockman)</p>\n<p>โลกยุค 3D มีแนวเกมอื่นๆ ให้เล่นมากมาย ทำให้ความสำคัญของเกม 2D platformer ลดลงไป (และไปโตในสายอินดี้แทน ในเกมจำพวก metroidvania)</p>\n<p>แต่ช่วงหลายปีให้หลังก็มีเกม 2D platformer ที่น่าสนใจอย่าง Ori and the Blind Forest ของ Moon Studios จากออสเตรีย ที่เป็นเกมแบบ 2D ด้วยกราฟิก 3D</p>\n<p>Ori and the Blind Forest ออกมาตั้งแต่ปี 2015 และดังมานานแล้ว แถมเคยซื้อมาบน Steam มานานแล้วแต่ไม่มีโอกาสได้เล่น (ดองนั่นเอง) จนออกภาคสองคือ Ori and the Will of the Wisps ในปี 2020 ที่ได้เสียงชื่นชมมากกว่าเดิม ดูเทรลเลอร์แล้วน่าสนใจเลยไปขุดเกมภาคแรก</p>\n<p>ทยอยเล่นในช่วงปีใหม่วันละประมาณ 1 ชั่วโมงจนจบ (ใช้เวลาจบเนื้อเรื่องหลักราว 10 ชั่วโมง เก็บดันเจี้ยนเสริมและเก็บของให้ได้ครบเกือบทุกอย่าง 99% จนหายคาใจอีกประมาณ 3 ชั่วโมง ความยากระดับ Normal) พอจบแล้วก็ได้เวลามาเขียนถึงสักที (ช้าไป 6 ปี)</p>\n<p><iframe class='youtube-player' width='700' height='394' src='https://www.youtube.com/embed/cklw-Yu3moE?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent' allowfullscreen='true' style='border:0;' sandbox='allow-scripts allow-same-origin allow-popups allow-presentation'></iframe></p>\n<p>Ori and the Blind Forest เป็นเรื่องของภูติแห่งแสง (ชื่อ Ori ตัวขาวๆ ในรูป) ที่หลุดกระเด็นออกมาจากต้นไม้ศักดิ์สิทธิ์ที่กำลังจะตาย เลยต้องออกผจญภัยเพื่อฟื้นฟูชีวิตของต้นไม้ศักดิ์สิทธิ์กลับมา</p>\n<p>พล็อตของ Ori ออกจะงงๆ เล็กน้อย (และมี twist ด้วยนิดหน่อย) ถ้าจะมีประเด็นให้ติก็เป็นเรื่องพล็อตนี่แหละ ที่เล่าได้ไม่ค่อยน่าสนใจนัก (ใช้วิธีเล่าผ่าน text dialogue สั้นๆ) และเล่นมาจนจบผมก็จำชื่อตัวละครอื่นนอกจาก Ori ไม่ได้เลย</p>\n<p>ส่วนเกมเพลย์ มีความใกล้เคียงกับ Rockman X เป็นอย่างมาก เพราะ Ori มีเพื่อนเป็นลูกแก้วศักดิ์สิทธิที่ทำหน้าที่ &#8220;ยิงแสง&#8221; โจมตีให้ (แถมเป็นการยิงแบบวิ่งหาศัตรูให้เอง ไม่ได้ยิงเป็นแนวตรง) และมีความสามารถในการเหาะเหินเดินอากาศมากมาย เช่น เกาะกำแพง กระโดดสูง กระโดดสองชั้น แดชกลางอากาศ ร่อนขนนก ฯลฯ รวมถึงท่าที่ยากที่สุดคือ &#8220;Bash&#8221; หรือการกระโดดไปเจอลูกไฟศัตรูที่ลอยกลางอากาศแล้วเปลี่ยนทางของตัวเรา ที่ฝึกอยู่นานกว่าจะใช้ออกคล่อง</p>\n<p>ความยากของเกมจึงไม่ได้อยู่ที่การโจมตีศัตรูสักเท่าไร แต่เป็นการออกแบบเลเวลที่ทำให้เราต้อง &#8220;เหาะเหินเดินอากาศ&#8221; ด้วยท่าต่างๆ ตามความสามารถที่ค่อยๆ เรียนรู้เพิ่มเติมไปตลอดเกม หลายฉากเราต้องฝ่าดงหนามที่แทบไม่มีจุดให้ยืนเลย ถือเป็นพัซเซิลที่ต้องใช้ความคิด ผสมกับรีแอคชั่นของการกดปุ่มหลายๆ ปุ่มไปพร้อมกัน (ก็ยังดีที่สมัยวัยรุ่นเล่นเกมแนวนี้มาเยอะ พอเอาตัวรอดได้)</p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-2095\" src=\"https://markpeak.net/wp-content/uploads/2021/01/ori-water-scene.jpg\" alt=\"\" width=\"900\" height=\"506\" srcset=\"https://markpeak.net/wp-content/uploads/2021/01/ori-water-scene.jpg 900w, https://markpeak.net/wp-content/uploads/2021/01/ori-water-scene-300x169.jpg 300w, https://markpeak.net/wp-content/uploads/2021/01/ori-water-scene-768x432.jpg 768w, https://markpeak.net/wp-content/uploads/2021/01/ori-water-scene-700x394.jpg 700w\" sizes=\"(max-width: 900px) 100vw, 900px\" /></p>\n<p>เวิลด์ของ Ori เป็นธรรมชาติที่หลากหลาย เช่น ป่าดิบชื้น หุบเขา ต้นไม้ยักษ์ หนองบึง ภูเขาไฟ ช่องโพรง ฯลฯ กราฟิกทำได้สวยงามมากๆ (ถือเป็นจุดเด่นของเกมนี้เลย) แถมการที่กราฟิกเป็น 3D ยังช่วยเพิ่มลูกเล่นให้หลายๆ ฉาก เช่น การเดินเปลี่ยนจุดจะทำให้เลเยอร์ของฉากเอียงไปจากปกติบ้าง อย่างฉากน้ำตามภาพข้างบน</p>\n<p>การออกแบบฉากใน Ori ก็น่าสนใจเพราะเป็นฉากใหญ่ฉากเดียวที่เดินต่อกันได้หมด (มีระบบวาร์ปช่วยให้เดินลัดได้) และมีการซ่อนปริศนา ซ่อนของต่างๆ เอาไว้มากมาย ที่เราต้องย้อนกลับมาเอาในภายหลังเมื่อได้ความสามารถบางอย่างแล้ว (เช่น กระทืบพื้น หรือ กระโดดสูง) ภาพรวมถือว่าท้าทายเมื่อเผชิญสถานการณ์เฉพาะหน้า และเพลินไปกับการสำรวจโลกของ Ori แบบกว้างใหญ่</p>\n<p>เนื้อเรื่องของ Ori แบ่งออกเป็น 3 องค์หลักๆ ตามสิ่งที่ต้องไปฟื้นฟูให้กลับสภาพเดิม ได้แก่ น้ำ ลม และไฟ ที่เป็นฉากสุดท้าย ข้อเสียอีกอย่างที่ผมพบคือเกมนี้ไม่มี Boss Fight ทำให้ไปไม่สุดเท่าที่ควรจะเป็น (ตามเนื้อเรื่องมันควรมี Boss Fight ซึ่งก็มีนะแต่อยู่ในภาค 2) ตอนจบของแต่ละองค์จะกลายเป็นฉาก Great Escape หนีออกจากสภาพแวดล้อมในฉากนั้น โดยมีระยะเวลาที่จำกัดแทน (บางอันก็ยากมาก ต้องกดเก่ง จังหวะเป๊ะจริงๆ ตายเป็นหลายสิบตัว ผมเล่นจบด้วยการตายไป 500 ตัวได้)</p>\n<p>ภาพรวมคือสนุกและประทับใจมาก แถมจะตามไปเล่นภาค 2 ต่อไป</p>\n<p>ให้คะแนน 9/10</p>\n<ul>\n<li>ภาพสวย เกมเพลย์ดี ออกแบบฉากน่าสนใจ</li>\n<li>หักเรื่องการเล่าเรื่อง และการไม่มีบอส</li>\n</ul>\n<p>ทริคเดียวในเกมนี้ที่แนะนำคือ ขยันเซฟบ่อยๆ เพราะเกมนี้เซฟจากตรงไหนก็ได้ (ยกเว้นตรงที่มีศัตรู) โดยใช้พลังงาน 1 ขีดซึ่งแชร์กับพลังงานที่ใช้ชาร์จลูกแก้วให้ระเบิดได้ เพราะเกมค่อนข้างยาก และเรามักไปตายกับหลุม หนาม หรือกับดักโดยไม่รู้ตัวเอาง่ายๆ พอต้องเดินใหม่ไกลๆ ก็น่าหงุดหงิดบ้างเหมือนกัน</p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-2093\" src=\"https://markpeak.net/wp-content/uploads/2021/01/ori-screen.jpg\" alt=\"\" width=\"900\" height=\"506\" srcset=\"https://markpeak.net/wp-content/uploads/2021/01/ori-screen.jpg 900w, https://markpeak.net/wp-content/uploads/2021/01/ori-screen-300x169.jpg 300w, https://markpeak.net/wp-content/uploads/2021/01/ori-screen-768x432.jpg 768w, https://markpeak.net/wp-content/uploads/2021/01/ori-screen-700x394.jpg 700w\" sizes=\"(max-width: 900px) 100vw, 900px\" /></p>\n<p>เกมมีให้เล่นบน Xbox, PC, Switch โดยเวอร์ชันที่เล่นคือ PC (Steam) ด้วยจอย Xbox One</p>\n<p>หมายเหตุ: เกมเวอร์ชันที่เล่นเป็น Definitive Edition เพิ่มดันเจี้ยนลับมาอีก 2 ฉาก และทักษะเพิ่มอีก 2 อย่าง ซึ่งเกมออกมาภายหลัง (ปี 2016) และอาจไม่มีคู่มือหรือทริคในอินเทอร์เน็ตมากเท่ากับเกมภาคต้นฉบับในปี 2015</p>The post <a href=\"https://markpeak.net/ori-and-the-blind-forest/\">Ori and the Blind Forest</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"cb02bc7969d1d31a1db1b68b6232ab63d6ad47ebccf76737af209137dbc0d7f8","category":"Thai"}