{"title":"Valve’s Gabe Newell imagines “editing” personalities with future headsets","link":"https://arstechnica.com/?p=1737116","date":1611585208000,"content":"<div id=\"rss-wrap\">\n<figure class=\"intro-image intro-left\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/01/gabe-newell-brain-listing-800x494.jpg\" alt=\"An artist's interpretation of how future &lt;em&gt;Dota 2&lt;/em&gt; tournament trophies might look if Valve chief Gabe Newell pushes any further into brain-computer interface (BCI) research.\"><p class=\"caption\" style=\"font-size:0.8em\"><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/01/gabe-newell-brain-listing.jpg\" class=\"enlarge-link\" data-height=\"2101\" data-width=\"3403\">Enlarge</a> <span class=\"sep\">/</span> An artist's interpretation of how future <em>Dota 2</em> tournament trophies might look if Valve chief Gabe Newell pushes any further into brain-computer interface (BCI) research. (credit: Getty Images / David Jackmanson / Sam Machkovech)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>For years, the open secret at Valve (makers of game series like <em>Half-Life</em> and <em>Portal</em>) has been the company's interest in a new threshold of game experiences. We've seen this most prominently with <a href=\"https://arstechnica.com/tag/steamvr\">SteamVR</a> as a virtual reality platform, but the game studio has also openly teased its work on \"<a href=\"https://arstechnica.com/tag/brain-computer-interface/\">brain-computer interfaces</a>\" (BCI)—meaning, ways to read brainwave activity to either control video games or modify those experiences.</p>\n<p>Most of what we've seen from Valve's skunkworks divisions thus far, particularly at <a href=\"https://www.youtube.com/watch?v=Qhj3C1H5JWo\">a lengthy GDC 2019 presentation</a>, has revolved around reading your brain's state (i.e., capturing nervous-system energy in your wrists before it reaches your fingers, to reduce button-tap latency in twitchy shooters like Valve's <em>Counter-Strike</em>). In <a href=\"https://www.tvnz.co.nz/one-news/new-zealand/gabe-newell-says-brain-computer-interface-tech-allow-video-games-far-beyond-human-meat-peripherals-can-comprehend\">a Monday interview with New Zealand's 1 News</a>, Valve co-founder Gabe Newell finally began teasing a more intriguing level of BCI interaction: one that changes the state of your brain.</p>\n<p>\"Our ability to create experiences in people's brains, that aren't mediated through their meat peripherals [<em>e.g., fingers, eyes</em>], will be better than is [currently] possible,\" Newell asserts as part of his latest 12-minute video interview. Later, he claims that \"the real world will seem flat, colorless, and blurry compared to the experiences that you'll be able to create in people's brains.\"</p></div><p><a href=\"https://arstechnica.com/?p=1737116#p3\">Read 17 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1737116&comments=1\">Comments</a></p>","author":"Sam Machkovech","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"cb46f5b44d1e442ca5b6b696fc651ed028006ec790ceddd7b608aaf6bf03a395","category":"Tech"}