{"title":"When Zwift met Mathieu van der Poel: Watopian Ideals","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/watopian-ideals-mathieu-van-der-poel-does-zwift","date":1609257008000,"content":"\n      <div class=\"klaviyo-form-Ymj3Vm\"></div>\n<p>In a west London film studio, dozens of crew scurry back and forth, while as many again watch the action unfolding in front of them on the set. It’s hard to say who is doing what. “Cut!” the director calls, and there is an extra flurry of activity as the next set up is prepared. </p>\n<p>A perusal of the day’s call sheet is an eye opener, a clue to why so many people are milling around. Directors, producers, focus pullers, runners, art directors, costume designers, hair and makeup, carpenters, a gaffer (whatever <em>he</em> does), all with assistants in tow. Even our stills photographer Michael has three helpers to aid his workflow. It is a big operation.</p>\n<p>White-painted props are removed, replaced or repositioned. A huge camera on a dolly track is withdrawn, to be replaced by a weighty backpack and shoulder-mounted smaller camera for close-ups, wielded by a suitably muscular chap. The star of the show steps off his Canyon bike and sits himself down in a camping chair to flick through his phone messages while two makeup artists dab at his sweating brow and ensure not a hair is out of place. This is day two of a Zwift advertisement shoot. And the star in question is Mathieu van der Poel. </p>\n<p>The cyclo-cross champion and rising Classics sensation with an impeccable cycling family pedigree (father 1986 Tour of Flanders champion Adri, grandfather the late Raymond Poulidor) has been signed up by the virtual training brand for their 2020 campaign.  </p>\n<p>You can hardly fail to have noticed the previous year’s ads with Geraint Thomas. Zwift bought so much airtime that every time the payoff line was heard at Rouleur Towers – “Wait, is that G?” – a collective groan would rise from the assembled Eurosport viewers in the office. But that’s the advertising game. Get under the skin. Make it memorable. Lodge the message firmly in the brain. “Zwift. Fun is fast”. Grammatical sense is secondary to a catchy slogan.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Zwift_Day_121315_1024x1024.jpg?v=1609256105\" alt=\"Geraint Thomas\"> </p>\n<p>Zwift have plumped for the Dutch phenomenon as the face of their campaign this time out. It is a smart move. He’s got the looks. He’s certainly got the talent. A stunning 2019 road season ended in victory at Dwars door Vlaanderen, Amstel Gold, Brabantse Pijl, plus three stages and the overall at the Tour of Britain, all riding for Pro Conti outfit Corendon-Circus, with little support in terms of strong domestiques for their star man. He seems to do just fine without, plus what is now Alpecin-Fenix is a considerably beefed-up proposition for 2020. In cyclo-cross, without an injured Wout van Aert to battle, it was one-way traffic all season long. The Olympics in Tokyo will see Van der Poel go for mountain bike gold rather than road. There’s a very good chance he will romp home in that one too.</p>\n<p>Laurent Janneau, Zwift’s VP of Brand and Communications, chaired the discussions on who would lead their new campaign: “Mathieu was identified at the moment when we started to articulate our vision around the off-road market, the other disciplines of cycling. Identifying the dream ambassador is part of the process. And he is the dream ambassador.”</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Zwift_Nov19_2308_1024x1024.jpg?v=1609256192\" alt=\"Mathieu van der Poel\"></p>\n<p>How many were on that list of contenders? “It wasn’t that long, honestly. In a Zwift fashion, we said: what if we go with the top of the pile, the crème de la crème – Mathieu. We start there. We are known for our crazy ambitions and that was one of those moments. He was very interested in talking to us. He and his team have great ambitions, so it was a gathering of like-minded people.” </p>\n<p>As we stand watching him repeatedly going through the motions atop a static trainer, conversation centres around just how <em>right</em> he looks on a bike. If the Zwift programmers were designing the perfect cyclist avatar to inhabit their fictional island of Watopia, Van der Poel would surely be the blueprint. </p>\n<p>It’s a six-hour day on set for the centre of attention, and he’s not faking it for the cameras either. There is clearly resistance set against those fluidly-spinning pedals. The sweat is for real. Unusually, Van der Poel had to fight tooth and nail for victory at the cyclo-cross European Championships in Italy two days later, and the film shoot probably played a part in his performance. He did not romp into an early lead and leave his competitors floundering, as is his wont, and only pulled out a decisive gap on the final lap. But his bank balance was certainly much healthier. Zwift would not disclose how much their star earned for the role, but “dream ambassadors” like Van Der Poel and Geraint Thomas do not come cheap.</p>\n<p> <img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Zwift_Nov19_2508_1024x1024.jpg?v=1609256266\" alt=\"Mathieu van der Poel\"></p>\n<p>Cash is clearly not in short supply at Zwift. Since Eric Min founded the company in 2014, it has raised $166 million from investors, a phenomenal sum in cycling terms, including a second funding round at the end of 2018 that brought in $120 million – ostensibly to expand into the eRacing market. Like it or not, the competitive indoor trainer branch of the sport is projected to be a massive growth area in the coming years.</p>\n<p>Critics of the discipline were handed some golden ammunition last year when Cameron Jeffers, the inaugural British eRacing champion, was stripped of his title and banned for six months. He’d manipulated data to unlock an advantageous “bike” for the finals in March. The intricacies of what Jeffers did or didn’t do are probably understood by gamers and Zwifters. For those whose only experience of video games was wrestling a Space Invaders joystick or destroying asteroids (to no great effect) in 1980 before deciding it was all a waste of time, it’s a foreign language. Cheating at bike racing, though? Who’d have thought it? </p>\n<p>But Zwifting is here to stay. With over a million users worldwide, the company has tapped into the zeitgeist of a new generation of cyclists happy to immerse themselves in the weird pseudo-world of Watopia and work out alongside cycling avatars of the stars doing their own training sessions from the comfort of home. The Kiss Super League initiated by Zwift at the start of 2019, was joined by a host of Pro Conti level teams, including the likes of Hagens Berman Axeon, Novo Nordisk and Cofidis.</p>\n<p><em><strong><a href=\"https://www.rouleur.cc/blogs/desire-journal/the-best-smart-turbo-trainers\">Related: the best smart turbo trainers</a></strong></em></p>\n<p>Winners of the Zwift Academy women’s competition, introduced in 2016 with the victor gaining a contract with Canyon-SRAM for the following season, have mostly acquitted themselves well, despite doubts that being good at a video game transferred to real-life racing skills. Male winners spend an initial year with Dimension Data’s (now NTT) under-23 team in Italy, while 68,000 men and women entered the competition for a 2020 contract – extraordinary numbers. </p>\n<p>Laurent Janneau’s role is to keep Zwift’s numbers growing via the medium of advertising. Having worked for creative agencies dealing with the likes of Nike, Adidas, Louis Vuitton, Ford and Nissan, Janneau spent three years with Netflix before switching to Zwift just over a year ago. </p>\n<p> <img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Zwift_Nov19_2399_1024x1024.jpg?v=1609256388\" alt=\"Mathieu van der Poel\"></p>\n<p>“It is a fascinating culture. It is so strong. And Zwift is very disrupting, it makes for an interesting cocktail,” Janneau says, in ad-exec speak, understandably. If you are wondering why two days of filming are required for one TV campaign, there is much more to the shoot than the star of the show. The previous day’s filming included a gravel racer and top triathlete Lucy Charles-Barclay; following Van der Poel’s stint, a runner on a treadmill would be centre stage. Zwift cover multiple disciplines, reflected in their advertising, and ensure the message gets across: it is not just for heroes like Mathieu, but for any Tom, Dick or Harriet. Fun is fast, remember? The garage-like setting and its white-painted props layered beneath the projected Watopia racing backdrop support the core principle: train at home in the warm and dry, and enjoy yourself at the same time. </p>\n<p>“The very beginning of the creative process is what we call consumer insight,” Janneau explains. “Finding an idea that really resonates with the audience, that can speak about what we want to say. At the heart of this campaign is ‘fun powers performance’. When we think about what Zwift does, and more specifically making indoor training more entertaining, we are looking at that benefit. What does it mean from a consumer standpoint? What do they get from it?</p>\n<p>“When you are having fun, when it is less boring, you train harder, you train longer, you push harder on the pedals. When you have someone to ride with, you ride longer and better – your performance increases. Powering up, personalising your avatar – all of these things that are coming from video game culture – allow you to train better because it is more inviting. That was at the very start of the creative process.” </p>\n<p>Zwift ensure every base is covered over the two-day session. Matt Stephens darts around between takes, filming a behind-the-scenes video. Michael Blann and his assistants spring into action between takes to get stills of Van der Poel doing his thing. (The hierarchy on a film set is clear here – photographers to the back of the queue, and be quick about it.) </p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Zwift_Nov19_2472_1024x1024.jpg?v=1609256446\" alt=\"Mathieu van der Poel\"> “You make your buck work very hard,” says Janneau. “Website, ads, social media platforms – touchpoints that should all be conveying the same message, one ecosystem. That’s the way we approach these shoots. Not only beautiful images that will be used on amazing 16x9 [TV display ratio] videos, but also one portion on 9x16 [e.g. Instagram stories], because we know that on social media, this is how this content is consumed. We are also doing behind the scenes to add a tone that is less advertising-like and a little more spontaneous. It is changing the way we look at marketing, using all of those touchpoints to tell a consistent and more interesting story.” </p>\n<p>Los Angeles-based media specialists Hecho Studios were key to bringing the initial concept to life. Scenes from the Zwift game play behind their real-life cycling subjects to create what Janneau calls a “full immersive environment”, so Van der Poel actually appears to be part of the game courtesy of projection mapping – the same technique used to spectacular effect on world-famous buildings such as the Sydney Opera House and Houses of Parliament. Throwing a human on a bicycle into the mix is no easy task.</p>\n<p><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/it-s-always-sunny-in-watopia-confessions-of-a-late-zwift-adopter?_pos=2&amp;_sid=0db262cc1&amp;_ss=r\">Related: Confessions of a late Zwift adopter</a> </strong></em></p>\n<p>“In order for the perspective to be right, the camera has to be in exactly the same position as the theoretical camera that was in the game,” says Janneau. “It takes a lot of time and the right people. These people are used to working with video games. We have made these two worlds meet to create what we have here, which has never been done before.”</p>\n<p>Never? I’d suggest Disney’s masterpiece Mary Poppins more than 50 years earlier nailed it, but we’ll just let that one slide. What is without doubt is that all that time and effort takes a lot of cash. Did the initial media blitz with Geraint Thomas pay off? </p>\n<p>“We were very happy with the execution and the result of the campaign. Doing a big campaign like that during the Tour de France was really a coming out party for Zwift. It brought us to a far wider audience than before. It was quite a big gamble for us. Our product has quite a big seasonality. People are more interested in indoor training in the winter than in the summer. So it was counter-intuitive to a point. But then we know that during the Tour, pretty much every person who is interested in cycling will be in front of the television. We captured them when their curiosity for cycling was at its peak. It raised the level of awareness of Zwift to a level we have never seen before. To some extent, we broke the seasonality of Zwift due to that first campaign.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Zwift_Day_122522_1024x1024.jpg?v=1609256538\" alt=\"Mathieu van der Poel\"></p>\n<p>“Now we are in the second stage. We have done the awareness, started to develop some more specific messages around Zwift, now we are talking about how Zwift can be the training platform of choice, not only for roadies, but for mountain bikes, cyclo-cross, gravel…” </p>\n<p>Fun is fast, it seems, whatever your bag. And it’s coming your way. Zwift may not be everyone’s cup of tea, but even a Space Invader-playing luddite like me can see the appeal. So long as riders are still getting out in the real world and messing about on bikes, learning the kind of skills that make Mathieu van der Poel such a great racer, then they have achieved a healthy balance. </p>\n<p>And if Zwift require an older gentleman to star in their next ad campaign, I am available if the price is right. Offers in the six-figure bracket would be acceptable. Move over, Mathieu. </p>\n<p><em>Originally published in Rouleur <a href=\"https://www.rouleur.cc/collections/rouleur-magazine/products/rouleur-issue-20-1?variant=31353233604672\">issue 20.1</a></em> </p>\n<div class=\"klaviyo-form-UFKPji\"></div>\n    ","author":"Miles Baker-Clarke","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"cd0d37bb470140d693ef6bff92d626bc62fa2a16d129cd9f0411ad358341b323","category":"Cycling"}