{"title":"We Need You In The Smashing Family","link":"https://smashingmagazine.com/2020/12/digital-advertising-and-partnerships-coordinator/","date":1607347800000,"content":"<p>At Smashing, we are looking for a friendly, reliable and passionate person to drive the <strong>sales and management of sponsorship and advertising</strong>. We work with small and big companies to help them get exposure and have their voice heard across a number of different media — from this very magazine to our online conferences, meet-ups and workshops. This includes:</p>\n\n<ul>\n<li><a href=\"https://www.smashingmagazine.com/\">Smashing Magazine</a> — display advertising and sponsored articles.</li>\n<li><a href=\"https://www.smashingmagazine.com/events/\">Smashing Conferences</a> — online and in-person.</li>\n<li><a href=\"https://podcast.smashingmagazine.com/\">Smashing Podcast</a> — published once every 2 weeks.</li>\n<li><a href=\"https://smashingconf.com/online-workshops/workshops\">Smashing Online Workshops</a> — happening every week.</li>\n</ul>\n\n<p>We sincerely hope to find someone who <strong>knows and understands the web community</strong> we publish for. A person who is able to bring onboard advertisers and sponsors that will be helpful to our audience, and who will benefit from the exposure and visibility at Smashing. We are looking for a person with experience in nurturing <strong>long-term relationships with advertisers</strong>, while not being afraid to push for new sales.</p>\n\n<p>We are a small family of 12, and we’ve all been working remotely for years now. By joining our team, you will have the opportunity to <strong>shape the role</strong> and work with the Magazine as well as the Events team to create sponsorship opportunities that truly benefit both sides of the arrangement. We also would be open to outsourcing this work to another company or working with someone on a freelance basis who provides these services to other companies.</p>\n\n<h3>What’s In It For You?</h3>\n\n<ul>\n<li>A <strong>small, friendly, inclusive and diverse team</strong> that is aligned and very committed to doing great work;</li>\n<li>The ability to <strong>shape your work</strong> in a way that would work best for you;</li>\n<li><strong>No lengthy meetings or micro-management</strong>: we do everything to ensure you can do your best work.</li>\n</ul>\n\n<h3>Role And Responsibilities</h3>\n\n<ul>\n<li>You’ll be working with your existing contacts (those of which Smashing has already made) and <strong>find new contacts</strong> to sell advertising and sponsorship across the range of our products;</li>\n<li>You’ll be <strong>managing sponsors and advertisers</strong> once they come on board, ensuring that expectations are managed and deadlines on both sides understood;</li>\n<li>You’ll be <strong>exploring creative partnerships</strong> to ensure that sponsors get exposure they need while staying true to principles that Smashing stands for;</li>\n<li>Work closely with the our team to ensure that our commitments to sponsors are possible to fulfill given time and team availability;</li>\n<li>Being able to think creatively in terms of how we maximize sponsorship opportunities across our different outlets.</li>\n</ul>\n\n<h3>We’d Like You To:</h3>\n\n<ul>\n<li>Have good written English, and ability to communicate clearly with sponsors from around the world;</li>\n<li>Be able to manage a flexible schedule in order to make calls to sponsors in timezones including the US West Coast;</li>\n<li>Be happy working in an asynchronous way, mostly via writing (we use Slack and Notion), given the distributed nature of the team and sponsors;</li>\n<li>Be conversant with web technologies to the extent of understanding who would be a good fit as a sponsor;</li>\n<li>Ideally, have existing connections with web companies;</li>\n<li><strong>Fully remote</strong>, and probably fulltime. (Again, we also would be open to outsourcing this work to another company or working with someone on a freelance basis who provides these services to other companies.)</li>\n</ul>\n\n<h3>A Bit About Smashing</h3>\n\n<p>At Smashing, we focus on bringing quality content for web designers and developers, and support our community. The community around Smashing is indeed very important to us. They tell us when they like what we are doing, and also when they do not!</p>\n\n<p>We are always looking for new ways to reach out to our community. Over the past year, we’ve taken conferences online and started running online workshops in response to the pandemic. Things will likely change over the coming year too, and we are keen to bring our existing sponsors along with us and continue to think creatively about how we can offer good value to them in a changing world.</p>\n\n<p>Yet again, we are a very small team of dedicated people — fully distributed even before the pandemic. The majority of the team is in Europe, but we also have team members in the USA and Hong Kong. Therefore, location tends to be less important than an ability to work in a way that respects the time lag when dealing with multiple time zones.</p>\n\n<h3>Contact Details</h3>\n\n<p>If you are interested, please <strong>drop us an email</strong> at <a href=\"mailto:recruiting@smashing-media.com?subject=Sponsorship Manager\"><strong>recruiting@smashing-media.com</strong></a>, tell us a bit about yourself and your experience, and why you’d like to be a part of the Smashing family. We can’t wait to hear from you!</p>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"ab069ca35bf300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"cdac7c69ea177f5ca586eaa84362102e948e0a0fb1f0c0d589f609b2b3ad8a94","category":"Tech"}