{"title":"Cycling transfers 2021: the smartest moves","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/cycling-transfers-2021-the-smartest-moves","date":1610298675000,"content":"\n      <p>Like a kaleidoscope, the pro peloton seems to morph into new shapes and colours with each race. The WorldTour is never more fluid in change, though, than at start of the season after a busy winter of transfers.</p>\n<div class=\"klaviyo-form-Ymj3Vm\"></div>\n<p class=\"p1\"><span class=\"s1\">As riders improve and decline, teams are constantly working to build a roster which is well-balanced in order to achieve their objectives. So too, teams revise their goals and reveal a hint of their hand for the season ahead as they bring on new signings with different strengths.</span></p>\n<p class=\"p1\"><span class=\"s1\">A change of squad for a rider can mean that their role changes completely, transforming their position in the peloton altogether. Super-domestiques leave teams packed with similar riders to become GC contenders, as lead-out riders take their chances to become sprint stars. But beyond the headline moves are some subtler transitions that can reveal a savvy strategy for the season ahead. </span></p>\n<p class=\"p1\"><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/neo-pros-to-watch-in-2021\" title=\"Neo-pros\"><em><strong><span class=\"s1\">Related – Neo-Pros to Watch in 2021<br></span></strong></em></a><a href=\"https://www.rouleur.cc/blogs/desire-journal/pro-team-bikes-2021\" title=\"Team Bikes\"><em><strong><span class=\"s1\">Related – World Tour Team Bikes: The best to far</span></strong></em></a></p>\n<p>Here, we take a deep dive into the transfer market, picking out the transfers that make the most sense from the perspective of both team and rider heading into 2021.</p>\n<h4>Romain Bardet: AG2R La Mondiale &gt;&gt; Team DSM</h4>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Bardet_1024x1024.jpg?v=1610295316\" alt=\"\"></p>\n<p><i><span style=\"font-weight: 400;\">Team DSM recruit Romain Bardet for 2021 (Photo credit: </span></i><i><span style=\"font-weight: 400;\"><span>Alex Whitehead/SWpix.com)</span></span></i></p>\n<p>Following nine largely successful years at AG2R La Mondiale, Rouleur columnist Romain Bardet leaves to join German outfit Team DSM. His time at AG2R included two podium finishes at the Tour de France in successive years (2016 and 2017), as well as three stage victories. The pressure was piled onto Bardet’s shoulders as he looked like the most likely Frenchman to end the nation's GC drought at the Tour, which stretches back to Bernard Hinault’s victory in 1985.</p>\n<p>Ultimately, Bardet is yet to claim the yellow jersey and his form has somewhat faded in the past couple of seasons. He displayed signs of returning to his best at the 2020 Tour de France, but a fall and subsequent concussion prevented him from finishing the race.</p>\n<p>Bardet has shown his class throughout his time at AG2R. However, as he enters his thirties, a change of scenery appears to be the best option with the team altering their focus to the cobbled classics - the signings of Greg Van Avermaet, Bob Jungels and Stan Dewulf are clear evidence of this.</p>\n<p>Marc Hirschi’s sudden departure from DSM means that Bardet will have an even greater role with his new team in 2021.</p>\n<h4>Ben O’Connor: NTT Pro Cycling &gt;&gt; AG2R Citroën</h4>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/OConnor_1024x1024.jpg?v=1610295407\" alt=\"Ben O'Connor\"></p>\n<p><i><span style=\"font-weight: 400;\">O’Connor could be a great addition for AG2R Citroën (Photo credit: </span></i><i><span style=\"font-weight: 400;\"><span>Zac Williams/SWpix.com)</span></span></i></p>\n<p>Although not a direct replacement for Bardet, Ben O’Connor joins AG2R Citroën following his most successful season yet. The Australian first showed his ability in the WorldTour in 2018, where at the age of 22, he led Dimension Data in the general classification at the Giro d’Italia. Three days before the finish, he sat just outside the top 10 but crashed out on stage 19 (incidentally, the very stage which catapulted Chris Froome into the maglia rosa).</p>\n<p>O’Connor struggled to recapture that form until the 2020 Giro d’Italia, where he burst into life in the final week. He joined the breakaway on stage 16, and was clearly one of the best climbers in the group, beaten to the line by Jan Tratnik following a technical finish. The Australian picked himself up and dominated the next day, where he won on Madonna di Campiglio, finishing over 30 seconds ahead of anyone else to claim his maiden Grand Tour stage victory.</p>\n<p>With Bardet’s departure, AG2R are seemingly without an out-and-out GC leader for 2021. This leaves O’Connor in a great position to pick his own opportunities, be that turning his focus back to the GC or continuing to hunt stage wins in the breakaway.</p>\n<h4><span class=\"s1\">Marianne Vos: CCC-Liv &gt;&gt; Team Jumbo-Visma</span></h4>\n<p><span class=\"s1\"><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW7_0160_1024x1024.jpg?v=1610297694\" alt=\"\"></span></p>\n<p><em>(Photo credit: Alex Whitehead/SWpix.com)</em></p>\n<p>Marianne Vos’ complete dominance in the sport was once a given. Arguably no riders in the history of the sport have been able to win across such a multitude of disciplines. Today she enjoys substantially stiffer competition.</p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/six-reasons-to-follow-women-s-cycling-in-2021\" title=\"Women's Cycling\"><em><strong>Related – Six Reasons to Follow Women's Cycling in 2021</strong></em></a></p>\n<p>This may seem like an unusual move, with Jumbo-Visma not in the women's WorldTour status and Vos part-owning CCC-Liv.</p>\n<p>However the transition to Jumbo-Visma offers the flying Dutchwoman a clear role as team leader in a young team that has been extremely well built to target GC and one-day racing battles. It is tipped to be the strongest in the women’s field in the coming season, despite sitting in the second tier.</p>\n<h4>Jack Haig: Mitchelton-Scott &gt;&gt; Bahrain Victorious</h4>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Haig_1024x1024.jpg?v=1610295521\" alt=\"\"></p>\n<meta charset=\"utf-8\">\n<p><em><i><span style=\"font-weight: 400;\">Jack Haig adds to Bahrain - Victorious’ GC team</span></i> (Photo credit: Zac Williams/SWpix.com)</em></p>\n<p>Jack Haig started his 2020 campaign in fine fashion, finishing second at both the Volta a la Comunitat Valenciana and the Vuelta a Andalucía, races won by Tadej Pogačar and Jakub Fuglsang respectively. However, he couldn’t quite replicate that form post-lockdown, although to his credit he was riding largely in support of Simon Yates.</p>\n<p>His season was thrown into turmoil at the Giro d’Italia, when Yates tested positive for COVID-19 ahead of stage 8. A few days later, the team decided to withdraw the entire squad, effectively ending Haig’s season.</p>\n<p>The 27-year-old has more than displayed his ability to ride as a super-domestique, but he has also shown that he can act as a leader in one-week races. He joins a Bahrain-Victorious team which is heavily focused on the general classification. Spearheaded by Mikel Landa, who is flanked by Pello Bilbao, Wout Poels and Damiano Caruso, Bahrain can be certain that they enter 2021 with a stronger GC squad with Haig in the mix.</p>\n<h4>Attila Valter: CCC &gt;&gt; Groupama - FDJ</h4>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Valter_1024x1024.jpg?v=1610295640\" alt=\"\"></p>\n<p><i><span style=\"font-weight: 400;\">Attila Valter could be a brilliant addition for Groupama - FDJ (Photo credit: </span></i><i><span style=\"font-weight: 400;\"><span>Allan McKenzie/SWpix.com)</span></span></i></p>\n<p>Attila Valter has only ridden one season in the World Tour, but at the age of 22, the Hungarian is one of the most intriguing young climbers around. He won his home tour in 2020 and ended the season by competing in his first Grand Tour, the Giro d’Italia.</p>\n<p>Despite finishing in Milan without an outstanding result, there was plenty to admire in Valter’s performances. His best result came on stage 20 to Sestriere, where he finished ninth, ahead of numerous GC riders including Vincenzo Nibali and Jakob Fuglsang.</p>\n<p>Groupama-FDJ have been largely focused around Thibaut Pinot in recent times, and with David Gaudu improving every season, the French team have two great options for Grand Tours. If Valter’s upward trajectory is to continue, he could become an important rider for the team sooner rather than later.</p>\n<h4>Michael Matthews: Team Sunweb &gt;&gt; Team BikeExchange</h4>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Matthews_1024x1024.jpg?v=1610295673\" alt=\"\"></p>\n<p><i><span style=\"font-weight: 400;\">Michael ‘Bling’ Matthews re-joins Team BikeExchange four years after leaving the team (Photo credit: </span></i><i><span style=\"font-weight: 400;\"><span>Zac Williams/SWpix.com)</span></span></i></p>\n<p>Michael Matthews is the first on our list to have re-joined a team he has previously ridden for. ‘Bling’ had a plethora of great results when riding for Orica GreenEDGE from 2012 to 2016, a period which included six Grand Tour stage victories. However, the team’s general classification ambitions increased, which can be attributed to the Yates brothers’ development, and Matthews headed to Sunweb.</p>\n<p>Matthews enjoyed a good stint with the German team, but was snubbed for the 2020 Tour de France, a decision that looks good in hindsight due to stage wins for Marc Hirschi and Søren Kragh Andersen. Instead, Matthews headed to the Giro where he finished in the top 5 on three occasions before leaving the race after testing positive for COVID-19.</p>\n<p>With the departure of Adam Yates to INEOS in addition to Caleb Ewan leaving the team in 2019, the newly named Team BikeExchange appears to be the perfect destination for Matthews who will lead the team in both bunch sprints and classics.</p>\n<h4>Chloé Dygert: Team Twenty20 &gt;&gt; Canyon//Sram</h4>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW7_0867_1024x1024.jpg?v=1610298422\" alt=\"\"></p>\n<meta charset=\"utf-8\">\n<p><em>Dygert racing at the World Championships in Imola (Photo credit: Alex Whitehead/SWpix.com)</em></p>\n<p>Chloe Dygert is a complicated one. An absolute rising superstar in the sport, but her deal to move to Canyon//Sram was signed before both her severe crash at the World Championships in Imola and the storm that erupted around her use of social media. You can read our full interview with her in Issue 100.</p>\n<p><a href=\"https://www.rouleur.cc/pages/subscribe\" title=\"Subscribe\"><em><strong>Subscribe now to Rouleur and receive Issue 100 for free as part of your subscription</strong></em></a></p>\n<p>Nonetheless, despite her injuries and controversy, she seems simply too good for Canyon//Sram to give a second thought. She raced for 59 minutes in 2020 and emerged with two world titles.</p>\n<p>Her move to Canyon//Sram offers her the chance for a first season in Europe, and brings some major firepower to the women's season and the 2021 Tokyo Olympics. It's a signing that offers Dygert the opportunity to grow into a consistent champion, and Canyon-Sram the chance to get in on the ground floor.</p>\n<h4>Iván García Cortina: Bahrain McLaren &gt;&gt; Movistar</h4>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/IGC_1024x1024.jpg?v=1610295871\" alt=\"\"></p>\n<p><i><span style=\"font-weight: 400;\">García Cortina</span></i><i><span style=\"font-weight: 400;\"> at the 2020 edition of Strade Bianche (Photo credit: </span></i><i><span style=\"font-weight: 400;\"><span>LB/RB/CorVos/SWpix.com)</span></span></i></p>\n<p>Ivan Garcia Cortina is a highly versatile rider who is capable of enduring short climbs and cobbled roads, whilst also boasting a strong sprint finish. This can be illustrated with his best result of 2020 – stage victory at Paris-Nice where he sprinted ahead of Peter Sagan in bleak conditions. Later in the year, he claimed a top 10 on the queen stage of the Binckbank Tour, a day that included multiple ascents of the infamous Kapelmuur.</p>\n<p>The general classification in Grand Tours has always been the focal point for Movistar. Since 2011, the team have achieved 13 podiums and over 20 top-five finishes. However, the recent departures of Mikel Landa, Richard Carapaz and Nairo Quintana means the Spanish team now have fewer GC options. The signings of Matteo Jorgenson and Johan Jacobs in 2019 showed that Movistar are making a concerted effort to be competitive in a wider range of races, although aged 21 and 23 respectively, the aforementioned duo may have a few years before they are competing for victories.</p>\n<p>Ivan Garcia Cortina joins as the clear leader in the cobbled classics. He has stated himself that he dreams of winning Paris-Roubaix. Movistar’s best finish at The Hell of the North came in 2016, when Imanol Erviti finished ninth, which raises the question: why has Garcia Cortina moved to Movistar if he wants to win Paris-Roubaix?</p>\n<p>Well, with renewed objectives and a clear effort to build a team capable of competing on the rough roads, García Cortina just might have the chance of achieving his dream and more with Movistar.</p>\n<h4>Chris Froome: Team INEOS &gt;&gt; Israel Start-Up Nation</h4>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Froome_1_1024x1024.jpg?v=1610295908\" alt=\"\"></p>\n<p><i><span style=\"font-weight: 400;\">Froome joins Israel Start-Up Nation in 2021 (Photo credit: Veloimages)</span></i></p>\n<p>Last but certainly not least, Froome’s departure from the Ineos Grenadiers is undeniably one of the key talking points of the transfer window, the 35-year old leaves the team after eleven seasons to join Israel Start-Up Nation. </p>\n<p>Froome has been the cream of Grand Tour riders over the past decade and has won a total of seven Grand Tours. However, his horrendous crash at the Critérium du Dauphiné in 2019 meant a lengthy recovery. Froome has struggled to regain his previous form since his return.</p>\n<p>After missing out on a place at the Tour de France, he arrived at La Vuelta with many expecting him to co-lead alongside Richard Carapaz. However, the Brit found himself 11 minutes down after the first stage, though he went on to finish the race. </p>\n<p>Meanwhile, Israel Start-Up Nation completed their first season as a World Tour team in 2020. It was a year of progression, they claimed their first Grand Tour stage with Alex Dowsett taking an emotional win at the Giro d’Italia, and backed that up when Dan Martin defeated Primož Roglič and Carapaz to take a stage at the Vuelta.</p>\n<p>The team has never been under any pressure to compete for general classifications at Grand Tours, but certainly is on a mission to get to the sharp end of the WorldTour.</p>\n<p>This fact alone makes the team a fantastic environment for Froome. Were he to remain at INEOS Grenadiers, he’d be competing for places with Egan Bernal, Richard Carapaz, Geraint Thomas and Tao Geoghegan-Hart, not to mention Adam Yates or any of the other new recruits. Israel Start-Up Nation will allow Froome to pick and choose his goals, whilst he will not have to bear the pressure of winning a Grand Tour. Whether he is still capable of doing so remains to be seen...</p>\n<div class=\"klaviyo-form-UFKPji\"></div>\n    ","author":"Miles Baker-Clarke","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"ce84dd5dfb3612f5d2f9d6ae92861bf9e963a0364d381a7d7d3231dc45e37c34","category":"Cycling"}