{"title":"Hank Aaron Dies at 86","link":"https://www.ajc.com/news/baseball-great-henry-hank-aaron-86-passes-into-history/J33Z76ZVR5C4BG7A75VIDLZGWY/","date":1611334773000,"content":"\n<p>Terence Moore, writing for the Atlanta Journal-Constitution:</p>\n\n<blockquote>\n  <p>In March of 1954, with his place in the major leagues far from\nassured, Hank Aaron was granted a start in a Milwaukee exhibition\ngame versus Boston, only because Bobby Thomson, the regular left\nfielder and Aaron’s idol, had just broken his ankle.</p>\n\n<p>Already possessed of dramatic timing at the age of 20, the rookie\npromptly drilled a ball that carried the wall, flew over a row of\ntrailers parked outside the Sarasota park and reverberated so\nloudly in the Red Sox clubhouse that the great Ted Williams\nemerged, as Aaron recalled, “wanting to know who it was that could\nmake a bat sound that way when it hit a baseball.”</p>\n</blockquote>\n\n<p>Everyone remembers Aaron for the home runs, but my god, look at his career numbers. 23 seasons, .305 batting average, 3,771 total hits. He not only finished as the all-time home run leader, but he also finished his career <em>second</em> on the all-time hits list, behind Ty Cobb. (Pete Rose eventually passed him on <a href=\"https://www.baseball-reference.com/leaders/H_career.shtml\">the hits list</a>, and Barry Bonds <a href=\"https://www.baseball-reference.com/leaders/HR_career.shtml\">on the home runs list</a>. But Bonds finished 37th on the all-time hits list, and Pete Rose hit only 160 career home runs.) And Aaron did all this playing the bulk of his career, and his prime years, in an era so dominated by pitching <a href=\"https://www.mlb.com/cut4/why-was-the-mound-lowered-in-1968/c-158689966\">that MLB lowered the height of the pitching mound in 1968</a>. Aaron still holds the MLB record for RBIs (2,297), total bases (6,856) and extra-base hits (1,477), and he ranks fourth for runs scored (2,174 — exactly tied with a guy named Babe Ruth, what are the odds?).</p>\n\n<p>“Who it was that could make a bat sound that way when it hit a baseball”, indeed.</p>\n\n<div>\n<a  title=\"Permanent link to ‘Hank Aaron Dies at 86’\"  href=\"https://daringfireball.net/linked/2021/01/22/hank-aaron\">&nbsp;★&nbsp;</a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"d883fef922e00e3f04ef2b54a6083acd8034fb079cf772790a74e810eb71f7b2","category":"Tech"}