{"title":"Design a jersey, earn a ride-along at the Spring Classics, and help change lives with bicycles","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/design-a-jersey-earn-a-ride-along-at-the-spring-classics-and-help-change-lives-with-bicycles","date":1608723236000,"content":"\n      <p>Long associated with the team, next year South African not-for-profit organisation Qhubeka now enjoys a titles spot in Team Qhubeka Assos (currently NTT Pro Cycling) as a key beneficiary of the team.</p>\n<p>Home to riders including Fabio Aru, Nicholas Dlamini, and Victor Campenaerts, unusually for cycling, their efforts will be helping publicise a cause more laudable than that of most other headline sponsors.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Qhubeka_Bike_480x480.png?v=1608720694\" alt=\"\"><br>Meaning ‘to move forward’ in Nguni, Qhubeka provides bicycles for children to attend schools, and for adults to attend work. Now Team Qhubeka <span>Assos</span> wants your designs to help power the delivery of more bicycles</p>\n<p>Ahead of next season, the team’s clothing supplier <span>Assos</span> is running a competition asking riders to design a jersey to be included in the Swiss brand’s range.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Assos_Design_480x480.jpg?v=1608721164\" alt=\"\"><br><br>Open to anyone with a computer and some crayons, four initially shortlisted designs will then go to a public poll to choose the winner. This design will then be put into production, with <span>€</span>60 from every jersey sold going directly to fund Qhubeka’s bicycle programme. <br><br>Its creator will also get a seat in the Team Qhubeka <span>Assos</span> team car during a Spring Classic, along with <span>Assos</span> wardrobe worth <span>€</span>2,000, with the three runners up each receiving a gift from <span>Assos</span> up to the value of <span>€</span>300.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Qhubeka_480x480.jpg?v=1608720594\" alt=\"\"><br>More details and entry for the competition can be found <a href=\"https://www.assos.com/Team-Qhubeka-ASSOS-Contest\" target=\"_blank\" rel=\"noopener noreferrer\">here</a><br><br>Also providing a home to Harry Tanfield, Team Qhubeka <span>Assos</span> faced having to rebuild its squad after a difficult 2020 season. Having spent much of the year looking to secure sponsors, the popular team now includes an international roster of riders and will be looking to cement its continued WorldTour status in 2021. <br><br>A tier down, Team Qhubeka is the continuation of the NTT Continental Cycling Team. Having suffered through a lack of racing due to Covid-19, next year it will continue with its core mission of developing U23 talent from Africa.</p>\n<meta charset=\"utf-8\">\n<p>So don't hesitate to take the chance of being part of the Qhubeka project, and begin your jersey design journey <a href=\"https://www.assos.com/Team-Qhubeka-ASSOS-Contest\" target=\"_blank\" rel=\"noopener noreferrer\">here</a>.</p>\n<div class=\"klaviyo-form-UFKPji\"></div>\n    ","author":"Miles Baker-Clarke","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"da68503947642fcb16a22b991dce81859cf0874cb9f9f36070930d3d88e2bc75","category":"Cycling"}