{"title":"Wout van Aert: Comeback Kid","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/wout-van-aert","date":1609866431000,"content":"\n      <h4>PAU, JULY 2019 </h4>\n<p>He didn’t have the legs. Didn’t matter. Even on a bad day, he was up there. His numbers were good. He was the fastest at the first time check and only fellow countryman Thomas De Gendt had gone faster at the second. From the <br>team car, Mathieu Heijboer urged the Herentaler to pick it up – come on, almost there, focus, it’s the Tour de France! This was the biggest stage, his childhood dream come true. </p>\n<div class=\"klaviyo-form-Ymj3Vm\"></div>\n<p>With just over a kilometre to go, he was squeezing the power, aiming for the next corner, regaining valuable seconds. Rock-solid in his aerodynamic position, he knew he was one of the top time-triallists in the world. He had won the race against the clock at the Dauphiné and taken the national title. He could do this, he had done it before, he was doing it again. If he was hurting, everyone else was going through hell. </p>\n<p>He knew the tight right-hander coming up. He’d reccied it, gone over it in his mind. With the barriers and the crowd, it was practically a blind corner. It was also a chance to gain time. There was no going back, he was committed.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/R20.7_ref_6_1024x1024.jpg?v=1609865190\" alt=\"\"></p>\n<p>A light feathering of the brakes and he swept in, hands on the base bars, skimming the banners, a smooth line. Perfection. He’d done it, he could see the exit. He was already anticipating moving back into the tuck. Keeping form. Visualising the final bends. With only just over a minute to go, it was time to empty the tank. </p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tom-pidcock-that-s-entertainment\" title=\"Tom Pidcock\"><strong><em>Related - Tom Pidcock: That's Entertainment</em></strong></a></p>\n<p>Next thing he knew, he was lying in the gutter with team and official cars rolling past. His Bianchi abandoned in the middle of the road. Was it the base bar that caught the Leclerc banner, was it his hip? The pedal? Did the fence hook onto his skinsuit? </p>\n<p>Mathieu came rushing over from the team car. The medics seemed to take an eternity to arrive. Over three minutes passed before they finally moved him from the road onto the pavement, clear of the race line. Mathieu put the Leclerc banner over him to protect him. </p>\n<p>He was told to lie still. Don’t look at the gash! Don’t. Of course, it only made him look. Could he feel his leg? That’s when the panic hit home. The pain. The minutes dragging on forever, the tarmac boiling on his bare skin, no protection offered by the ripped skinsuit. All he could feel was the heat. It was like being burned alive. What were they waiting for to get him out of here? </p>\n<h4>JUMBO-VISMA TRAINING CAMP, ALICANTE, JANUARY 2020 </h4>\n<p>Going into the 2020 season, 25-year old Wout van Aert is one of the most exciting up-and-coming riders of the WorldTour. It may seem an odd qualification for a triple cyclo-cross world champion, Tour de France stage winner and national time-trial champion, but the Jumbo-Visma man is only just getting started. Wout is mentioned in the same breath as cycling superstars Mathieu van der Poel, Julian Alaphilippe and Remco Evenepoel. The general feeling is that there is no limit to what Wout can do. </p>\n<p>If he can recover from his crash. </p>\n<p>Riders often appear small in person. Not Wout, he’s rangy and athletic as we meet him in the restaurant of the Jumbo-Visma training camp hotel at the end of a rest day. We pick up where most fans last saw him in action – that horrendous crash in the 2019 Tour de France time-trial. “I just wanted to get back on the bike,” he says. “But then I saw the wound. They asked if I could move my leg. If I could feel my toes. I realised my Tour was over, the season. Some said my career.” </p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Wout_van_Aerts_portrait_1024x1024.jpg?v=1609861185\" alt=\"\"></p>\n<p>Wout was rushed to hospital in Pau where he underwent surgery. “After the first operation in France, I thought it’s going to be fine. I hadn’t broken anything. But when Toon [Dr Toon Claes] checked back home in Herentals, he discovered that things weren’t as straight- forward as they’d claimed in Pau. They’d missed a torn tendon and Toon had to quickly re-operate to attach it,” Wout adds, grimacing at the thought. “Having to go under the knife a second time was tough. Back to square one, worrying again. I was lucky though – if Toon hadn’t spotted the error in time, it could have been much worse. </p>\n<p>“For five days after the operation, I had to lie still on my back. I couldn’t move. At all,” says Wout. “I needed to give the tendon time to heal up... I was meant to ride the post-Tour crit in Herentals. Instead, I was on crutches. It took two or three weeks before I could even make it to the tap to get myself a glass of water. I needed help with everything. [My wife] Sarah was amazing, couldn’t have done it without her.” How is he feeling now? “I’m a rider again. Now I just need to become a stronger rider,” he smiles. </p>\n<p>“It was hard, especially in the beginning. I didn’t get back on the bike until November, with proper training only starting in December,” he says. That’s only a month before we speak. </p>\n<p>When we chat with directeur sportif Merijn Zeeman on the same day, he says that after Wout’s crash, it was impossible to make any plans. They had to take it week by week: “But Wout recovered much quicker than expected. It’s still difficult to say exactly how long it will take to get back to full strength. It’s about those last two per cent.” </p>\n<p>“Wout in one word? Doorzetter – a fighter, yes, that sums him up. He thrives on challenges,” says soigneur Wesley Theunis as we catch up with him by the washing machine in the team truck. He spends up to two hours a day with Wout during the camp. “He’ll have a 15-minute massage after breakfast, before heading out, then an hour and a half when he gets back. And another 15 minutes in the evening,” says Wesley. He first met Wout in 2014 at the Conti team Vastgoedservice-Golden Palace and Wesley has been his regular soigneur since. </p>\n<p>“With the crash injury and the rebuilding of muscle tissue, Wout’s body is constantly readjusting imbalances. Lactic acid will be quicker to build up at times. It’s all part of the process. There was up to four centimetres difference in circumference between the thighs. Now [January 2020], it’s down to between one and one-and- a-half,” says Wesley.</p>\n<p>“When he came back from Pau, he couldn’t lift his leg outwards. It was because of that missed tendon in the first operation. </p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/CORVOS_00032325-109_1024x1024.jpg?v=1609865797\" alt=\"\"></p>\n<p><em>(Photo credit: LB/RB/CorVos/SWpix.com)</em></p>\n<p>“The more lactate in the legs, the longer the massage. But it’s not just about the legs. It can be back and shoulders, some stretching. After a race, we’ll have the television on and Wout will go over every little detail of the day. He is very self-critical and super analytical. We also talk about personal stuff. Gives him the chance to let off steam,” says Wesley. </p>\n<p>“At the Dauphiné last year, I made a bet with Wout about getting a top three. When the first win happened, I had to treat him to a Mexican barbecue. I’ll have to set the bar higher this year.” </p>\n<p>Wout has done 17 hours of riding in the last three days. That includes the first outing on his time-trial bike since Pau. “Before getting on, I froze for a split second in front of it, automatically thinking it was the bike I’d crashed on,” he says. “Inevitably, things come flashing back. It was a new bike of course. In the end, I did 50 kilometres and I really enjoyed riding it, going fast.” </p>\n<p>When asked about his versatility, Wout says his time trialling talent didn’t come out of the blue. “Apart from the mud and the aerodynamics, there are many similarities between ’cross and racing against the clock. They’re both about mental strength. You have to keep pushing and need huge drive. The duration is also similar,” says Wout.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/R20.7_ref_7_copy_1024x1024.jpg?v=1609862431\" alt=\"\"></p>\n<p>His confidence as a sprinter is growing too. “Last year, it took me a while to dial in the sprints. I wasn’t getting the timing right. I could see that I had the power, but kept launching too late,” he says. Once he tried going earlier, he nailed it. In the Albi stage at the Tour that he won, it was instinctive. “Hopefully, I can pick up where I left this year,” he adds. </p>\n<p>What about the move to a bigger, road-focused team? Was it an escape from ’cross or a move to something new? “Sure, there was a lot of pressure at times – the cyclo-cross world is a small circus. In that sense, it felt liberating to get away from it, from the high expectations,” says Wout. It was also tough at times when all the media and fans could talk about was him versus Mathieu van der Poel.</p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/rouleurs-top-ten-features-no-3-floyd-does-vegas-redacted\" title=\"Floyd Landis\"><em><strong>Related: Floyd Landis does Vegas Redacted</strong></em></a></p>\n<p>“But the move wasn’t an escape, it’s not the reason I opted for more road. I raced on the road before Jumbo and had a pretty decent year with Verandas Willems-Crelan in 2018,” he says. Wout has a point – third at Strade Bianche, bronze in the European road race and top tens in the Tour of Flanders and Gent- Wevelgem wasn’t too shabby. </p>\n<p>“It’s not a case of one thing or the other, I’ll still keep racing ’cross. The main reason for the move was that I like new challenges, moving from one discipline to the other, the seasons of cycling. I could have made a good living staying in ’cross for my entire career, but wanted some change after 15 years of mainly ’cross,” he says. He adds that the crossover in training methods is growing. “Cross riders train more endurance and have bigger engines than in the past, so it’s easier to switch between disciplines without too much adaptation.” </p>\n<p>Merijn Zeeman confirms Wout’s amazing capacity to adapt. “He is a sponge, picking up and trying new things all the time, whether it’s position on the bike, nutrition from the Foodcoach app, helmet choice, every little detail matters. He has picked up a lot from roommate Steven [Kruijswijk]. Wout is always alert and looking to improve. It’s a mindset, the sign of a top rider,” says Merijn. He sees Wout as a man of huge potential. “A bit like Sagan, he can climb, he can sprint, he can do anything. </p>\n<p>“The ’cross background puts riders like Wout and Mathieu in an ideal position to fight for the win in the final of a Classic. They’re used to pushing top end power for an hour in a way most riders can’t,” says Merijn. “Explosive power is harder to develop than endurance. It’s also a mental thing: if you’ve learned to push yourself at a young age, it’s something that sticks with you. It’s very hard to pick up later if you haven’t got it.” </p>\n<p>Some say cyclo-cross riders also have a better feel for the race. “You learn that riding ’cross – bike handling, positioning, timing,” says Wout. And with the constant micro-adjustments and anticipation, riders get better at gauging their effort, sensing when to push or hold back. “The racing is more instinctive, not just relying on power readings,” he says. </p>\n<p>One of the added challenges in the winter discipline has been the increasingly technical courses. “It’s great for the spectators, but shifts the racing more towards interval efforts, less steady state,” says Wout. “I’m more of a power rider and this recent development tends to favour lighter, more technical riders like Mathieu.” </p>\n<p>Of course, Wout has amazing skills, but Mathieu is nimbler. “It means usually having to chase him coming out of the bends.” </p>\n<meta charset=\"utf-8\">\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/R20.7_ref_4_1024x1024.jpg?v=1609862367\" alt=\"\"></p>\n<p>Having Van der Poel as a rival meant there was never any room for complacency. In interviews, Wout’s trainer Marc Lamberts has said that it led to him forcing Wout’s development harder and earlier than he would if the Dutchman hadn’t been around. Wout would have had more time to grow into the under-23s. They pushed each other and now everyone else is suffering. </p>\n<p>In spite of their rivalry, Wout and Mathieu also like having a laugh. In 2016, they both featured on the Dutch television show Foute Vrienden [Dodgy Mates], where they took turns going into a gym with an earpiece and following instructions issued by the other to prank the punters working out. Mathieu instructed Wout to borrow a towel from a middle-aged man and to wipe his armpits with it. Deadpan, the Herentaler concluded the exchange by telling him that the towel would now be worth a fortune – it had been used by a world champion.</p>\n<p>It’s hard to believe when sitting opposite him now, but Wout spent most of his youth and junior years chasing the then taller and stronger Dutchman. Wout was the little one, his final growth spurt coming only as he moved up to the under-23s. Even when he had the power and broke through at the highest level by winning the 2014 Koppenbergcross ahead of Sven Nys, it kept going wrong at national and international championships – mechanicals, false starts, or simply Mathieu... </p>\n<p>It was as if Wout was cursed. Not being able to deliver when he was the favourite started getting to him. It didn’t help that the press went on to suggest he couldn’t cope with big events. Eventually, he almost expected it to go wrong. He was choking. “Something had to be done. In 2015, I started working with mental coach Rudy Heylen. He helped me turn things round and it wasn’t long before I won my first national ’cross title in Lille [his home village] in Jan 2016,” says Wout. </p>\n<p>Rudy’s approach is about total concentration on the event, on the cycling, aiming at the next bend, nothing else. “The concept is about maintaining focus, not being distracted by what’s going on around the race,” says Wout. </p>\n<p>The crash and the missed tendon injury in Pau brought back some old demons – had he used up all his luck during his great run in 2019? Wout says that once he could see the path to recovery, he ‘just’ got on with it. He only looked to the next bend, as it were. “It’s never easy, but once you have a solid plan you need to believe in it and stick to it, step by step. There’s no point dithering,” he says. His methodical approach means that he is confident he has the tools to overcome most obstacles. </p>\n<p>In addition to Rudy, Wout has a close-knit personal support network. “My parents have always helped me deal with things. But Sarah is the most important person for me now. She gets me through tough patches and I can relax with her.</p>\n<p>It’s not easy to get away from the cycling, but it’s important to switch off,” he says. “We like travelling together and have been to Zimbabwe and South Africa. We’d like to see the Northern Lights.” He has an older sister, Liese, who is supportive too, but can’t stand being the ‘sister of’. “She works as an architect and prefers to lead a normal life without all the attention,” he says. </p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/R20.7_ref_11_1024x1024.jpg?v=1609863710\" alt=\"\">Unlike Van der Poel, Wout didn’t grow up in a cycling dynasty. The only family connection to cycling is a Dutch cousin of his father’s, Jos van Aert, in the pro ranks between 1988 and 1994. He rode the Tour and the Giro. “But we only got in touch once I was already riding. He comes to races sometimes. It’s nice, but there’s no link whatsoever to me picking up cycling as a kid,” says Wout. </p>\n<p>Going into the 2019 Classics, Jumbo-Visma didn’t have a designated leader but Wout’s results quickly made him the de facto top dog. How does he feel about the role? “I don’t think I’m a great leader. I’m too independent. I prefer to make decisions and get on with it. When we’re out riding with a group and there’s endless dithering about to which café to go, I’ll be the one to say let’s go there,” he says. </p>\n<p>With the likes of Primož Roglič, Tom Dumoulin and Dylan Groenewegen on board, it’s the first time Wout is in a squad with multiple leaders. “It eases the pressure,” he says. “If we’re five riders from the team in the running for a finish, we have a better chance than if we just work for one. It’s better for everyone. And then we can see who has the legs on the day. Different situations require different leaders. It’s good to be flexible, not in a rigid system of leadership for the sake of leadership.” </p>\n<p>Objectives for the season ahead? “Cyclo-cross was definitely my first dream and will remain a goal for next winter. But now I have new dreams like winning De Ronde and Roubaix,” he adds.</p>\n<p>Okay final question – what’s your secret? Wout frowns, thinking where is this going? I’ve heard rumours of odd breakfast habits, I say. Is that from the Jumbo Foodcoach app? Wout laughs. “Oh that... No, that’s me. I was looking for something nourishing in the morning that wouldn’t give me a sugar spike. That’s how I came up with porridge made with water, bouillon and a fried egg on top for protein. [Team-mate] Laurens De Plus calls it Het ontbijt der kampionen [the breakfast of champions]. I just call it Hartig havermout [savoury porridge],” says Wout. </p>\n<h4>COMEBACK KID, AUGUST 2020</h4>\n<p>The Covid lockdown is a blow, but if anyone can plan for the unknown, it’s Wout. The postponed season gives him more time to recover from his injury and when the Classics finally arrive in August, his thigh circumference is close to symmetrical.</p>\n<p>Back in January, Merijn said Strade Bianche would come too early, but with the five-month postponement, Wout is raring to go. The half moon-shaped scar on his hip is a reminder of what he has overcome. A sign of strength. After coming third in the last two editions, he is determined to make this one count. </p>\n<p>When he makes the decisive move on the final gravel sector of Le Tolfe with 13 kilometres to go, there is no looking back. He shakes off any remaining demons from last year’s crash as he skims the tight right hander along the fence into the final wall in Siena. Wout doesn’t kill you makes you stronger. </p>\n<p>After Strade, everyone is afraid. Milan-Sanremo is almost a formality. The pecking order is shifting. Only GC riders feel safe. Or do they? Is there anything Wout can’t do? If the season so far is anything to go by, the competition could be in for a surprise. One thing’s for sure – everyone is after the formula for his oats.</p>\n<h4>WOUT’S CHAMPION OATS</h4>\n<h5>Ingredients</h5>\n<p><em>50g oats </em><br><em>150ml unsweetened almond milk </em><br><em>100ml water</em><br><em>1 table spoon plant-based bouillon/ stock powder </em><br><em>1 fried or poached egg<br><em> salt &amp; pepper </em></em></p>\n<h5>Optional </h5>\n<p><em>oregano, 10g grated Parmesan, 1⁄4 avocado</em></p>\n<h5>Preparation </h5>\n<p><em>Pour the water and the almond milk into a steel pan and heat up, keeping it just under boiling point. Mix in the bouillon powder. Add the oats and keep stirring at low heat until the porridge is done. Meanwhile, fry or poach an egg. Serve the oats with the egg on top. Add salt and pepper, oregano and/or Parmesan and a thinly-sliced quarter of an avocado.</em></p>\n<p><em>(Title illustration: Simon Scarsbrook)</em></p>\n<div class=\"klaviyo-form-UFKPji\"></div>\n    ","author":"Miles Baker-Clarke","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"dbbad6b49a8ea245b79d39b81faeea7377889647022146e4c910c879abff1810","category":"Cycling"}