{"title":"\"If you have got a job today, you’re incredibly fortunate\": NTT's Doug Ryder on the struggles of 2020","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/if-you-have-got-a-job-today-you-re-incredibly-fortunate-ntts-dough-ryder-on-the-struggles-of-2020","date":1608735979000,"content":"\n      <p><i><span style=\"font-weight: 400;\">With NTT stepping away from cycling, the team struggled to find a new sponsor, a difficulty which was amplified by the ongoing global pandemic. </span></i></p>\n<meta charset=\"utf-8\">\n<p><i><span style=\"font-weight: 400;\">In conversation on the Rouleur Podcast, with host Ian Parkinson, team manager Doug Ryder discusses with us the hardships the team have faced, his passion regarding Qhubeka and the development of African riders, as well as the team’s goals for 2021.</span></i></p>\n<p><b><i>Ian Parkinson: </i></b><span style=\"font-weight: 400;\">For a while, it looked as though NTT Pro Cycling would not be around next season, until a last minute announcement that it would continue under the name, Qhubeka Assos. It’s a relief for a lot of people, not least for team manager, Doug Ryder.</span></p>\n<p> </p>\n<p><b><i>Doug Ryder: </i></b><span style=\"font-weight: 400;\">We’ve worked really hard to try and find partners to come onboard, and I think the second wave of the pandemic that hit Europe stalled things a little bit. There were lots of really interested parties that wanted to get involved in our team. </span></p>\n<p><span style=\"font-weight: 400;\">I think our team is a special team in terms of its uniqueness and that it races for a purpose and is purpose-led. We just started to run out of time, and with UCI deadlines looming, we had options to merge with other teams and partner with other teams. But, we like our culture, we like what we race for, we like the purpose, we like the impact that we’ve made across Africa. </span></p>\n<meta charset=\"utf-8\">\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/design-a-jersey-earn-a-ride-along-at-the-spring-classics-and-help-change-lives-with-bicycles\">Related: Design an Assos jersey for Qhubeka</a></em></strong></p>\n<p><span style=\"font-weight: 400;\">Through the riders that have gone through this programme, we wanted to try and keep our own identity and our own team moving forward. So yes, we were very nervous about that, every day felt like a week! </span></p>\n<p><span style=\"font-weight: 400;\">Assos stepping up made a big difference to us. I think when we talk about being a purpose-led high performance team, purpose-led being Qhubeka and high performance being Assos that ties nicely into that. We are not a charity team, we race for a charity, but we are a high performance race team that race in the first division of world cycling, so we are always competing to win at the highest level.</span></p>\n<p><i><span style=\"font-weight: 400;\"> <img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/20200827TDF0002-A.S.O._Alex_Broadway_1024x1024.jpg?v=1608728477\" alt=\"\"></span></i></p>\n<p class=\"p1\"><em>NTT Pro Cycling at the 2020 Tour de France, soon to become Team Qhubeka Assos (Credit: Alex Broadway/ ASO)</em></p>\n<p><b><i>Ian Parkinson: </i></b><span style=\"font-weight: 400;\">You talk about the purpose of the team and racing for a purpose, for those who don’t know, what is the purpose of the team?</span></p>\n<p><i><span style=\"font-weight: 400;\"> </span></i></p>\n<p><b><i>Doug Ryder: </i></b><span style=\"font-weight: 400;\">Qhubeka is a non-profit organisation that is all about putting people on bicycles so that they can be mobile, get to school, be independent and have access to many things. A bicycle gives you access to a bigger circle of life, you are able to mobilise yourself to go to school, to go to communities, to just be independent. The biggest inhibitor in Africa is mobility and the lack of it. Kids on bicycles and people on bicycles, they can do so much more. You can travel so much further, you can carry more things, you can just do incredible things. That is our purpose. </span></p>\n<p><span style=\"font-weight: 400;\">Qhubeka is a Zulu word, it means to move forward, to carry on and to progress, so it’s nice that we are moving forward as Team Qhubeka. As I said, it is a non-profit organisation. They don’t put any money into the team, but we raise money to put funding into the communities so that kids can get to school and people can be mobile.</span></p>\n<p><i><span style=\"font-weight: 400;\"> </span></i></p>\n<p><b><i>Ian Parkinson: </i></b><span style=\"font-weight: 400;\">Now, obviously there is still a lot of uncertainty about the programme for next year - which races are going to be running and when - in Europe in particular. Do you have a sense yet of what your ambitions are for next year and which races you’re going to be lining up for?</span></p>\n<p><i><span style=\"font-weight: 400;\"> </span></i></p>\n<p><b><i>Doug Ryder: </i></b><span style=\"font-weight: 400;\">Cycling is an amazing sport because you’ve got so many things that you can focus on. There are so many different events. It’s not the same stadiums with the same ball against different teams. </span></p>\n<p><span style=\"font-weight: 400;\">Cycling is consistent, with the Grand Tours, the shorter stage-races, the monuments, we’ve always wanted to respect all of cycling. We’ve always wanted to have a strong classics team and a team that can compete in the Grand Tours. Over the years, we have tried to compete in the general classification in Grand Tours and come up a bit short, then we’ll focus on stages. We’ve had the likes of Mark Cavendish and </span><span style=\"font-weight: 400;\">Edvald Boasson Hagen, and riders like that which are focused on stage wins in the Grand Tours. So that has been one of our focus areas. </span></p>\n<p><span style=\"font-weight: 400;\">Now, I think with Domenico Pozzovivo going so well this year in the Giro d’Italia after that massive injury he had a year ago, he would focus on the GC, then potentially we’d focus on stage wins. But we’d love to bring African riders through, our whole dream and the dream of this team is that Africa has produced some of the best endurance runners, why not cyclists? </span></p>\n<p><span style=\"font-weight: 400;\">One day, we’d like to bring an African rider through our team, through our system, through our continental team and then into our World Tour team. Hopefully in time, an African rider can stand or get close to the podium of a Grand Tour, that is something I’m still really passionate about trying to achieve.</span></p>\n<p><i><span style=\"font-weight: 400;\"> <img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Doug_Ryder_Simon_Wilkinson_SWpix.com_1024x1024.jpg?v=1608728144\" alt=\"\"></span></i></p>\n<p><i>Doug Ryder at the Tour in 2018 (Credit: Simon Wilkinson/SWpix.com)</i></p>\n<p><b><i>Ian Parkinson: </i></b><span style=\"font-weight: 400;\">As far as you're concerned, in 2021 you’ll be going for the Grand Tours, you’ll be going for the Classics, you will be shooting for the top level of races?</span></p>\n<p><i><span style=\"font-weight: 400;\"> </span></i></p>\n<p><b><i>Doug Ryder: </i></b><span style=\"font-weight: 400;\">Yes. The beautiful thing about cycling is that it’s so unpredictable. It doesn’t matter how much money you have as a team, you can still compete. The engine sits inside the human being, which is amazing. I mean, look at the young generation today, they are competing at such a high level and doing such significant things in cycling, and that’s the beautiful thing. Look at Tao Geoghegan Hart, he goes and wins the Giro d’Italia. How amazing was that? He wasn’t even supposed to be that kind of guy and then gets the opportunity and does it, it’s just so beautiful to see because it gives everybody and every team some hope. </span></p>\n<p><span style=\"font-weight: 400;\">The young generation today feel that they don’t have to look up to the old guard and be respectful of the races and the distances and the other riders in the peloton, it’s just gangbusters! Everybody is just going out there racing. If you look at Hirschi during the Tour, just beautiful the way he raced and just took it on every day and every other day and did significant things. Those are the beautiful things that make us really excited about the future and for 2021.</span></p>\n<p><i><span style=\"font-weight: 400;\"> </span></i></p>\n<p><b><i>Ian Parkinson:  </i></b><span style=\"font-weight: 400;\">Looking at the rider lineup, any big changes for next year? Anything that we should be looking out for?</span></p>\n<p><i><span style=\"font-weight: 400;\"> </span></i></p>\n<p><b><i>Doug Ryder: </i></b><span style=\"font-weight: 400;\">We’ve had huge change. We’ve had a core group of riders that have left our team, particularly </span><span style=\"font-weight: 400;\">Edvald Boasson Hagen. He’s been with us for 6 years, so it was sad to see him go. I mean, maybe a new team would be good for him too. Of course, new colours is new motivation sometimes and it gives the rider a bit of an extra edge. </span></p>\n<p><span style=\"font-weight: 400;\">We’ve lost a lot of our African group of riders because they aren’t very happy that we gave the riders enough time to find other jobs in case something didn’t happen to us, because in the end we do care about the individual and their futures. </span></p>\n<p><span style=\"font-weight: 400;\">Ryan Gibbons is moving on, Amanuel Ghebreigzabhier, Louis Meintjes, Stefan de Bod, Samuele Battistella, Matteo Sobrero, and Gino Mäder, that’s a real good group of seven, eight riders that came through our Continental team into our WorldTour team, and are just getting used to the WorldTour racing. Then they move on to other teams, and they’ll shine in those teams because they’ve gone through the hard work, but we’ve worked with them and now we lose them. That’s really sad, in terms of this process that we went through to lose those guys. </span></p>\n<p><span style=\"font-weight: 400;\">For me, our coaching staff and our sports directors, we have done all the hard yards with those individuals, and now we’re not going to maximise the success or the effort that we put into building them into better riders. </span></p>\n<p><i><span style=\"font-weight: 400;\"> </span></i></p>\n<p><b><i>Ian Parkinson: </i></b><span style=\"font-weight: 400;\">It does sound, even more so this year, that pro cycling is very hand to mouth?</span></p>\n<p><i><span style=\"font-weight: 400;\"> </span></i></p>\n<p><b><i>Doug Ryder: </i></b><span style=\"font-weight: 400;\">Yes, but I think the world is like that? I mean, everybody’s literally living hand to mouth. If you have got a job today, you’re incredibly fortunate and if you don’t have ill people in your family you’re incredibly fortunate. </span></p>\n<p><span style=\"font-weight: 400;\">If the business that you’re in doesn’t have a knock on effect on other environments or your partners and stakeholders, you’re fortunate. So I think it’s not just cycling, it’s all sports and it’s life. I mean, humanity is really suffering and that’s why the beautiful thing about our team stepping up as Team Qhubeka Assos. When the world is really suffering, our team comes out and makes a really bold statement by saying, we don’t have a title partner, but in the end, we are a brand that wants to be loyal, commit to humanity, wants to fight, inspire, create hope and opportunity, to move people forward so that they can be better off. </span></p>\n<p><span style=\"font-weight: 400;\">Just during the Tour de France, Qhubeka is one of the charity partners of the Tour de France and the Heroes on Bikes campaign, giving 1,000 bicycles to teenagers and communities so that they could deliver food parcels in the pandemic to the elderly that couldn’t get to the stations where you collected food. </span></p>\n<p><span style=\"font-weight: 400;\">That’s the impact that we make. That’s what this team does. That’s why it’s so beautiful and so relevant in the world today. The amount of feedback that we’ve got from people around the world on this team, it gives us huge motivation. </span></p>\n<p><span style=\"font-weight: 400;\">Yesterday, Seal [the singer], posted our launch video on his Instagram. This team touches people around the world, it is relevant and incredibly authentic. We have been with Qhubeka for ten years, this is not something that we’ve just stuck a sticker on and window dressed. This is authentic, it’s real, we’ve been consistent with it and it’s beautiful to bring Qhubeka to the frontline and send it into the mainstream.</span></p>\n    ","author":"Miles Baker-Clarke","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"dcff8abb3b60a21a51e653877d7d6552aab0b1588af3d5ff34c1c957ffdbcbe8","category":"Cycling"}