{"title":"Bare Metal Parler Tricks","link":"https://deadline.com/2021/01/parler-ceo-says-service-dropped-by-every-vendor-and-could-end-the-company-1234670607/","date":1610323011000,"content":"\n<p>Parler CEO John Matze, late last night <a href=\"https://parler.com/post/009ba435b68c46d4955e1cd7737fa27c\">in a post on Parler</a> whose URL will likely soon stop resolving:</p>\n\n<blockquote>\n  <p>Sunday (tomorrow) at midnight Amazon will be shutting off all of\nour servers in an attempt to completely remove free speech off the\ninternet. There is the possibility Parler will be unavailable on\nthe internet for up to a week as we rebuild from scratch. We\nprepared for events like this by never relying on amazons [<em>sic</em>]\nproprietary infrastructure and building bare metal products.</p>\n\n<p>We will try our best to move to a new provider right now as we\nhave many competing for our business, however […]</p>\n</blockquote>\n\n<p>12 hours later, here’s how that was going, from a report on Deadline:</p>\n\n<blockquote>\n  <p>Parler CEO John Matze said today that his company has been dropped\nby virtually all of its business alliances after Amazon, Apple and\nGoogle ended their agreements with the social media service.\n“Every vendor from text message services to email providers to our\nlawyers all ditched us too on the same day,” <a href=\"https://video.foxnews.com/v/6221679825001#sp=show-clips\">Matze said today on\nFox News</a>. […]</p>\n\n<p>He added: “We’re going to try our best to get back online as\nquickly as possible. But we’re having a lot of trouble because\nevery vendor we talk to says they won’t work with us. Because if\nApple doesn’t approve and Google doesn’t approve, they won’t.”</p>\n</blockquote>\n\n<p>Here’s what Parler is (was?): pretty much 8kun/4chan for people who want something modeled on social media conceptually (a service with atomic “posts”) as opposed to a web forum, with the added veneer of Fox News-ish celebrity affirmation, having “stars” like <a href=\"https://parler.com/profile/seanhannity/posts\">Sean Hannity</a>, <a href=\"https://parler.com/profile/Dbongino/posts\">Dan Bongino</a>, <a href=\"https://parler.com/profile/Cernovich/posts\">Michael Cernovich</a>, and whoever else they recognize from the Fox News cinematic universe, shitposting links to rightwing “news” sites on it.</p>\n\n<p>4chan with rightwing celebrity endorsements. That’s Parler.</p>\n\n<div>\n<a  title=\"Permanent link to ‘Bare Metal Parler Tricks’\"  href=\"https://daringfireball.net/linked/2021/01/10/bare-metal-parler-tricks\">&nbsp;★&nbsp;</a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"de76fb0a54c385dc69164a107c74dfa2e4182e02cb7a25d92fcad14225fc3ed0","category":"Tech"}