{"title":"Hush: Noiseless Browsing for Safari","link":"https://oblador.github.io/hush/","date":1611429816000,"content":"\n<p>Lovely new Safari content blocking extension for Safari (iOS and Mac) by Joel Arvidsson. It targets those insipid, never-ending, utterly pointless “cookie notices”, popovers begging you to join email newsletters, and other bits of tracking. It kills dickbars and dickbar-like annoyances. I’ve been running it for days and it’s the sort of thing you don’t notice <em>at all</em> until you disable it and all of a sudden you’re back to approving cookie access every single goddamn time you load an article at The Guardian and squinting to find the hidden “X” that closes a popover asking if you’ll sign up for something you don’t want and never asked for.</p>\n\n<p>Hush is a throwback to the days when good clever people made good clever things, polished them to perfection simply because they care, and just shared them with the world. Hush is free of charge, <a href=\"https://github.com/oblador/hush\">open source</a>, specifically written for Safari (using SwiftUI), and it is very small and lightweight. It’s also completely private — everything Hush does, it does on your device and it doesn’t ask for permission to see what you’re doing on the web. And it’s super-simple: just download from the App Store and enable it in Safari’s preferences on Mac or Settings → Safari → Content Blockers on iOS.<sup>*</sup></p>\n\n<p>I’d recommend Hush to anyone who uses Safari, and <a href=\"https://github.com/sponsors/oblador\">I thank Arvidsson for making it</a>.</p>\n\n<p><small>* The one and only catch: Hush requires MacOS 11 Big Sur and iOS 14 or later. Honestly, though, I recommend both of those to everyone, too.</small></p>\n\n<div>\n<a  title=\"Permanent link to ‘Hush: Noiseless Browsing for Safari’\"  href=\"https://daringfireball.net/linked/2021/01/23/hush\">&nbsp;★&nbsp;</a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"e68451a02bb72582cf3f59aa9880fe522360fa3487c17428285c7250ba4e086b","category":"Tech"}