{"title":"Egyptian archaeologists unearth dozens of tombs at Saqqara necropolis","link":"https://arstechnica.com/?p=1736999","date":1611588790000,"content":"<div id=\"rss-wrap\">\n<figure class=\"intro-image intro-left\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/01/book-of-the-dead-800x800.jpg\" alt=\"Color photo of fragments of papyrus laid out on a table\"><p class=\"caption\" style=\"font-size:0.8em\"><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/01/book-of-the-dead.jpg\" class=\"enlarge-link\" data-height=\"960\" data-width=\"960\">Enlarge</a> <span class=\"sep\">/</span> Copies of the Book of the Dead, or excerpts from it, were often included in burials so the deceased would have a guide to the afterlife. (credit: <a rel=\"nofollow\" class=\"caption-link\" href=\"http://www.antiquities.gov.eg/DefaultAr/pages/NewsDetails.aspx?newsid=2420\">Egyptian Ministry of Tourism and Antiquities</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Archaeologists in Egypt are preparing to open a 3,000-year-old burial shaft at the Saqqara necropolis, south of Cairo, in the coming week.</p>\n<p>The unexplored tomb is one of 52 burial shafts clustered near the much older pyramid of the Pharaoh Teti. Workers at the site found the entrance to the latest shaft earlier this week as they were preparing to announce a slew of other finds at the site, including the tombs of military leaders and high-ranking courtiers, a copy of the Book of the Dead, and ancient board games. Also among the discoveries is the name of the owner of an elaborate mortuary temple near Teti’s pyramid: Narat or Naert, the pharaoh’s queen.</p>\n<p>“I’d never heard of this queen before. Therefore we add an important piece of Egyptian history about this queen,” archaeologist and former Egyptian Minister of Antiquities Zahi Hawass told CBS News. Archaeologists first unearthed the stone temple in 2010, but it wasn’t clear who the grand structure had been built for. At mortuary temples like this one, priests and supplicants could make offerings to the dead queen to keep her comfortable in the afterlife—and ask her to help them out in this world.</p></div><p><a href=\"https://arstechnica.com/?p=1736999#p3\">Read 13 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1736999&comments=1\">Comments</a></p>","author":"Kiona N. Smith","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"ee6f5b971a24c076790cbc8d1cba44ba0b99eababa343ac8bb8b5a7917051bd2","category":"Tech"}