{"title":"Professional Golf Cuts Ties to Trump Courses","link":"https://www.motherjones.com/politics/2021/01/pro-golf-finally-cancels-donald-trump/","date":1610396921000,"content":"\n<p>Russ Choma, reporting for Mother Jones:</p>\n\n<blockquote>\n  <p>Sunday night, <a href=\"https://www.pga.com/story/a-statement-from-the-pga-of-america-on-the-2022-pga-championship\">the PGA of America announced</a> that it was nixing\nits plans to hold the 2022 PGA Championship at Trump’s New Jersey\ngolf course. It’s not a small move. Championships are named far in\nadvance — the PGA website <a href=\"https://www.pga.com/story/future-sites-of-the-pga-championship\">currently lists</a> the site of future\nChampionships through 2034 — and the PGA has been planning on\nusing Trump Bedminster for its 2022 Championship since 2014. Since\nhe started purchasing and developing golf courses, Trump has\navidly pursued PGA events at his properties. These events not only\nbring media attention and crowds of visitors, but they confer the\nkind of acceptance Trump has always struggled to win from the\nmoneyed and powerful classes. […]</p>\n\n<p>In a nearly simultaneous blow, the R&amp;A, golf’s Scotland-based\ngoverning body outside of the United States, issued its own\nstatement early Monday morning. It announced that it will avoid\nusing Trump’s premiere Scottish golf course, Turnberry, for the\n“forseeable future” for any of its championships. Turnberry is a\nlegendary course and is one of a handful of courses in the United\nKingdom that has been allowed to host a British Open Championship — one of the most prestigious events in all of golf.</p>\n</blockquote>\n\n<p>When you’re a Republican and you lose the PGA — of all professional sports — you’re done.</p>\n\n<div>\n<a  title=\"Permanent link to ‘Professional Golf Cuts Ties to Trump Courses’\"  href=\"https://daringfireball.net/linked/2021/01/11/pga-trump\">&nbsp;★&nbsp;</a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"f09e7815278f148a968c78da19d305ab0f3dc7b5604a58cd2b744dca9c1eb94b","category":"Tech"}