{"title":"HashiCorp Inducted Into JPMorgan Chase Hall of Innovation","link":"https://www.hashicorp.com/blog/hashicorp-inducted-into-jpmorgan-chase-hall-of-innovation","date":1608317100000,"content":"<p><span style=\"font-weight: 400;\">We are pleased to share that HashiCorp has been inducted into the JPMorgan Chase Hall of Innovation, which recognizes companies that have gone above and beyond in delivering disruptive technology and creating business value for JPMorgan Chase. JPMorgan Chase uses several of our products as part of their software-defined transformation, including using HashiCorp Terraform to enable their multi-cloud strategy.</span></p><p><span style=\"font-weight: 400;\">&nbsp;</span><span style=\"font-weight: 400;\">&ldquo;We believe that partnership with entrepreneurial companies and their innovative technologies is critical to our success,&rdquo; said George Sherman, CIO for Global Technology Infrastructure, at JPMorgan Chase. &ldquo;Hashicorp has helped us standardize our public and private infrastructure provisioning, and is future-proofing our environment as we continue on our modernization journey.</span></p><p><span style=\"font-weight: 400;\">&nbsp;</span><span style=\"font-weight: 400;\">JPMorgan Chase chose to partner with HashiCorp early into the development of Terraform Enterprise and helped us understand what large, complex financial services customers need from the product. This partnership has allowed JPMorgan Chase to accelerate both their on-premises and cloud-based infrastructure as code efforts, delivering high-scale applications faster, safer, and at scale.</span></p><p><span style=\"font-weight: 400;\">This award was presented to HashiCorp during the 12th annual JPMorgan Technology Innovation Symposium, which took place at the end of October. Each year, the JPMorgan Chase Hall of Innovation Award recognizes select emerging tech vendors for their innovation, business value, and disruptive nature. &nbsp; &nbsp; </span></p>","author":"Kate Lehman","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"f53b74ce3d02e7ef87330fd50166547c0dd08adddae8cb505b3eb3391cbb390d","category":"Tech"}