{"title":"Sumo Logic and Databricks Among 9 Newly Verified Terraform Providers","link":"https://www.hashicorp.com/blog/sumo-logic-and-databricks-among-9-newly-verified-terraform-providers","date":1608314400000,"content":"<p>Since <a href=\"https://www.hashicorp.com/blog/providers-in-the-hashicorp-terraform-registry-now-live\">adding providers to the Terraform Registry</a> in August, we’ve been blown away by the influx of powerful new integrations being shared by our partners and the wider community. At the time of writing, over 600 providers and 4,500 modules have been published.</p>\n<h2><a class=\"__permalink-h\" href=\"#introducing-new-verified-providers\" aria-label=\"introducing new verified providers permalink\">»</a><a class=\"__target-h\" id=\"introducing-new-verified-providers\" aria-hidden></a>Introducing New Verified Providers</h2>\n<p>As the practice of infrastructure as code expands into new solution spaces, Terraform users rely more and more on the integrations they use being robust and well-supported. A growing portion of the providers available to our users are <em>verified</em>, a tier indicating that the integration is owned and maintained by a HashiCorp Technology Partner, and that the vendor has gone through our partner onboarding process. The experience Terraform offers would not be possible without this growing set of providers and the partnerships behind them.</p>\n<p>We’re excited to welcome these nine new verified integrations to our ecosystem, each now available to all Terraform users:</p><img src=https://www.datocms-assets.com/2885/1608326076-december-provider-logos2.png alt=december providers><h3><a class=\"__permalink-h\" href=\"#sumo-logic\" aria-label=\"sumo logic permalink\">»</a><a class=\"__target-h\" id=\"sumo-logic\" aria-hidden></a>Sumo Logic</h3>\n<p>The <a href=\"https://registry.terraform.io/providers/SumoLogic/sumologic/latest\">Sumo Logic</a> Terraform provider verified by HashiCorp lets you manage your Sumo Logic resources in code. Users can leverage it to set up and maintain a wide variety of Sumo Logic resources including users, roles, collectors, sources, and other related objects. This Terraform provider can be used along with any other providers you might already be using to quickly set up and link monitoring for your infrastructure, all while managing your Sumo Logic environment.</p>\n<h3><a class=\"__permalink-h\" href=\"#databricks\" aria-label=\"databricks permalink\">»</a><a class=\"__target-h\" id=\"databricks\" aria-hidden></a>Databricks</h3>\n<p><a href=\"https://registry.terraform.io/providers/databrickslabs/databricks/latest\">Databricks</a>, which offers a data analytics platform, recently introduced a Terraform provider. Their platform unifies data science and engineering across the Machine Learning lifecycle, from data preparation to experimentation and deployment of ML applications.</p>\n<h3><a class=\"__permalink-h\" href=\"#arista\" aria-label=\"arista permalink\">»</a><a class=\"__target-h\" id=\"arista\" aria-hidden></a>Arista</h3>\n<p><a href=\"https://registry.terraform.io/providers/aristanetworks/cloudeos/latest\">CloudEOS</a> is Arista’s multi-cloud and cloud-native networking solution supporting autonomic operation to deliver an enterprise-class, highly-secure, and reliable networking experience for any cloud. Arista has chosen Hashicorp Terraform to implement the CloudEOS solution using an infrastructure as code approach for building, changing, and versioning infrastructure safely and efficiently.</p>\n<h3><a class=\"__permalink-h\" href=\"#equinix-metal\" aria-label=\"equinix metal permalink\">»</a><a class=\"__target-h\" id=\"equinix-metal\" aria-hidden></a>Equinix Metal</h3>\n<p><a href=\"https://registry.terraform.io/providers/equinix/metal/latest\">Equinix Metal</a> offers a hosted service for organizations looking to deploy cloud-based, bare-metal infrastructure. The <a href=\"https://registry.terraform.io/providers/packethost/packet/latest\">Packet</a> Terraform provider enables operators to provision and manage resources that interact with the Packet platform.</p>\n<h3><a class=\"__permalink-h\" href=\"#grafana\" aria-label=\"grafana permalink\">»</a><a class=\"__target-h\" id=\"grafana\" aria-hidden></a>Grafana</h3>\n<p><a href=\"https://registry.terraform.io/providers/grafana/grafana/latest\">Grafana</a> Terraform provider allows for the management of Grafana resources as part of a Terraform workflow. Grafana resources include entities like dashboards, data sources, and users.</p>\n<h3><a class=\"__permalink-h\" href=\"#signal-sciences-fastly\" aria-label=\"signal sciences fastly permalink\">»</a><a class=\"__target-h\" id=\"signal-sciences-fastly\" aria-hidden></a>Signal Sciences (Fastly)</h3>\n<p>The <a href=\"https://registry.terraform.io/providers/signalsciences/sigsci/latest\">Signal Sciences</a> provider enables users to manage their Signal Sciences resources with Terraform. Use the provider to manage Signal Sciences rules, lists, alerts, signals, redactions, and more.</p>\n<h3><a class=\"__permalink-h\" href=\"#cloudflare\" aria-label=\"cloudflare permalink\">»</a><a class=\"__target-h\" id=\"cloudflare\" aria-hidden></a>Cloudflare</h3>\n<p><a href=\"https://registry.terraform.io/providers/cloudflare/cloudflare/latest\">Cloudflare</a> is a content delivery service that provides services including DNS, DDoS Protection, and CDN. The Cloudflare provider enables organizations to provision and manage Cloudflare resources as a part of their Terraform workflow.</p>\n<h3><a class=\"__permalink-h\" href=\"#checkpoint\" aria-label=\"checkpoint permalink\">»</a><a class=\"__target-h\" id=\"checkpoint\" aria-hidden></a>Checkpoint</h3>\n<p>The <a href=\"https://registry.terraform.io/providers/CheckPointSW/checkpoint/latest\">Check Point</a> and <a href=\"https://registry.terraform.io/providers/dome9/dome9/latest\">Dome9</a> Terraform providers enable users to manage Check Point's Next Generation Firewall and Security API. Operators can provision and manage firewall configurations and resources using these providers.</p>\n<h3><a class=\"__permalink-h\" href=\"#civo\" aria-label=\"civo permalink\">»</a><a class=\"__target-h\" id=\"civo\" aria-hidden></a>Civo</h3>\n<p><a href=\"https://registry.terraform.io/providers/civo/civo/latest\">Civo</a> Terraform provider lets you launch k3s clusters and all Civo resources. The world's first managed k3s service; Kubernetes for developers, testing, and learning.</p>\n<h2><a class=\"__permalink-h\" href=\"#sharing-modules-and-providers-made-easy\" aria-label=\"sharing modules and providers made easy permalink\">»</a><a class=\"__target-h\" id=\"sharing-modules-and-providers-made-easy\" aria-hidden></a>Sharing Modules and Providers, Made Easy</h2>\n<p>We continually strive to make provider and module authoring an easy experience for the community. This month, we’re introducing <a href=\"https://github.com/hashicorp/terraform-plugin-docs\">terraform-plugin-docs</a> – a new tool that helps provider publishers automatically generate and update their provider documentation. The Registry displays documentation for the providers it hosts, and <code>terraform-plugin-docs</code> makes it easy to automatically generate documentation for your provider in the format necessary for the Terraform Registry. Several of our newer providers have used this tool, including the new <a href=\"https://registry.terraform.io/providers/hashicorp/boundary/latest\">Boundary Provider</a>. Head over to our publishing documentation to learn more about this <a href=\"https://www.terraform.io/docs/registry/providers/docs.html#generating-documentation\">new tool</a>!</p>\n<p>In case you missed it, the latest release of Terraform introduces a new <code>provider source</code> attribute, allowing Terraform to install all providers from the Terraform Registry, including those from the community, automatically. To complement this, we’ve worked hard to make sharing providers and modules easy as well, and the outcome is a rapidly growing segment of <a href=\"https://registry.terraform.io/browse/providers?tier=community\">community-shared providers</a>, spanning across a wide and growing range of solution categories.</p><img src=https://www.datocms-assets.com/2885/1601403555-provider-categories.png alt=Terraform module and provider categories><p>We encourage you to take a look at all of the available Terraform integrations by visiting <a href=\"https://registry.terraform.io/\">registry.terraform.io</a>, and can’t wait to see what other new integrations get shared by our community! If you’re interested in verifying an existing provider, please take a look at our <a href=\"https://www.terraform.io/guides/terraform-provider-development-program.html\">Terraform Provider Development Program</a> for more info.</p>","author":"Chris Griggs","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"fa72e0f2a698155b4684d3a9917c990acf5adb93d199df4aca41c3ff5f609660","category":"Tech"}